[
  {
    "title": "‘The Stringer’ Stands to Destroy Reputations | The PetaPixel Podcast",
    "q": "‘the stringer’ stands to destroy reputations | the petapixel podcast camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘The Stringer’ Stands to Destroy Reputations | The PetaPixel Podcast</b><br>On Friday, November 28, Netflix will premiere a documentary film that challenges the authorship of the most famous war photo ever taken: \"The Terror of War\" or, more commonly known, \"Napalm Girl.\" Does it succeed? What isn't shared in the …<br><a href=\"https://petapixel.com/2025/11/26/the-stringer-stands-to-destroy-reputations-the-petapixel-podcast/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/26/the-stringer-stands-to-destroy-reputations-the-petapixel-podcast/",
    "topic": "photo",
    "date": "2025-11-26T18:01:50.000Z"
  },
  {
    "title": "Photographer Sues Art Gallery for Selling Jay-Z Figurines Based on His Image of Rapper",
    "q": "photographer sues art gallery for selling jay-z figurines based on his image of rapper camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Sues Art Gallery for Selling Jay-Z Figurines Based on His Image of Rapper</b><br>A photographer has filed a lawsuit against a Brooklyn art gallery, accusing it of selling figurines based on his copyrighted photo of Jay-Z. [Read More]<br><a href=\"https://petapixel.com/2025/11/26/photographer-sues-art-gallery-for-selling-jay-z-figurines-based-on-his-image-of-rapper/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/26/photographer-sues-art-gallery-for-selling-jay-z-figurines-based-on-his-image-of-rapper/",
    "topic": "photo",
    "date": "2025-11-26T15:57:10.000Z"
  },
  {
    "title": "This AI-Powered Camera Auto-Tracks Subjects and Has a 1,750mm Zoom Lens",
    "q": "this ai-powered camera auto-tracks subjects and has a 1,750mm zoom lens camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This AI-Powered Camera Auto-Tracks Subjects and Has a 1,750mm Zoom Lens</b><br>An intriguing conceptual camera made by a group of former DJI engineers will launch on Kickstarter next month. The RocX made by Farseer can be plugged into a DSLR or mirrorless camera, as well as working on its own. [Read More]<br><a href=\"https://petapixel.com/2025/11/26/this-ai-powered-camera-auto-tracks-subjects-and-has-a-1750mm-zoom-lens/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/26/this-ai-powered-camera-auto-tracks-subjects-and-has-a-1750mm-zoom-lens/",
    "topic": "photo",
    "date": "2025-11-26T15:21:21.000Z"
  },
  {
    "title": "8 Micro Four Thirds Myths, Exposed by Four Full-Frame Converts",
    "q": "8 micro four thirds myths, exposed by four full-frame converts camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>8 Micro Four Thirds Myths, Exposed by Four Full-Frame Converts</b><br>Photography often feels like a battle against physics, where image quality supposedly demands heavy glass and aching backs. However, … [Read More]<br><a href=\"https://petapixel.com/2025/11/26/8-micro-four-thirds-myths-exposed-by-four-full-frame-converts/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/26/8-micro-four-thirds-myths-exposed-by-four-full-frame-converts/",
    "topic": "photo",
    "date": "2025-11-26T14:55:32.000Z"
  },
  {
    "title": "Google’s Nano Banana Pro AI Model Further Erodes Trust in Photos",
    "q": "google’s nano banana pro ai model further erodes trust in photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Google’s Nano Banana Pro AI Model Further Erodes Trust in Photos</b><br>Google has released a more advanced version of its Nano Banana AI image model, and it is becoming increasingly difficult to spot the difference between real and AI-generated photos. [Read More]<br><a href=\"https://petapixel.com/2025/11/26/googles-nano-banana-pro-ai-model-further-erodes-trust-in-photos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/26/googles-nano-banana-pro-ai-model-further-erodes-trust-in-photos/",
    "topic": "photo",
    "date": "2025-11-26T12:21:23.000Z"
  },
  {
    "title": "‘The Stringer’ on Netflix Review: Nobody Is Going to Believe Nick Ut Took ‘Napalm Girl’ Now",
    "q": "‘the stringer’ on netflix review: nobody is going to believe nick ut took ‘napalm girl’ now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘The Stringer’ on Netflix Review: Nobody Is Going to Believe Nick Ut Took ‘Napalm Girl’ Now</b><br>The Stringer: The Man Who Took the Photo, which lands on Netflix this week, opens with a line implying Nick Ut is a liar: \"What you do know is what you didn’t take.\" But is that really true? I've always thought the inverse makes more sense…<br><a href=\"https://petapixel.com/2025/11/25/the-stringer-on-netflix-review-nobody-is-going-to-believe-nick-ut-took-napalm-girl-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/the-stringer-on-netflix-review-nobody-is-going-to-believe-nick-ut-took-napalm-girl-now/",
    "topic": "photo",
    "date": "2025-11-25T18:59:31.000Z"
  },
  {
    "title": "Sony Future Filmmaker Awards Showcase Up-and-Coming Talent",
    "q": "sony future filmmaker awards showcase up-and-coming talent camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony Future Filmmaker Awards Showcase Up-and-Coming Talent</b><br>Alongside the annual Sony World Photography Awards, Sony and Creo also have a competition dedicated to filmmaking, the Sony Future Filmmaker Awards. [Read More]<br><a href=\"https://petapixel.com/2025/11/25/sony-future-filmmaker-awards-showcase-up-and-coming-talent/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/sony-future-filmmaker-awards-showcase-up-and-coming-talent/",
    "topic": "photo",
    "date": "2025-11-25T18:41:14.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": "2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation",
    "q": "2025 royal photographic society awards reveal groundbreaking winners in art, science and innovation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation</b><br>Photos from left to right: Omar Victor Diop, Susan Derges HonFRPS and Jaskirt Dhaliwal-Boora The Royal Photographic Society has announced the recipients of its 2025 Awards. The contest highlights significant contributions across both the a…<br><a href=\"https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation",
    "topic": "photo",
    "date": "2025-11-24T15:55:00.000Z"
  },
  {
    "title": "The answers you missed: What our staff revealed in the DPReview AMA",
    "q": "the answers you missed: what our staff revealed in the dpreview ama camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The answers you missed: What our staff revealed in the DPReview AMA</b><br>Last week, the DPReview Editorial team hosted its first Ask Me Anything (AMA) event in the new forums. These AMA sessions are a great way to engage directly with our staff and pose those burning questions you've always wanted to ask. We ad…<br><a href=\"https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama",
    "topic": "photo",
    "date": "2025-11-23T15:00:00.000Z"
  },
  {
    "title": "Leica Q3 Monochrome sample gallery: all spelled out in black and white",
    "q": "leica q3 monochrome sample gallery: all spelled out in black and white camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Leica Q3 Monochrome sample gallery: all spelled out in black and white</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Richard Butler Leica recently released the Q3 Monochrom, a black-and-white-only version of its full-frame, fixed-lens camera. Like the color model, it feat…<br><a href=\"https://www.dpreview.com/samples/6018179961/leica-q3-monochrom-sample-gallery\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/samples/6018179961/leica-q3-monochrom-sample-gallery",
    "topic": "photo",
    "date": "2025-11-23T14:00:00.000Z"
  },
  {
    "title": "Tis the Season: the DPReview team discusses giving and getting gifts",
    "q": "tis the season: the dpreview team discusses giving and getting gifts camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Tis the Season: the DPReview team discusses giving and getting gifts</b><br>Next week marks the start of the gift-giving season in many parts of the world, so the DPReview team sat down to discuss the things people should keep in mind when shopping for the photographers and creators in their lives. We also shared …<br><a href=\"https://www.dpreview.com/videos/7563624966/dpreview-team-discussion-gifts-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/videos/7563624966/dpreview-team-discussion-gifts-2025",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": " BREAKING: A new Sony Alpha is coming next week – and the teaser contains a major hint ",
    "q": " breaking: a new sony alpha is coming next week – and the teaser contains a major hint  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> BREAKING: A new Sony Alpha is coming next week – and the teaser contains a major hint </b><br>Sony has shared a teaser on Instagram, hinting that a new Alpha mirrorless camera product is coming next week<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/breaking-a-new-sony-alpha-is-coming-next-week-and-the-teaser-contains-a-major-hint\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/breaking-a-new-sony-alpha-is-coming-next-week-and-the-teaser-contains-a-major-hint",
    "topic": "photo",
    "date": "2025-11-26T17:26:20.000Z"
  },
  {
    "title": " Napalm Girl documentary arrives on Netflix ths week, triggered by 52-year-old secret that plagued photo editor – and I can't wait to watch it! ",
    "q": " napalm girl documentary arrives on netflix ths week, triggered by 52-year-old secret that plagued photo editor – and i can't wait to watch it!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Napalm Girl documentary arrives on Netflix ths week, triggered by 52-year-old secret that plagued photo editor – and I can't wait to watch it! </b><br>What's the origin of one of the most powerful images ever made? A new Netflix documentary reopens the debate over the authorship of a photograph that defined the Vietnam War<br><a href=\"https://www.digitalcameraworld.com/photography/photojournalism/napalm-girl-documentary-arrives-on-netflix-ths-week-triggered-by-52-year-old-secret-that-plagued-photo-editor-and-i-cant-wait-to-watch-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photojournalism/napalm-girl-documentary-arrives-on-netflix-ths-week-triggered-by-52-year-old-secret-that-plagued-photo-editor-and-i-cant-wait-to-watch-it",
    "topic": "photo",
    "date": "2025-11-26T15:40:23.000Z"
  },
  {
    "title": " This new compact camera is the size of a tape measure, has a retro sliding lens door, and brings fun back to photography (for just $89)  ",
    "q": " this new compact camera is the size of a tape measure, has a retro sliding lens door, and brings fun back to photography (for just $89)   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This new compact camera is the size of a tape measure, has a retro sliding lens door, and brings fun back to photography (for just $89)  </b><br>\"This camera isn't just for photographers – it's for people who love moments\" – Let's discover this new compact camera as it might become one of 2025's most delightfully unexpected hits...<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/this-new-compact-camera-is-the-size-of-a-tape-measure-has-a-retro-sliding-lens-door-and-brings-fun-back-to-photography-for-just-usd89\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/this-new-compact-camera-is-the-size-of-a-tape-measure-has-a-retro-sliding-lens-door-and-brings-fun-back-to-photography-for-just-usd89",
    "topic": "photo",
    "date": "2025-11-26T13:49:18.000Z"
  },
  {
    "title": "DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools",
    "q": "dxo’s black friday deals take up to 50% off flagship photo editing tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools</b><br>DxO is rolling out its annual Black Friday sale with significant discounts across its full software lineup, offering up to 50% off both new licenses and upgrades. The promotion runs from November 18 through December 2, 2025. The sale spans…<br><a href=\"https://www.slrlounge.com/dxo-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-26T13:00:26.000Z"
  },
  {
    "title": "Best Booking Apps for Photographers",
    "q": "best booking apps for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Booking Apps for Photographers</b><br>As a photographer, managing your bookings and scheduling is an important but time consuming task that can detract from your productivity and workflow. However, with the increasing availability of scheduling and booking software and apps, m…<br><a href=\"https://www.slrlounge.com/best-booking-apps-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-booking-apps-for-photographers/",
    "topic": "photo",
    "date": "2025-11-25T23:34:28.000Z"
  },
  {
    "title": "What Camera Should I get? | How Many Megapixels Do I Need?",
    "q": "what camera should i get? | how many megapixels do i need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What Camera Should I get? | How Many Megapixels Do I Need?</b><br>What camera should I get is one of those fundamental questions that, at some point, we all ask. In this article, we cover one of the key measurements we all use when deciding which camera to purchase. Megapixels<br><a href=\"https://www.slrlounge.com/what-camera-should-i-get-how-many-megapixels-do-i-need/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/what-camera-should-i-get-how-many-megapixels-do-i-need/",
    "topic": "photo",
    "date": "2025-11-24T22:33:00.000Z"
  },
  {
    "title": "Aiarty Image Enhancer 3.5: Faster Photo Upscaling with Sharper, Cleaner Results (49% OFF Black Friday)",
    "q": "aiarty image enhancer 3.5: faster photo upscaling with sharper, cleaner results (49% off black friday) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aiarty Image Enhancer 3.5: Faster Photo Upscaling with Sharper, Cleaner Results (49% OFF Black Friday)</b><br>Aiarty has announced version 3.5 of its AI-powered image enhancement tool for Windows and macOS, adding precise control over sharpening, integrated color correction, and native support for NVIDIA’s new RTX 50-series GPUs. The update target…<br><a href=\"https://www.slrlounge.com/new-aiarty-image-enhancer-v3-5-faster-processing-and-precision-controlled-ai-upscaling/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/new-aiarty-image-enhancer-v3-5-faster-processing-and-precision-controlled-ai-upscaling/",
    "topic": "photo",
    "date": "2025-11-23T20:00:00.000Z"
  },
  {
    "title": "How to Calibrate Your Monitor For Accurate Results",
    "q": "how to calibrate your monitor for accurate results camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Calibrate Your Monitor For Accurate Results</b><br>A properly calibrated monitor is an essential part of color management and achieving the perfect image. But as a photographer, do you know as much as you should?<br><a href=\"https://www.slrlounge.com/why-calibrating-your-screen-is-important-how-to-do-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/why-calibrating-your-screen-is-important-how-to-do-it/",
    "topic": "photo",
    "date": "2025-11-23T16:21:00.000Z"
  },
  {
    "title": "Types of Camera Lenses Explained",
    "q": "types of camera lenses explained camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Types of Camera Lenses Explained</b><br>Do you know the difference between a Zoom lens and a Telephoto Lens? If you have ever wondered what all the different types of camera lenses are, then here is the complete guide you must read! Below, we will cover all types of camera lense…<br><a href=\"https://www.slrlounge.com/types-of-camera-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/types-of-camera-lenses/",
    "topic": "photo",
    "date": "2025-11-21T19:56:27.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "Microsoft’s latest 13-inch Surface Laptop is down to $549.99, a new record low price",
    "q": "microsoft’s latest 13-inch surface laptop is down to $549.99, a new record low price windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft’s latest 13-inch Surface Laptop is down to $549.99, a new record low price</b><br>Microsoft’s latest Surface Laptop offers beautiful hardware and starts at just $549.99. If you’re a Windows user looking for something that comes close to Apple’s latest MacBook Air, Microsoft’s newest 13-inch Surface Laptop — officially c…<br><a href=\"https://www.theverge.com/gadgets/830182/microsoft-surface-laptop-black-friday-2025-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/830182/microsoft-surface-laptop-black-friday-2025-deal-sale",
    "topic": "it",
    "date": "2025-11-26T17:26:42.000Z"
  },
  {
    "title": "ChatGPT and Copilot are being booted out of WhatsApp",
    "q": "chatgpt and copilot are being booted out of whatsapp windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>ChatGPT and Copilot are being booted out of WhatsApp</b><br>OpenAI’s ChatGPT and Microsoft’s Copilot are both leaving WhatsApp thanks to upcoming changes to the messaging app’s terms of service that will prohibit using it to distribute AI chatbots not made by Meta. OpenAI announced its planned depa…<br><a href=\"https://www.theverge.com/news/829808/chatgpt-copilot-ai-llm-leaving-whatsapp-meta\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/829808/chatgpt-copilot-ai-llm-leaving-whatsapp-meta",
    "topic": "it",
    "date": "2025-11-26T13:00:55.000Z"
  },
  {
    "title": " Here are 85 Walmart Black Friday deals actually worth buying – big-screen TVs, air fryers, Apple, Lego, and more ",
    "q": " here are 85 walmart black friday deals actually worth buying – big-screen tvs, air fryers, apple, lego, and more  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Here are 85 Walmart Black Friday deals actually worth buying – big-screen TVs, air fryers, Apple, Lego, and more </b><br>I'm rounding up the 85 best Walmart Black Friday deals worth buying, from Apple, Lego, Ninja, and more, plus information on when stores open on Black Friday.<br><a href=\"https://www.techradar.com/live/news/walmarts-best-black-friday-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/live/news/walmarts-best-black-friday-deals-2025",
    "topic": "it",
    "date": "2025-11-26T17:43:23.000Z"
  },
  {
    "title": " I was skeptical about the Nothing Phone 3, but after a month of testing, I finally get what it's all about ",
    "q": " i was skeptical about the nothing phone 3, but after a month of testing, i finally get what it's all about  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> I was skeptical about the Nothing Phone 3, but after a month of testing, I finally get what it's all about </b><br>The Nothing Phone 3 matches Samsung and Apple flagships in price, but has its own novel appeal.<br><a href=\"https://www.techradar.com/phones/nothing-phones/nothing-phone-3-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/phones/nothing-phones/nothing-phone-3-review",
    "topic": "it",
    "date": "2025-11-26T17:37:37.000Z"
  },
  {
    "title": " Secure yourself and save 30% with these Black Friday deals on YubiKey 5 NFC fobs — essential protection just got cheaper ",
    "q": " secure yourself and save 30% with these black friday deals on yubikey 5 nfc fobs — essential protection just got cheaper  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Secure yourself and save 30% with these Black Friday deals on YubiKey 5 NFC fobs — essential protection just got cheaper </b><br>Save 30% off a YubiKey security key for Black Friday.<br><a href=\"https://www.tomshardware.com/software/security-software/secure-yourself-and-save-30-percent-with-these-black-friday-deals-on-yubikey-5-nfc-fobs-essential-protection-just-got-cheaper\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/software/security-software/secure-yourself-and-save-30-percent-with-these-black-friday-deals-on-yubikey-5-nfc-fobs-essential-protection-just-got-cheaper",
    "topic": "it",
    "date": "2025-11-26T15:47:14.000Z"
  },
  {
    "title": "Amazon's 2025 Black Friday deals surprised me: Shop my favorite deals on Apple, Oura, and Bose",
    "q": "amazon's 2025 black friday deals surprised me: shop my favorite deals on apple, oura, and bose windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Amazon's 2025 Black Friday deals surprised me: Shop my favorite deals on Apple, Oura, and Bose</b><br>Black Friday is two days away, but Amazon's deals are live now. These are the top deals I've uncovered so far, like the Oura Ring 4 for 30% off.<br><a href=\"https://www.zdnet.com/article/black-friday-amazon-deals-ps5-earbuds-tvs/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-amazon-deals-ps5-earbuds-tvs/",
    "topic": "it",
    "date": "2025-11-26T18:10:15.000Z"
  },
  {
    "title": "How Microsoft Entra aims to keep your AI agents from running wild",
    "q": "how microsoft entra aims to keep your ai agents from running wild windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How Microsoft Entra aims to keep your AI agents from running wild</b><br>AI agents amok could cause real problems - Entra takes a shot at reining them in<br><a href=\"https://www.zdnet.com/article/how-microsoft-entra-aims-to-keep-your-ai-agents-from-running-wild/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/how-microsoft-entra-aims-to-keep-your-ai-agents-from-running-wild/",
    "topic": "it",
    "date": "2025-11-26T18:04:09.000Z"
  },
  {
    "title": "I found the best Black Friday deals: 85+ sales from Apple, HBO, LG, Roku, and more tracked live",
    "q": "i found the best black friday deals: 85+ sales from apple, hbo, lg, roku, and more tracked live windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Black Friday deals: 85+ sales from Apple, HBO, LG, Roku, and more tracked live</b><br>Black Friday is just two days away, and nearly every major retailer is offering discounts, like Disney+ and Hulu for only $4.99 a month.<br><a href=\"https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu/",
    "topic": "it",
    "date": "2025-11-26T17:50:00.000Z"
  },
  {
    "title": " Windows 10 retirement pushes 780,000 users to Linux as Zorin OS Hits 1M downloads — but Microsoft still wants to evolve Windows 11 into an agentic AI OS ",
    "q": " windows 10 retirement pushes 780,000 users to linux as zorin os hits 1m downloads — but microsoft still wants to evolve windows 11 into an agentic ai os  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 10 retirement pushes 780,000 users to Linux as Zorin OS Hits 1M downloads — but Microsoft still wants to evolve Windows 11 into an agentic AI OS </b><br>Zorin, a Linux-based operating system designed to rival macOS and Windows, recently surpassed one million downloads following Microsoft's decision to pull the plug on Windows 10 on October 14, 2025.<br><a href=\"https://www.windowscentral.com/microsoft/windows-10/windows-10-retirement-pushes-780-000-users-to-linux-as-zorin-os-hits-1m-downloads\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-10/windows-10-retirement-pushes-780-000-users-to-linux-as-zorin-os-hits-1m-downloads",
    "topic": "it",
    "date": "2025-11-26T14:45:00.000Z"
  },
  {
    "title": " Apple's upcoming iPhone Fold looks to copy Microsoft's Surface Duo — and that's genuinely great news ",
    "q": " apple's upcoming iphone fold looks to copy microsoft's surface duo — and that's genuinely great news  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Apple's upcoming iPhone Fold looks to copy Microsoft's Surface Duo — and that's genuinely great news </b><br>I loved the Surface Duo's short but wide aspect ratio, and it appears Apple is planning to bring that unique shape and size back with its upcoming foldable iPhone.<br><a href=\"https://www.windowscentral.com/hardware/phones/apples-upcoming-iphone-fold-looks-to-copy-microsofts-surface-duo-and-thats-genuinely-great-news\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/phones/apples-upcoming-iphone-fold-looks-to-copy-microsofts-surface-duo-and-thats-genuinely-great-news",
    "topic": "it",
    "date": "2025-11-26T14:16:44.000Z"
  },
  {
    "title": "Multiple London councils' IT systems disrupted by cyberattack",
    "q": "multiple london councils' it systems disrupted by cyberattack windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Multiple London councils' IT systems disrupted by cyberattack</b><br>The Royal Borough of Kensington and Chelsea (RBKC) and the Westminster City Council (WCC) announced that they are experiencing service disruptions following a cybersecurity issue. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/multiple-london-councils-it-systems-disrupted-by-cyberattack/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/multiple-london-councils-it-systems-disrupted-by-cyberattack/",
    "topic": "it",
    "date": "2025-11-26T17:26:11.000Z"
  },
  {
    "title": "Microsoft: Security keys may prompt for PIN after recent updates",
    "q": "microsoft: security keys may prompt for pin after recent updates windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Security keys may prompt for PIN after recent updates</b><br>Microsoft warned users on Tuesday that FIDO2 security keys may prompt them to enter a PIN when signing in after installing Windows updates released since the September 2025 preview update. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-fido2-security-keys-may-prompt-for-pin-after-recent-windows-updates/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fido2-security-keys-may-prompt-for-pin-after-recent-windows-updates/",
    "topic": "it",
    "date": "2025-11-26T14:43:57.000Z"
  },
  {
    "title": "Microsoft to secure Entra ID sign-ins from script injection attacks",
    "q": "microsoft to secure entra id sign-ins from script injection attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft to secure Entra ID sign-ins from script injection attacks</b><br>Starting in mid-to-late October 2026, Microsoft will enhance the security of the Entra ID authentication system against external script injection attacks. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-to-secure-entra-id-sign-ins-from-external-script-injection-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-secure-entra-id-sign-ins-from-external-script-injection-attacks/",
    "topic": "it",
    "date": "2025-11-26T13:26:06.000Z"
  },
  {
    "title": "ASUS warns of new critical auth bypass flaw in AiCloud routers",
    "q": "asus warns of new critical auth bypass flaw in aicloud routers windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>ASUS warns of new critical auth bypass flaw in AiCloud routers</b><br>ASUS has released new firmware to patch nine security vulnerabilities, including a critical authentication bypass flaw in routers with AiCloud enabled. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/asus-warns-of-new-critical-auth-bypass-flaw-in-aicloud-routers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/asus-warns-of-new-critical-auth-bypass-flaw-in-aicloud-routers/",
    "topic": "it",
    "date": "2025-11-26T11:41:00.000Z"
  },
  {
    "title": "The Black Friday 2025 Cybersecurity, IT, VPN, & Antivirus Deals",
    "q": "the black friday 2025 cybersecurity, it, vpn, & antivirus deals windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Black Friday 2025 Cybersecurity, IT, VPN, & Antivirus Deals</b><br>Black Friday 2025 is almost here, and early deals are already live across security software, online courses, system administration tools, antivirus products, and VPN services. These discounts are limited-time offers and vary by provider, s…<br><a href=\"https://www.bleepingcomputer.com/news/security/the-black-friday-2025-cybersecurity-it-vpn-and-antivirus-deals/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/the-black-friday-2025-cybersecurity-it-vpn-and-antivirus-deals/",
    "topic": "it",
    "date": "2025-11-25T19:14:06.000Z"
  },
  {
    "title": "Tor switches to new Counter Galois Onion relay encryption algorithm",
    "q": "tor switches to new counter galois onion relay encryption algorithm windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Tor switches to new Counter Galois Onion relay encryption algorithm</b><br>Tor has announced improved encryption and security for the circuit traffic by replacing the old tor1 relay encryption algorithm with a new design called Counter Galois Onion (CGO). [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/tor-switches-to-new-counter-galois-onion-relay-encryption-algorithm/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/tor-switches-to-new-counter-galois-onion-relay-encryption-algorithm/",
    "topic": "it",
    "date": "2025-11-25T17:09:19.000Z"
  },
  {
    "title": "Microsoft: Exchange Online outage blocks access to Outlook mailboxes",
    "q": "microsoft: exchange online outage blocks access to outlook mailboxes windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Exchange Online outage blocks access to Outlook mailboxes</b><br>Microsoft is investigating an Exchange Online service outage that is preventing customers from accessing their mailboxes using the classic Outlook desktop client. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-online-outage-blocks-access-to-outlook-mailboxes/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-online-outage-blocks-access-to-outlook-mailboxes/",
    "topic": "it",
    "date": "2025-11-25T16:18:12.000Z"
  },
  {
    "title": "Rocky Linux 10.1 release brings soft reboots and new toolchains",
    "q": "rocky linux 10.1 release brings soft reboots and new toolchains windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Rocky Linux 10.1 release brings soft reboots and new toolchains</b><br>These are some updates to make things better.<br><a href=\"https://www.howtogeek.com/rocky-linux-101-release-brings-soft-reboots-and-new-toolchains/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/rocky-linux-101-release-brings-soft-reboots-and-new-toolchains/",
    "topic": "it",
    "date": "2025-11-26T18:06:48.000Z"
  },
  {
    "title": "This keyboard-driven launcher for Linux replaced my taskbar entirely",
    "q": "this keyboard-driven launcher for linux replaced my taskbar entirely windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This keyboard-driven launcher for Linux replaced my taskbar entirely</b><br>There are many ways to speed up your workflow, but a keyboard-based launcher is arguably the best place to start. And Ulauncher is a solid one.<br><a href=\"https://www.xda-developers.com/keyboard-drive-linux-launcher-replaced-taskbar-entirely/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/keyboard-drive-linux-launcher-replaced-taskbar-entirely/",
    "topic": "it",
    "date": "2025-11-26T13:01:17.000Z"
  }
]