[
  {
    "title": "Viltrox NexusFocus Uses Sony PDAF and Motors to Automate Manual Cine Lenses",
    "q": "viltrox nexusfocus uses sony pdaf and motors to automate manual cine lenses camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Viltrox NexusFocus Uses Sony PDAF and Motors to Automate Manual Cine Lenses</b><br>Viltrox has launched NexusFocus F1, the world's first PL-E autofocus control system, enabling AI-powered autofocus when using manual PL cinema lenses on Sony E-mount cameras. With vintage glass all the rage these days, this new adapter cou…<br><a href=\"https://petapixel.com/2026/01/15/viltrox-nexusfocus-uses-sony-pdaf-and-motors-to-automate-manual-cine-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/viltrox-nexusfocus-uses-sony-pdaf-and-motors-to-automate-manual-cine-lenses/",
    "topic": "photo",
    "date": "2026-01-15T22:12:26.000Z"
  },
  {
    "title": "These 99 Award-Winning Portraits Expertly Capture the People of Britain",
    "q": "these 99 award-winning portraits expertly capture the people of britain camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>These 99 Award-Winning Portraits Expertly Capture the People of Britain</b><br>The British Journal of Photography and JCDecaux UK have unveiled the winning photos of the Portrait of Britain Vol. 8 competition. The competition's 100 winning portraits, selected from 200 shortlisted images, will appear on digital screen…<br><a href=\"https://petapixel.com/2026/01/15/these-99-award-winning-portraits-expertly-capture-the-people-of-britain/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/these-99-award-winning-portraits-expertly-capture-the-people-of-britain/",
    "topic": "photo",
    "date": "2026-01-15T21:27:55.000Z"
  },
  {
    "title": "Larry the Cat Trips Up Polish President’s Photographer",
    "q": "larry the cat trips up polish president’s photographer camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Larry the Cat Trips Up Polish President’s Photographer</b><br>Larry the Cat, Chief Mouser to the Cabinet Office at the British Prime Minister's office, tripped up a photographer as he attempted to exit Number 10 Downing Street on Tuesday. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/larry-the-cat-trips-up-polish-presidents-photographer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/larry-the-cat-trips-up-polish-presidents-photographer/",
    "topic": "photo",
    "date": "2026-01-15T18:20:49.000Z"
  },
  {
    "title": "Chris Really Likes the Instax Mini Evo Cinema | The PetaPixel Podcast",
    "q": "chris really likes the instax mini evo cinema | the petapixel podcast camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Chris Really Likes the Instax Mini Evo Cinema | The PetaPixel Podcast</b><br>This week on The PetaPixel Podcast, Chris Niccolls, Jordan Drake, and Jaron Schneider are joined by Sarah Teng to talk about the Instax Mini Evo Cinema. And, in a weird bizzaro world twist, it's Chris who has to convince Sarah that it's gr…<br><a href=\"https://petapixel.com/2026/01/15/chris-really-likes-the-instax-mini-evo-cinema-the-petapixel-podcast/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/chris-really-likes-the-instax-mini-evo-cinema-the-petapixel-podcast/",
    "topic": "photo",
    "date": "2026-01-15T18:01:26.000Z"
  },
  {
    "title": "Await Digital Camera Uses ‘Film Rolls’ and Delivers 4 x 6 Prints",
    "q": "await digital camera uses ‘film rolls’ and delivers 4 x 6 prints camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Await Digital Camera Uses ‘Film Rolls’ and Delivers 4 x 6 Prints</b><br>For a company that’s made its name in high-end cables, chargers, and Bluetooth trackers, Rolling Square isn’t known for making cameras. First teased at IFA 2025 in Berlin, the Swiss brand unveiled its Await Camera at CES 2026 in Las Vegas …<br><a href=\"https://petapixel.com/2026/01/15/await-digital-camera-uses-film-rolls-and-delivers-4-x-6-prints/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/await-digital-camera-uses-film-rolls-and-delivers-4-x-6-prints/",
    "topic": "photo",
    "date": "2026-01-15T17:19:55.000Z"
  },
  {
    "title": "Evoto Alienated Photographers By Releasing a Tool Designed to Replace Them",
    "q": "evoto alienated photographers by releasing a tool designed to replace them camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Evoto Alienated Photographers By Releasing a Tool Designed to Replace Them</b><br>Evoto has had a tough week. While the AI photo editing software company was on hand at Imaging USA … [Read More]<br><a href=\"https://petapixel.com/2026/01/15/evoto-alienated-photographers-by-releasing-a-tool-designed-to-replace-them/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/evoto-alienated-photographers-by-releasing-a-tool-designed-to-replace-them/",
    "topic": "photo",
    "date": "2026-01-15T16:06:19.000Z"
  },
  {
    "title": "Thypoch’s New Ksana 21mm f/3.5 Lens Channels the Spirit of 1970s Cinema",
    "q": "thypoch’s new ksana 21mm f/3.5 lens channels the spirit of 1970s cinema camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Thypoch’s New Ksana 21mm f/3.5 Lens Channels the Spirit of 1970s Cinema</b><br>In trademark Thypoch style, the company's new Ksana 21mm f/3.5 M-Mount lens promises to channel a vintage spirit and deliver photos rich with character and warmth. The new lens promises the classic imaging of beloved 1970s-era lenses. [Rea…<br><a href=\"https://petapixel.com/2026/01/15/thypochs-new-ksana-21mm-f-3-5-lens-channels-the-spirit-of-1970s-cinema/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/thypochs-new-ksana-21mm-f-3-5-lens-channels-the-spirit-of-1970s-cinema/",
    "topic": "photo",
    "date": "2026-01-15T15:19:22.000Z"
  },
  {
    "title": "Sports Photographer Accused of Scamming Clients, Over 130 Complaints Filed",
    "q": "sports photographer accused of scamming clients, over 130 complaints filed camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sports Photographer Accused of Scamming Clients, Over 130 Complaints Filed</b><br>A sports photographer has been accused of scamming people out of their money and photographs across the U.S., prompting a growing law enforcement investigation. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/sports-photographer-accused-of-scamming-clients-over-130-complaints-filed/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/sports-photographer-accused-of-scamming-clients-over-130-complaints-filed/",
    "topic": "photo",
    "date": "2026-01-15T15:03:19.000Z"
  },
  {
    "title": "Photographer Recreates Iconic Shot of E.T. Crossing the Moon",
    "q": "photographer recreates iconic shot of e.t. crossing the moon camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Recreates Iconic Shot of E.T. Crossing the Moon</b><br>A photo of E.T. the Extra-Terrestrial crossing the horizon silhouetted against the Moon was two years in the making, Michael Meighan tells PetaPixel. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/photographer-recreates-iconic-shot-of-e-t-crossing-the-moon/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/photographer-recreates-iconic-shot-of-e-t-crossing-the-moon/",
    "topic": "photo",
    "date": "2026-01-15T12:48:18.000Z"
  },
  {
    "title": "Timed-to-perfection moments from the World Sports Photography Awards",
    "q": "timed-to-perfection moments from the world sports photography awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Timed-to-perfection moments from the World Sports Photography Awards</b><br>2026 World Sports Photography Awards The winners of the 2026 World Sports Photography Awards have been announced, highlighting impeccable timing, dramatic lighting and memorable moments. The contest showcases work from sports photographers…<br><a href=\"https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards",
    "topic": "photo",
    "date": "2026-01-15T18:55:00.000Z"
  },
  {
    "title": "Sony a7 V video studio scene: what do you really need?",
    "q": "sony a7 v video studio scene: what do you really need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony a7 V video studio scene: what do you really need?</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We've taken a look at how the Sony a7 V performs when it comes to stills, now it's time to turn our attention to video. The company's latest…<br><a href=\"https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene",
    "topic": "photo",
    "date": "2026-01-15T14:00:00.000Z"
  },
  {
    "title": "Breaking Leica's monopoly: Ricoh releases GR IV Mono",
    "q": "breaking leica's monopoly: ricoh releases gr iv mono camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Breaking Leica's monopoly: Ricoh releases GR IV Mono</b><br>When you use DPReview links to buy products, the site may earn a commission. Sample gallery This widget is not optimized for RSS feed readers. Please open this article's permalink in a browser to view this content. Product photos: Richard …<br><a href=\"https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch",
    "topic": "photo",
    "date": "2026-01-14T22:00:00.000Z"
  },
  {
    "title": "Question of the week: What projects are you undertaking to move your photography forward?",
    "q": "question of the week: what projects are you undertaking to move your photography forward? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What projects are you undertaking to move your photography forward?</b><br>All photographers inevitably deal with creative droughts or periods when they feel their skills have plateaued. At the end of last year, I wrote about part of why (and how) that's manifested for me over the past few years. For me, one comm…<br><a href=\"https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/",
    "topic": "photo",
    "date": "2026-01-14T15:50:00.000Z"
  },
  {
    "title": "Fujifilm fully raises the curtain on the cinematic Instax",
    "q": "fujifilm fully raises the curtain on the cinematic instax camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm fully raises the curtain on the cinematic Instax</b><br>Image: Fujifilm Last week, Fujifilm Japan launched a surprising and rather controversial new offering in its Instax lineup, the Instax Mini Evo Cinema. The company has now announced the global release of the hybrid camera, providing more d…<br><a href=\"https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": "Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor",
    "q": "eric fossum earns the prestigious draper prize for pioneering the cmos image sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor</b><br>Image: Draper Eric Fossum, the inventor of the modern CMOS image sensor and a longtime friend of DPReview, was recently awarded the 2026 Charles Stark Draper Prize for Engineering. The award, which is granted every two years by the Nationa…<br><a href=\"https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor",
    "topic": "photo",
    "date": "2026-01-13T20:10:00.000Z"
  },
  {
    "title": "Apple’s new Creative Cloud competitor lets you edit photos, music and video",
    "q": "apple’s new creative cloud competitor lets you edit photos, music and video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple’s new Creative Cloud competitor lets you edit photos, music and video</b><br>Image: Apple Apple has announced a new app bundle for creatives dubbed Apple Creator Studio. The subscription serves as somewhat of an alternative to Adobe's Creative Cloud, as it includes apps for photo, video and music editing, plus Appl…<br><a href=\"https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video",
    "topic": "photo",
    "date": "2026-01-13T18:31:00.000Z"
  },
  {
    "title": "Will SD cards remain forever stuck in the past?",
    "q": "will sd cards remain forever stuck in the past? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Will SD cards remain forever stuck in the past?</b><br>With no sign of faster SD cards, the CFexpress format is currently coming out on top. Photo: Richard Butler This year's CES trade show came and went with no apparent progress for the SD memory card format, despite higher speeds and capacit…<br><a href=\"https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past",
    "topic": "photo",
    "date": "2026-01-13T15:00:00.000Z"
  },
  {
    "title": "Portrait of Britain: Celebrating the faces that define a nation",
    "q": "portrait of britain: celebrating the faces that define a nation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Portrait of Britain: Celebrating the faces that define a nation</b><br>Portrait of Britain Vol. 8 Winners The British Journal of Photography has announced the winners of Portrait of Britain Vol. 8. The contest, which began in 2016, aims to celebrate the diverse mosaic of individuals who make up Great Britain …<br><a href=\"https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation",
    "topic": "photo",
    "date": "2026-01-12T21:48:00.000Z"
  },
  {
    "title": "DPReview Reader's Choice Awards 2025: Product of the Year",
    "q": "dpreview reader's choice awards 2025: product of the year camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Reader's Choice Awards 2025: Product of the Year</b><br>When you use DPReview links to buy products, the site may earn a commission. Product of the Year 2025: the results The final round of voting has closed, and it's time to reveal the winners of our 2025 Readers' Choice Awards! Beginning in D…<br><a href=\"https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": " This cheap compact camera beat pro mirrorless. The most popular cameras of 2025 at this US retailer are a strange mix of cheap compacts and high-end mirrorless ",
    "q": " this cheap compact camera beat pro mirrorless. the most popular cameras of 2025 at this us retailer are a strange mix of cheap compacts and high-end mirrorless  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This cheap compact camera beat pro mirrorless. The most popular cameras of 2025 at this US retailer are a strange mix of cheap compacts and high-end mirrorless </b><br>According to US retailer B&H, these are the most popular cameras of 2025, a list that ranges from $30 compact cameras to high-end mirrorless<br><a href=\"https://www.digitalcameraworld.com/cameras/this-cheap-compact-camera-beat-pro-mirrorless-the-most-popular-cameras-of-2025-at-this-us-retailer-are-a-strange-mix-of-cheap-compacts-and-high-end-mirrorless\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/this-cheap-compact-camera-beat-pro-mirrorless-the-most-popular-cameras-of-2025-at-this-us-retailer-are-a-strange-mix-of-cheap-compacts-and-high-end-mirrorless",
    "topic": "photo",
    "date": "2026-01-16T12:18:39.000Z"
  },
  {
    "title": " Is this the end of the bulky vlogging camera? Insta360 is betting yes with two new Link webcams... ",
    "q": " is this the end of the bulky vlogging camera? insta360 is betting yes with two new link webcams...  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Is this the end of the bulky vlogging camera? Insta360 is betting yes with two new Link webcams... </b><br>Insta360 reckons customers will pay more for their feature-packed webcams instead of 'real' cameras. Would you?<br><a href=\"https://www.digitalcameraworld.com/tech/webcams/is-this-the-end-of-the-bulky-vlogging-camera-insta360-is-betting-yes-with-two-new-link-webcams\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/webcams/is-this-the-end-of-the-bulky-vlogging-camera-insta360-is-betting-yes-with-two-new-link-webcams",
    "topic": "photo",
    "date": "2026-01-16T11:57:22.000Z"
  },
  {
    "title": " \"No, The Queen didn't walk out\": Annie Leibovitz reveals the truth behind her infamous royal photo shoot ",
    "q": " \"no, the queen didn't walk out\": annie leibovitz reveals the truth behind her infamous royal photo shoot  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> \"No, The Queen didn't walk out\": Annie Leibovitz reveals the truth behind her infamous royal photo shoot </b><br>The portrait photographer recalls what really happened during her historic session at Buckingham Palace in 2007.<br><a href=\"https://www.digitalcameraworld.com/photography/portrait-photography/no-the-queen-didnt-walk-out-annie-leibovitz-reveals-the-truth-behind-her-infamous-royal-photo-shoot\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/portrait-photography/no-the-queen-didnt-walk-out-annie-leibovitz-reveals-the-truth-behind-her-infamous-royal-photo-shoot",
    "topic": "photo",
    "date": "2026-01-16T09:00:00.000Z"
  },
  {
    "title": " Chuzhao Digital Camera review: a tiny toy camera that models itself seductively on a 1960s TLR ",
    "q": " chuzhao digital camera review: a tiny toy camera that models itself seductively on a 1960s tlr  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Chuzhao Digital Camera review: a tiny toy camera that models itself seductively on a 1960s TLR </b><br>The Chuzhao is a miniature digital camera with a difference, thanks to its twin lens reflex design and handling<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/chuzhao-digital-camera-review-a-tiny-toy-camera-that-models-itself-seductively-on-a-1960s-tlr\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/chuzhao-digital-camera-review-a-tiny-toy-camera-that-models-itself-seductively-on-a-1960s-tlr",
    "topic": "photo",
    "date": "2026-01-16T08:01:39.000Z"
  },
  {
    "title": " Is Fujifilm about to update its beloved tiny pancake lens? Patent hints that Fujifilm is working on a smaller 18mm f/2 – but I hope this one feature becomes reality ",
    "q": " is fujifilm about to update its beloved tiny pancake lens? patent hints that fujifilm is working on a smaller 18mm f/2 – but i hope this one feature becomes reality  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Is Fujifilm about to update its beloved tiny pancake lens? Patent hints that Fujifilm is working on a smaller 18mm f/2 – but I hope this one feature becomes reality </b><br>A patent in Japan hints that Fujifilm could be working on an updated 18mm f/2 pancake lens<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/is-fujifilm-about-to-update-its-beloved-tiny-pancake-lens-patent-hints-that-fujifilm-is-working-on-a-smaller-18mm-f-2-but-i-hope-this-one-feature-becomes-reality\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/is-fujifilm-about-to-update-its-beloved-tiny-pancake-lens-patent-hints-that-fujifilm-is-working-on-a-smaller-18mm-f-2-but-i-hope-this-one-feature-becomes-reality",
    "topic": "photo",
    "date": "2026-01-16T07:30:00.000Z"
  },
  {
    "title": " Winner of world’s biggest sports photography competition crowned for mind-blowing timing and composition ",
    "q": " winner of world’s biggest sports photography competition crowned for mind-blowing timing and composition  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Winner of world’s biggest sports photography competition crowned for mind-blowing timing and composition </b><br>This alignment existed for less than a heartbeat – and is now globally recognized, beating 23,130 submissions from the world’s best professional sport photographers<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/winner-of-worlds-biggest-sports-photography-competition-crowned-for-mind-blowing-timing-and-composition\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/winner-of-worlds-biggest-sports-photography-competition-crowned-for-mind-blowing-timing-and-composition",
    "topic": "photo",
    "date": "2026-01-15T22:00:00.000Z"
  },
  {
    "title": " The inventor of the CMOS camera sensor just won the \"Nobel Prize of Engineering\" ",
    "q": " the inventor of the cmos camera sensor just won the \"nobel prize of engineering\"  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The inventor of the CMOS camera sensor just won the \"Nobel Prize of Engineering\" </b><br>The godfather of the active-pixel CMOS sensor, Eric R Fossum, PhD, has been awarded the 2026 Charles Stark Draper Prize for Engineering<br><a href=\"https://www.digitalcameraworld.com/cameras/digital-cameras/the-inventor-of-the-cmos-camera-sensor-just-won-the-nobel-prize-of-engineering\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/digital-cameras/the-inventor-of-the-cmos-camera-sensor-just-won-the-nobel-prize-of-engineering",
    "topic": "photo",
    "date": "2026-01-15T18:41:51.000Z"
  },
  {
    "title": " Fujifilm’s new Instax Mini Evo Cinema takes inspiration from classic 1960s Fuji Single-8 cine cameras that were actually superior to Kodak Super 8 ",
    "q": " fujifilm’s new instax mini evo cinema takes inspiration from classic 1960s fuji single-8 cine cameras that were actually superior to kodak super 8  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Fujifilm’s new Instax Mini Evo Cinema takes inspiration from classic 1960s Fuji Single-8 cine cameras that were actually superior to Kodak Super 8 </b><br>The story behind the vintage tech that inspired Fujifilm's weird new Instax Mini Evo Cinema camera<br><a href=\"https://www.digitalcameraworld.com/cameras/film-cameras/fujifilms-new-instax-mini-evo-cinema-takes-inspiration-from-classic-1960s-fuji-single-8-cine-cameras-that-were-actually-superior-to-kodak-super-8\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/film-cameras/fujifilms-new-instax-mini-evo-cinema-takes-inspiration-from-classic-1960s-fuji-single-8-cine-cameras-that-were-actually-superior-to-kodak-super-8",
    "topic": "photo",
    "date": "2026-01-15T16:59:31.000Z"
  },
  {
    "title": " The Galaxy S26 Ultra may get subtle hardware upgrades for its main and telephoto cameras ",
    "q": " the galaxy s26 ultra may get subtle hardware upgrades for its main and telephoto cameras  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Galaxy S26 Ultra may get subtle hardware upgrades for its main and telephoto cameras </b><br>Samsung's next flagship phone is expected to inherit most of its camera hardware from the S25 Ultra, but image quality might still be boosted<br><a href=\"https://www.digitalcameraworld.com/tech/phones/the-galaxy-s26-ultra-may-get-subtle-hardware-upgrades-for-its-main-and-telephoto-cameras\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/phones/the-galaxy-s26-ultra-may-get-subtle-hardware-upgrades-for-its-main-and-telephoto-cameras",
    "topic": "photo",
    "date": "2026-01-15T15:04:07.000Z"
  },
  {
    "title": "3 Ways To Photograph Family Group Photos With Flash",
    "q": "3 ways to photograph family group photos with flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>3 Ways To Photograph Family Group Photos With Flash</b><br>Setting up one directional off-camera flash with a shoot-through umbrella may be your go-to lighting setup for family formals, but what other ways can you light a group of people to create more drama or visual interest? Light alters the mo…<br><a href=\"https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/",
    "topic": "photo",
    "date": "2026-01-14T19:59:28.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Photographer Insurance Guide",
    "q": "photographer insurance guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Insurance Guide</b><br>Let’s face it, photography is not a cheap venture to get into. Regardless of whether you’re a professional or a hobbyist, buying and keeping your gear up-to-date can be very expensive. Because of this, it’s incredibly important to keep you…<br><a href=\"https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/",
    "topic": "photo",
    "date": "2026-01-09T06:37:32.000Z"
  },
  {
    "title": "15 Tips for Teaching Photography Workshops",
    "q": "15 tips for teaching photography workshops camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>15 Tips for Teaching Photography Workshops</b><br>Hosting a photography workshop may not be the easiest way to earn additional income, but it can prove rewarding when done right. Should you choose to teach one, follow these 15 tips to help ensure that your workshop is a success!<br><a href=\"https://www.slrlounge.com/tips-for-a-photography-workshop/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tips-for-a-photography-workshop/",
    "topic": "photo",
    "date": "2026-01-08T06:35:30.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "The best Sonos speakers to buy in 2026",
    "q": "the best sonos speakers to buy in 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Sonos speakers to buy in 2026</b><br>After the self-induced tumult Sonos went through last year, I can understand why some people are reluctant to spend money on the company’s products. But newly appointed CEO Tom Conrad has shown that he’s determined to get back on track and…<br><a href=\"https://www.theverge.com/tech/652171/best-sonos-speakers\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/652171/best-sonos-speakers",
    "topic": "it",
    "date": "2026-01-16T01:33:35.000Z"
  },
  {
    "title": "Here are the best Apple Watch deals available right now",
    "q": "here are the best apple watch deals available right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here are the best Apple Watch deals available right now</b><br>The last-gen Apple Watch Ultra 2 is on sale starting at $549, matching its lowest price to date. | Photo: Amelia Holowaty Krales / The Verge In September, Apple launched its latest fleet of smartwatches, including the Apple Watch Series 11…<br><a href=\"https://www.theverge.com/21289209/best-apple-watch-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21289209/best-apple-watch-deals",
    "topic": "it",
    "date": "2026-01-16T00:17:02.000Z"
  },
  {
    "title": "Natural Cycles launches wristband to replace thermometers for its FDA-cleared birth control app",
    "q": "natural cycles launches wristband to replace thermometers for its fda-cleared birth control app windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Natural Cycles launches wristband to replace thermometers for its FDA-cleared birth control app</b><br>Natural Cycles, the company behind a controversial FDA-cleared birth control app, is replacing its thermometer with a wristband that measures skin temperature, heart rate, and movement during sleep. The newly launched wristband costs $129.…<br><a href=\"https://www.theverge.com/news/863046/natural-cycles-wristband-digital-birth-control\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/863046/natural-cycles-wristband-digital-birth-control",
    "topic": "it",
    "date": "2026-01-15T22:46:27.000Z"
  },
  {
    "title": "You can save over $1,500 on LG’s 65-inch C5 OLED TV",
    "q": "you can save over $1,500 on lg’s 65-inch c5 oled tv windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>You can save over $1,500 on LG’s 65-inch C5 OLED TV</b><br>The 65-inch LG C5 OLED TV is rarely this affordable. LG might have just revealed its new C6 OLED TVs at CES 2026, but we still don’t know when they’ll actually hit stores. If you don’t want to wait — or spend a couple thousand dollars on a…<br><a href=\"https://www.theverge.com/gadgets/862989/lg-c5-oled-tv-ebay-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/862989/lg-c5-oled-tv-ebay-deal-sale",
    "topic": "it",
    "date": "2026-01-15T22:23:59.000Z"
  },
  {
    "title": " Hackers exploit WordPress plugin security flaw exposing 40,000 websites to complete takeover risk - here's how to stay safe ",
    "q": " hackers exploit wordpress plugin security flaw exposing 40,000 websites to complete takeover risk - here's how to stay safe  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Hackers exploit WordPress plugin security flaw exposing 40,000 websites to complete takeover risk - here's how to stay safe </b><br>Critical WordPress plugin flaw exposed some 40,000 users to risk of a complete website takeover.<br><a href=\"https://www.techradar.com/pro/security/hackers-exploit-wordpress-plugin-security-flaw-exposing-40-000-websites-to-complete-takeover-risk-heres-how-to-stay-safe\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/hackers-exploit-wordpress-plugin-security-flaw-exposing-40-000-websites-to-complete-takeover-risk-heres-how-to-stay-safe",
    "topic": "it",
    "date": "2026-01-16T11:24:19.000Z"
  },
  {
    "title": " I've spent all week shopping Best Buy's winter sale - here are 19 deals worth buying, including 50% off TVs, laptops, Apple, and more ",
    "q": " i've spent all week shopping best buy's winter sale - here are 19 deals worth buying, including 50% off tvs, laptops, apple, and more  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> I've spent all week shopping Best Buy's winter sale - here are 19 deals worth buying, including 50% off TVs, laptops, Apple, and more </b><br>Best Buy's winter sale is ending soon, and as TechRadar's deals editor who's been shopping for offers all week, I've hand-picked the 19 best deals worth buying.<br><a href=\"https://www.techradar.com/seasonal-sales/ive-spent-all-week-shopping-best-buys-winter-sale-here-are-19-deals-worth-buying-including-50-percent-off-tvs-laptops-apple-and-more\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/seasonal-sales/ive-spent-all-week-shopping-best-buys-winter-sale-here-are-19-deals-worth-buying-including-50-percent-off-tvs-laptops-apple-and-more",
    "topic": "it",
    "date": "2026-01-16T11:01:13.000Z"
  },
  {
    "title": "Best Apple Watch for 2026",
    "q": "best apple watch for 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Best Apple Watch for 2026</b><br>I tested every smartwatch that Apple sells, and here are the best ones to buy based on health features, battery life and your budget.<br><a href=\"https://www.cnet.com/tech/mobile/best-apple-watch/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/mobile/best-apple-watch/",
    "topic": "it",
    "date": "2026-01-16T11:30:00.000Z"
  },
  {
    "title": "I Replaced Microsoft 365 With This Free Alternative",
    "q": "i replaced microsoft 365 with this free alternative windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I Replaced Microsoft 365 With This Free Alternative</b><br>LibreOffice is saving me money on an offline word processor, and it doesn't have Microsoft Copilot either.<br><a href=\"https://www.cnet.com/tech/services-and-software/i-replaced-microsoft-365-with-this-free-alternative/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/i-replaced-microsoft-365-with-this-free-alternative/",
    "topic": "it",
    "date": "2026-01-16T11:01:19.000Z"
  },
  {
    "title": " Glass cloth could be the next great AI shortage, as major manufacturers scramble to secure critical material — Japanese manufacturer courted by Apple, Nvidia, Google, and Amazon ",
    "q": " glass cloth could be the next great ai shortage, as major manufacturers scramble to secure critical material — japanese manufacturer courted by apple, nvidia, google, and amazon  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Glass cloth could be the next great AI shortage, as major manufacturers scramble to secure critical material — Japanese manufacturer courted by Apple, Nvidia, Google, and Amazon </b><br>One Japanese manufacturer has found itself at the center of a new AI-driven supply shortage. Glass cloth is a crucial component for many components, and with dwindling supplies, companies are looking for alternatives.<br><a href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/glass-cloth-could-be-the-next-great-ai-shortage-as-major-manufacturers-scramble-to-secure-critical-material-japanese-manufacturer-courted-by-apple-nvidia-google-and-amazon\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/glass-cloth-could-be-the-next-great-ai-shortage-as-major-manufacturers-scramble-to-secure-critical-material-japanese-manufacturer-courted-by-apple-nvidia-google-and-amazon",
    "topic": "it",
    "date": "2026-01-16T10:55:12.000Z"
  },
  {
    "title": "Own a PS5? I changed these 3 settings to give the system a big performance boost",
    "q": "own a ps5? i changed these 3 settings to give the system a big performance boost windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Own a PS5? I changed these 3 settings to give the system a big performance boost</b><br>With a few quick adjustments, you can easily enhance your experience across gaming, streaming, and even online security.<br><a href=\"https://www.zdnet.com/article/best-ps5-settings-improve-performance/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/best-ps5-settings-improve-performance/",
    "topic": "it",
    "date": "2026-01-16T12:03:00.000Z"
  },
  {
    "title": "Still on Windows 10? I installed 0patch on my old PC, and it's easily the best defense in the 'End of Support' era",
    "q": "still on windows 10? i installed 0patch on my old pc, and it's easily the best defense in the 'end of support' era windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Still on Windows 10? I installed 0patch on my old PC, and it's easily the best defense in the 'End of Support' era</b><br>0patch provides crucial security updates to Windows 10 and fills the support gap left behind by Microsoft.<br><a href=\"https://www.zdnet.com/article/windows-10-pc-0patch-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/windows-10-pc-0patch-review/",
    "topic": "it",
    "date": "2026-01-16T12:02:00.000Z"
  },
  {
    "title": " Microsoft stock continues downward trend, dropping 10% — ballooning infrastructure CAPEX, shrinking AI hype, and Google blamed ",
    "q": " microsoft stock continues downward trend, dropping 10% — ballooning infrastructure capex, shrinking ai hype, and google blamed  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft stock continues downward trend, dropping 10% — ballooning infrastructure CAPEX, shrinking AI hype, and Google blamed </b><br>Microsoft execs have offloaded millions of dollars worth of stock over the past quarter, as the firm's outlook (no pun intended) looks murky.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-shares-dip-10-percent-over-the-last-three-months-ballooning-infrastructure-capex-shrinking-ai-hype-and-googles-resurgence-blamed\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-shares-dip-10-percent-over-the-last-three-months-ballooning-infrastructure-capex-shrinking-ai-hype-and-googles-resurgence-blamed",
    "topic": "it",
    "date": "2026-01-16T12:23:13.000Z"
  },
  {
    "title": " Windows 11 users are still turning to third-party tools to bypass Microsoft's push for all-encompassing AI — and \"Winslop\" is the most categorical example to date ",
    "q": " windows 11 users are still turning to third-party tools to bypass microsoft's push for all-encompassing ai — and \"winslop\" is the most categorical example to date  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 users are still turning to third-party tools to bypass Microsoft's push for all-encompassing AI — and \"Winslop\" is the most categorical example to date </b><br>Winslop is a lightweight app that helps you remove the AI features Microsoft has been heavily integrating into Windows 11.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/winslop-users-still-turning-to-third-party-tools-to-bypass-ai\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/winslop-users-still-turning-to-third-party-tools-to-bypass-ai",
    "topic": "it",
    "date": "2026-01-16T12:00:00.000Z"
  },
  {
    "title": " Reddit users: r/WindowsCentral is live — join us to shape coverage, boost visibility, and help build the strongest Microsoft community online ",
    "q": " reddit users: r/windowscentral is live — join us to shape coverage, boost visibility, and help build the strongest microsoft community online  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Reddit users: r/WindowsCentral is live — join us to shape coverage, boost visibility, and help build the strongest Microsoft community online </b><br>Your upvotes, comments, and presence help more people discover our reporting — and help shape what we cover next.<br><a href=\"https://www.windowscentral.com/microsoft/windows/reddit-users-r-windowscentral-is-live-join-us-to-shape-coverage-boost-visibility-and-help-build-the-strongest-microsoft-community-online\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows/reddit-users-r-windowscentral-is-live-join-us-to-shape-coverage-boost-visibility-and-help-build-the-strongest-microsoft-community-online",
    "topic": "it",
    "date": "2026-01-15T22:14:44.000Z"
  },
  {
    "title": "Microsoft: Windows 11 update causes Outlook freezes for POP users",
    "q": "microsoft: windows 11 update causes outlook freezes for pop users windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows 11 update causes Outlook freezes for POP users</b><br>Microsoft confirmed that the KB5074109 January Windows 11 security update causes the classic Outlook desktop client to freeze and hang for users with POP email accounts. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-update-causes-outlook-freezes-for-pop-users/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-update-causes-outlook-freezes-for-pop-users/",
    "topic": "it",
    "date": "2026-01-16T12:12:41.000Z"
  },
  {
    "title": "Microsoft: Some Windows PCs fail to shut down after January update",
    "q": "microsoft: some windows pcs fail to shut down after january update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Some Windows PCs fail to shut down after January update</b><br>Microsoft has confirmed a new issue that prevents Windows 11 23H2 devices with System Guard Secure Launch enabled from shutting down. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/microsoft-some-windows-pcs-fail-to-shut-down-after-january-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-some-windows-pcs-fail-to-shut-down-after-january-update/",
    "topic": "it",
    "date": "2026-01-16T08:35:38.000Z"
  },
  {
    "title": "Grubhub confirms hackers stole data in recent security breach",
    "q": "grubhub confirms hackers stole data in recent security breach windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Grubhub confirms hackers stole data in recent security breach</b><br>Food delivery platform Grubhub has confirmed a recent data breach after hackers accessed its systems, with sources telling BleepingComputer the company is now facing extortion demands. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/grubhub-confirms-hackers-stole-data-in-recent-security-breach/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/grubhub-confirms-hackers-stole-data-in-recent-security-breach/",
    "topic": "it",
    "date": "2026-01-15T21:38:51.000Z"
  },
  {
    "title": "Microsoft Excel has new functions for importing text files and CSV data",
    "q": "microsoft excel has new functions for importing text files and csv data windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft Excel has new functions for importing text files and CSV data</b><br>No more Power Query needed.<br><a href=\"https://www.howtogeek.com/microsoft-excel-has-new-functions-for-importing-text-and-csv-files/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-has-new-functions-for-importing-text-and-csv-files/",
    "topic": "it",
    "date": "2026-01-15T19:37:55.000Z"
  },
  {
    "title": "Windows 11 is still missing a key feature for OLED monitor users",
    "q": "windows 11 is still missing a key feature for oled monitor users windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 is still missing a key feature for OLED monitor users</b><br>OLED monitors provide stunning visuals, but they could have even more benefits if Microsoft added this one feature to Windows 11.<br><a href=\"https://www.xda-developers.com/windows-11-still-missing-key-feature-oled-monitor-users/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-11-still-missing-key-feature-oled-monitor-users/",
    "topic": "it",
    "date": "2026-01-16T01:00:20.000Z"
  }
]