[
  {
    "title": "How a Mobile Photography Darkroom Empowers Vulnerable Children",
    "q": "How a Mobile Photography Darkroom Empowers Vulnerable Children PetaPixel",
    "a": "<b>How a Mobile Photography Darkroom Empowers Vulnerable Children</b><br>The Sirkhane Darkroom a mobile photography darkroom, brings education, passion, and most importantly, hope, to overlooked communities in Turkey where children face limited access to education and safety, especially in t…<br><a href=\"https://petapixel.com/2025/10/05/how-a-mobile-photography-darkroom-empowers-vulnerable-children/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Save Up to 30% on SmallRig Gear This Week on Amazon",
    "q": "Save Up to 30% on SmallRig Gear This Week on Amazon PetaPixel",
    "a": "<b>Save Up to 30% on SmallRig Gear This Week on Amazon</b><br>To celebrate the arrival of autumn, SmallRig is offering up to 30% off over 400 products on Amazon from October 7 to 8. [Read More]<br><a href=\"https://petapixel.com/2025/10/05/save-up-to-30-on-smallrig-gear-this-week-on-amazon/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Use Light More Creatively: Exposure Is More Than Just Correcting for Light",
    "q": "Use Light More Creatively: Exposure Is More Than Just Correcting for Light PetaPixel",
    "a": "<b>Use Light More Creatively: Exposure Is More Than Just Correcting for Light</b><br>There’s much more to exposure than just correcting for light. It’s one of the most powerful tools you can use creatively. [Read More]<br><a href=\"https://petapixel.com/2025/10/04/use-light-more-creatively-exposure-is-more-than-just-correcting-for-light/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Camera Makers Need to Lean Into Their Brand Colors Again",
    "q": "Camera Makers Need to Lean Into Their Brand Colors Again PetaPixel",
    "a": "<b>Camera Makers Need to Lean Into Their Brand Colors Again</b><br>When Nikon added the gold ring to the lens mount of its 28-135mm f/4 PZ earlier this year, I was ecstatic. Finally, Nikon was leaning into its brand color. I was saddened to learn it would only do this on select product…<br><a href=\"https://petapixel.com/2025/10/03/camera-makers-need-to-lean-into-their-brand-colors-again/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "20 Award-Winning Photos From 1839 Awards’ Photographer of the Year",
    "q": "20 Award-Winning Photos From 1839 Awards’ Photographer of the Year PetaPixel",
    "a": "<b>20 Award-Winning Photos From 1839 Awards’ Photographer of the Year</b><br>1839 Awards announced the winners of its International Photographer of the Year Contest. The winning photographers in the Professional and Non-Professional categories demonstrate excellent artistic and technical achieve…<br><a href=\"https://petapixel.com/2025/10/03/20-award-winning-photos-from-1839-awards-photographer-of-the-year/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge",
    "q": "Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge</b><br>Fall colors are on full display in Canada's Northwest Territories. I captured this photo along the Ingraham Trail several km outside Yellowknife, NTW. Although the primary purpose of my trip was to photograph the aurora…<br><a href=\"https://www.dpreview.com/articles/9275549403/october-2025-editors-photo-challenge-announced\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography",
    "q": "Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography</b><br>Go Tokura, Executive Vice President, Head of Imaging Group, Chief Executive of Imaging Business Operations Photo: Richard Butler Full disclosure: I've just returned from a trip to Japan paid for by Canon. Our usual poli…<br><a href=\"https://www.dpreview.com/articles/5354325480/a-visit-to-canon-in-japan-and-why-it-wants-to-be-the-porsche-911-of-photography\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Pastel landscapes and monochrome portraits shine at the Film Photography Awards",
    "q": "Pastel landscapes and monochrome portraits shine at the Film Photography Awards Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Pastel landscapes and monochrome portraits shine at the Film Photography Awards</b><br>2025 Analog Sparks International Film Photography Awards This Film Friday, we are highlighting the Analog Sparks 2025 International Film Photography Awards, showcasing diverse analog work from around the globe. This mar…<br><a href=\"https://www.dpreview.com/articles/4903665536/pastel-landscapes-and-monochrome-portraits-shine-at-the-film-photography-awards\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "What is a histogram, and how do you use it?",
    "q": "What is a histogram, and how do you use it? Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>What is a histogram, and how do you use it?</b><br>Photo: Mitchell Clark No matter what type(s) of photography you like to pursue, mastering exposure is key to creating successful images. While it can be tempting to use your camera's screen to judge exposure, that displ…<br><a href=\"https://www.dpreview.com/learn/6774050105/what-is-a-histogram-and-how-do-you-use-it\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Sony 100mm F2.8 Macro GM sample gallery: now with teleconverter shots",
    "q": "Sony 100mm F2.8 Macro GM sample gallery: now with teleconverter shots Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Sony 100mm F2.8 Macro GM sample gallery: now with teleconverter shots</b><br>When you use DPReview links to buy products, the site may earn a commission. Sony a7R V | Sony FE 100mm F2.8 Macro GM | F4| 1/100 sec | ISO 1600 Processed with Capture One Earlier this week, Sony announced the FE 100mm …<br><a href=\"https://www.dpreview.com/samples/7351256194/sony-100mm-f2p8-macro-gm-sample-gallery\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Huge numbers of managers admit to using AI to convincingly draft or revise performance reviews - and I fear it will only accelerate the death of traditional HR ",
    "q": " Huge numbers of managers admit to using AI to convincingly draft or revise performance reviews - and I fear it will only accelerate the death of traditional HR   Latest from TechRadar ",
    "a": "<b> Huge numbers of managers admit to using AI to convincingly draft or revise performance reviews - and I fear it will only accelerate the death of traditional HR </b><br>Managers and workers increasingly depend on AI writers for sensitive communication, raising concerns about empathy, trust, and HR’s long-term role.<br><a href=\"https://www.techradar.com/ai-platforms-assistants/huge-numbers-of-managers-admit-to-using-ai-to-convincingly-draft-or-revise-performance-reviews-and-i-fear-it-will-only-accelerate-the-death-of-traditional-hr\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Nobel Laureate backs Cambridge-based crowdfunding effort to digitize 100,000 hours of recordings from some of the brightest minds in human history ",
    "q": " Nobel Laureate backs Cambridge-based crowdfunding effort to digitize 100,000 hours of recordings from some of the brightest minds in human history   Latest from TechRadar ",
    "a": "<b> Nobel Laureate backs Cambridge-based crowdfunding effort to digitize 100,000 hours of recordings from some of the brightest minds in human history </b><br>A Cambridge-led project seeks funds to digitize and restore 100,000 hours of historic scientific recordings featuring leading global thinkers.<br><a href=\"https://www.techradar.com/pro/security/nobel-laureate-backs-cambridge-based-crowdfunding-effort-to-digitize-100-000-hours-of-recordings-from-some-of-the-brightest-minds-humanity-has-ever-conceived\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Microsoft's new Photos app update is so good that it could well become my favorite photo organizing tool - but you will need a Copilot+ PC to experience it ",
    "q": " Microsoft's new Photos app update is so good that it could well become my favorite photo organizing tool - but you will need a Copilot+ PC to experience it   Latest from TechRadar ",
    "a": "<b> Microsoft's new Photos app update is so good that it could well become my favorite photo organizing tool - but you will need a Copilot+ PC to experience it </b><br>Microsoft’s Photos app adds AI-powered sorting and super resolution features, but they only work on Copilot+ PCs with NPU hardware.<br><a href=\"https://www.techradar.com/pro/microsofts-new-photos-app-update-is-so-good-that-it-could-well-become-my-favorite-photo-organizing-tool-but-you-will-need-a-copilot-pc-to-experience-it\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Drop what you're doing – LG's C5 OLED TV crashes to its lowest price ever ahead of Prime Day ",
    "q": " Drop what you're doing – LG's C5 OLED TV crashes to its lowest price ever ahead of Prime Day   Latest from TechRadar ",
    "a": "<b> Drop what you're doing – LG's C5 OLED TV crashes to its lowest price ever ahead of Prime Day </b><br>Thanks to early Prime Day deals, you can get LG's 65-inch C5 OLED TV on sale for its lowest price yet, thanks to a massive $1,250 discount.<br><a href=\"https://www.techradar.com/seasonal-sales/drop-what-youre-doing-lgs-c5-oled-tv-crashes-to-its-lowest-price-ever-ahead-of-prime-day\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " I've covered Prime Day for 8 years - here are 25 Amazon device deals that are actually worth buying ",
    "q": " I've covered Prime Day for 8 years - here are 25 Amazon device deals that are actually worth buying   Latest from TechRadar ",
    "a": "<b> I've covered Prime Day for 8 years - here are 25 Amazon device deals that are actually worth buying </b><br>The best discounts at Amazon's October Prime Day sale are on its best-selling devices, and as a shopping expert, I've rounded up 25 deals that are actually worth buying.<br><a href=\"https://www.techradar.com/seasonal-sales/ive-covered-prime-day-for-8-years-here-are-25-amazon-device-deals-that-are-actually-worth-buying\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Jane Goodall’s death triggered the premiere of Netflix’s new show",
    "q": "Jane Goodall’s death triggered the premiere of Netflix’s new show The Verge",
    "a": "<b>Jane Goodall’s death triggered the premiere of Netflix’s new show</b><br>For the last several years Netflix has been quietly banking episodes of a new show called Famous Last Words, interviews with famous people entering their twilight years. The catch is that episodes will only air after th…<br><a href=\"https://www.theverge.com/news/792477/jane-goodall-netflix-famous-last-words\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "If you can get past the terrible logo, Audacity 4 looks pretty great",
    "q": "If you can get past the terrible logo, Audacity 4 looks pretty great The Verge",
    "a": "<b>If you can get past the terrible logo, Audacity 4 looks pretty great</b><br>The new Audacity logo Rebrands rarely get much love. That backlash can be especially strong if you’re giving a facelift to a decades-old piece of software beloved by nerds around the globe. So, it was no surprise that w…<br><a href=\"https://www.theverge.com/news/792368/if-you-can-get-past-the-terrible-logo-audacity-4-looks-pretty-great\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Roland is finally honoring its legacy instead of just cashing in on it",
    "q": "Roland is finally honoring its legacy instead of just cashing in on it The Verge",
    "a": "<b>Roland is finally honoring its legacy instead of just cashing in on it</b><br>The Roland TR-1000 rhythm generator. If the only thing Roland ever released was the TR-808, the company would still deserve a place in the music gear hall of fame. The 808 is arguably the most important instrument since…<br><a href=\"https://www.theverge.com/entertainment/792209/roland-is-finally-honoring-its-legacy-instead-of-just-cashing-in-tr-1000\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "I’ve tested the latest Switch 2 controllers, and this one is the best",
    "q": "I’ve tested the latest Switch 2 controllers, and this one is the best The Verge",
    "a": "<b>I’ve tested the latest Switch 2 controllers, and this one is the best</b><br>Editor’s note: Amazon’s fall Prime Day event kicks off on October 7th; however, if you want to shop ahead of the two-day sale, we’ve rounded up the best early Prime Day deals you can already get. If you choose to get an…<br><a href=\"https://www.theverge.com/tech/791574/best-switch-2-controllers\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "The developers behind a hit sausage-dueling game hope Steam launch will take it furter",
    "q": "The developers behind a hit sausage-dueling game hope Steam launch will take it furter The Verge",
    "a": "<b>The developers behind a hit sausage-dueling game hope Steam launch will take it furter</b><br>Life is a series of battles, and I just lost my last one against four gyoza on a skewer. It was an unexpected blow, because honestly, who could have expected me - a springy, respectably proportioned hot dog - to lose ag…<br><a href=\"https://www.theverge.com/entertainment/791353/sausage-legend-steam-launch-interview\" target=\"_blank\">Read more</a>"
  }
]