[
  {
    "title": "3D-Printed Kit Gives the DJI Osmo Nano Vintage Hasselblad Style",
    "q": "3d-printed kit gives the dji osmo nano vintage hasselblad style camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>3D-Printed Kit Gives the DJI Osmo Nano Vintage Hasselblad Style</b><br>The DJI Osmo Nano is a clever, compact modern action camera with cutting-edge features. But what if it looked and acted less like a modern action camera and more like a classic waist level-viewfinder Hasselblad camera? For some reason, the…<br><a href=\"https://petapixel.com/2026/01/12/3d-printed-kit-gives-the-dji-osmo-nano-vintage-hasselblad-style/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/3d-printed-kit-gives-the-dji-osmo-nano-vintage-hasselblad-style/",
    "topic": "photo",
    "date": "2026-01-13T00:26:35.000Z"
  },
  {
    "title": "Thank You Hipsters: Because of You, Film Is Thriving Again",
    "q": "thank you hipsters: because of you, film is thriving again camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Thank You Hipsters: Because of You, Film Is Thriving Again</b><br>Once upon a time, in the last century, before hipsters and when only restaurants had menus, photography was film and film was photography. Both consumers and pros used film, and every camera jockey had a favorite kind: large format, medium…<br><a href=\"https://petapixel.com/2026/01/12/thank-you-hipsters-because-of-you-film-is-thriving-again/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/thank-you-hipsters-because-of-you-film-is-thriving-again/",
    "topic": "photo",
    "date": "2026-01-12T19:32:22.000Z"
  },
  {
    "title": "The Olympus OM-D E-M10 Mark IV Is Not Discontinued in the US",
    "q": "the olympus om-d e-m10 mark iv is not discontinued in the us camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Olympus OM-D E-M10 Mark IV Is Not Discontinued in the US</b><br>Last week, reports out of Japan indicated that the OM-D E-M10 Mark IV -- the last of the major camera lines that still bears the Olympus name instead of OM System -- was discontinued. That led some to lament the loss of Taylor Swift's favo…<br><a href=\"https://petapixel.com/2026/01/12/the-olympus-om-d-e-m10-mark-iv-is-not-discontinued-in-the-us/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/the-olympus-om-d-e-m10-mark-iv-is-not-discontinued-in-the-us/",
    "topic": "photo",
    "date": "2026-01-12T18:20:54.000Z"
  },
  {
    "title": "SG-image’s New 75mm f/1.2 Medium Format Portrait Prime Is Under $500",
    "q": "sg-image’s new 75mm f/1.2 medium format portrait prime is under $500 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>SG-image’s New 75mm f/1.2 Medium Format Portrait Prime Is Under $500</b><br>SG-image is a relatively new Chinese lens company making a wide range of lenses, including autofocus and manual lenses for photography and video across many different camera systems and lens mounts. The company's latest, a 75mm f/1.2 prime…<br><a href=\"https://petapixel.com/2026/01/12/sg-images-new-75mm-f-1-2-medium-format-portrait-prime-is-under-500/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/sg-images-new-75mm-f-1-2-medium-format-portrait-prime-is-under-500/",
    "topic": "photo",
    "date": "2026-01-12T17:33:32.000Z"
  },
  {
    "title": "An All-White Fujifilm X half Will Launch Exclusively in China",
    "q": "an all-white fujifilm x half will launch exclusively in china camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An All-White Fujifilm X half Will Launch Exclusively in China</b><br>Last week, it was reported that an all-white version of the Fujifilm X half would be available \"overseas\" -- a rather ambiguous description. Very little information is available about this camera, but PetaPixel has confirmed that it is a C…<br><a href=\"https://petapixel.com/2026/01/12/an-all-white-fujifilm-x-half-will-launch-exclusively-in-china/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/an-all-white-fujifilm-x-half-will-launch-exclusively-in-china/",
    "topic": "photo",
    "date": "2026-01-12T17:10:36.000Z"
  },
  {
    "title": "Jewish Baby, Whose Photo was Used on Nazi Magazine as ‘Aryan Ideal,’ Dies at 91",
    "q": "jewish baby, whose photo was used on nazi magazine as ‘aryan ideal,’ dies at 91 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Jewish Baby, Whose Photo was Used on Nazi Magazine as ‘Aryan Ideal,’ Dies at 91</b><br>Hessy Levinsons Taft, the Jewish infant whose photograph was unwittingly featured on a 1930s Nazi magazine as the image of the \"perfect Aryan baby,\" has died. [Read More]<br><a href=\"https://petapixel.com/2026/01/12/jewish-baby-whose-photo-was-used-on-nazi-magazine-as-aryan-ideal-dies-at-91/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/jewish-baby-whose-photo-was-used-on-nazi-magazine-as-aryan-ideal-dies-at-91/",
    "topic": "photo",
    "date": "2026-01-12T16:36:03.000Z"
  },
  {
    "title": "APS-C Cameras Dominate List of 2025 Best-Sellers",
    "q": "aps-c cameras dominate list of 2025 best-sellers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>APS-C Cameras Dominate List of 2025 Best-Sellers</b><br>Japanese retail analyst BCN+R has shared the top 10 best-selling interchangeable-lens mirrorless cameras of 2025, and Canon and Sony traded spots in the top five. [Read More]<br><a href=\"https://petapixel.com/2026/01/12/aps-c-cameras-dominate-list-of-2025-best-sellers/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/aps-c-cameras-dominate-list-of-2025-best-sellers/",
    "topic": "photo",
    "date": "2026-01-12T15:06:39.000Z"
  },
  {
    "title": "Nintendo Denies Promo Photos Were AI-Generated, Despite Some Weird Thumbs",
    "q": "nintendo denies promo photos were ai-generated, despite some weird thumbs camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nintendo Denies Promo Photos Were AI-Generated, Despite Some Weird Thumbs</b><br>Nintendo has been forced to deny that it used AI to create a series of marketing photos after speculation grew that the company didn't use a real photographer and models. [Read More]<br><a href=\"https://petapixel.com/2026/01/12/nintendo-denies-promo-photos-were-ai-generated-despite-some-weird-thumbs/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/12/nintendo-denies-promo-photos-were-ai-generated-despite-some-weird-thumbs/",
    "topic": "photo",
    "date": "2026-01-12T14:58:59.000Z"
  },
  {
    "title": "Portrait of Britain: Celebrating the faces that define a nation",
    "q": "portrait of britain: celebrating the faces that define a nation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Portrait of Britain: Celebrating the faces that define a nation</b><br>Portrait of Britain Vol. 8 Winners The British Journal of Photography has announced the winners of Portrait of Britain Vol. 8. The contest, which began in 2016, aims to celebrate the diverse mosaic of individuals who make up Great Britain …<br><a href=\"https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation",
    "topic": "photo",
    "date": "2026-01-12T21:48:00.000Z"
  },
  {
    "title": "DPReview Reader's Choice Awards 2025: Product of the Year",
    "q": "dpreview reader's choice awards 2025: product of the year camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Reader's Choice Awards 2025: Product of the Year</b><br>When you use DPReview links to buy products, the site may earn a commission. Product of the Year 2025: the results The final round of voting has closed, and it's time to reveal the winners of our 2025 Readers' Choice Awards! Beginning in D…<br><a href=\"https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Finding your way out of a creative drought with photo projects",
    "q": "finding your way out of a creative drought with photo projects camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Finding your way out of a creative drought with photo projects</b><br>An image from my third 365 project, taken in 2012. Photo: Abby Ferguson Every photographer inevitably goes through periods where they hit a wall. That wall can come from all kinds of things, including a lack of inspiration, growth stagnati…<br><a href=\"https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects",
    "topic": "photo",
    "date": "2026-01-11T15:00:00.000Z"
  },
  {
    "title": "Announcing our January 2026 photo challenge: \"Silly Signs\"",
    "q": "announcing our january 2026 photo challenge: \"silly signs\" camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Announcing our January 2026 photo challenge: \"Silly Signs\"</b><br>I came across this sign in a park in St. Petersburg, Russia, many years ago. It says, \"Attention! Keep an eye on your things.\" While the message is serious and a good reminder to tourists, I always thought the illustration was creative and…<br><a href=\"https://www.dpreview.com/articles/0843676549/january-2026-editors-photo-challenge-announced\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0843676549/january-2026-editors-photo-challenge-announced",
    "topic": "photo",
    "date": "2026-01-11T14:00:00.000Z"
  },
  {
    "title": "Photographing Mongolia in winter: part 1",
    "q": "photographing mongolia in winter: part 1 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Mongolia in winter: part 1</b><br>The Khongor Sand Dunes in Mongolia, partially covered by snow and ice. DJI Mavic 2 Pro | ISO 100 | 1/200 sec | F8 Photo: Erez Marom Today, I'd like to talk about my experience shooting landscapes and wildlife in Mongolia. Known for its rem…<br><a href=\"https://www.dpreview.com/articles/6654015450/photographing-mongolia-in-winter-part-1\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/6654015450/photographing-mongolia-in-winter-part-1",
    "topic": "photo",
    "date": "2026-01-10T14:00:00.000Z"
  },
  {
    "title": "The weird way to get a \"free\" X half",
    "q": "the weird way to get a \"free\" x half camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The weird way to get a \"free\" X half</b><br>When you use DPReview links to buy products, the site may earn a commission. More practically, the camera is also $200 off at most retailers, too. Photo: Richard Butler UPDATE Jan. 12: This deal no longer appears to be active on Adorama's …<br><a href=\"https://www.dpreview.com/articles/7840103808/x-half-adorama-sale-free-with-x-t5\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7840103808/x-half-adorama-sale-free-with-x-t5",
    "topic": "photo",
    "date": "2026-01-09T20:07:00.000Z"
  },
  {
    "title": "The best photo and video gear from CES 2026",
    "q": "the best photo and video gear from ces 2026 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best photo and video gear from CES 2026</b><br>Image: Consumer Technology Association (CTA) Today marks the end of the Consumer Electronics Show (CES), the annual trade show that showcases innovative technology and devices. While photography once played a more prominent role at the eve…<br><a href=\"https://www.dpreview.com/news/9310455701/ces-2026-roundup-camera-accessories-photography-videography\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9310455701/ces-2026-roundup-camera-accessories-photography-videography",
    "topic": "photo",
    "date": "2026-01-09T14:00:00.000Z"
  },
  {
    "title": "What's in your bag? Bill Ferris' essential gear for shooting in the Arizona high country",
    "q": "what's in your bag? bill ferris' essential gear for shooting in the arizona high country camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What's in your bag? Bill Ferris' essential gear for shooting in the Arizona high country</b><br>When you use DPReview links to buy products, the site may earn a commission. Bull elk take shelter in a morning fog while grazing the Grass Flat Tank meadow. Nikon Z9 + Nikon Z 800mm F6.3 VR S | F6.3 | 1/25 sec | ISO 12800 Photo: Bill Ferr…<br><a href=\"https://www.dpreview.com/articles/6813457218/what-s-in-your-bag-bill-ferris\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/6813457218/what-s-in-your-bag-bill-ferris",
    "topic": "photo",
    "date": "2026-01-08T14:00:00.000Z"
  },
  {
    "title": "Your 2026 New Year's photography resolutions",
    "q": "your 2026 new year's photography resolutions camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Your 2026 New Year's photography resolutions</b><br>Vietnam - Mamiya 7 - Fuji Provia 100F. Photo: Community member MyReality In last week's Question of the week, our community eagerly awaited the arrival of 2026 with a healthy list of New Year's resolutions, ranging from committing to a bet…<br><a href=\"https://www.dpreview.com/articles/5295229467/your-2026-new-year-s-photography-resolutions\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5295229467/your-2026-new-year-s-photography-resolutions",
    "topic": "photo",
    "date": "2026-01-07T20:07:00.000Z"
  },
  {
    "title": "Fujifilm's latest Instax instant camera has a new trick: movies",
    "q": "fujifilm's latest instax instant camera has a new trick: movies camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm's latest Instax instant camera has a new trick: movies</b><br>Image: Fujifilm Fujifilm has announced a surprising addition to its popular Instax camera line: the Instax Mini Evo Cinema. The camera builds on Fujifilm's existing Evo lineup, which focuses on a hybrid of digital and instant film, adding …<br><a href=\"https://www.dpreview.com/news/0290830182/fujifilm-s-latest-instax-instant-camera-has-a-new-trick-movies\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0290830182/fujifilm-s-latest-instax-instant-camera-has-a-new-trick-movies",
    "topic": "photo",
    "date": "2026-01-07T19:42:00.000Z"
  },
  {
    "title": " Galaxy S27 Ultra: possible camera specs emerge ",
    "q": " galaxy s27 ultra: possible camera specs emerge  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Galaxy S27 Ultra: possible camera specs emerge </b><br>New rumor suggests the exact size, resolution and name of the primary image sensor that might appear in Samsung's 2027 flagship phone<br><a href=\"https://www.digitalcameraworld.com/tech/android-phones/galaxy-s27-ultra-possible-camera-specs-emerge\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/android-phones/galaxy-s27-ultra-possible-camera-specs-emerge",
    "topic": "photo",
    "date": "2026-01-12T21:47:03.000Z"
  },
  {
    "title": " Kodak's US$100 retro compact camera retakes Japan's top-selling spot – and Sony's US$5,000+ flagship barely makes the cut ",
    "q": " kodak's us$100 retro compact camera retakes japan's top-selling spot – and sony's us$5,000+ flagship barely makes the cut  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Kodak's US$100 retro compact camera retakes Japan's top-selling spot – and Sony's US$5,000+ flagship barely makes the cut </b><br>A budget Kodak compact camera beats premium rivals as Yodobashi's final 2025 rankings deliver a surprise winner...<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/kodaks-us-usd100-retro-compact-camera-retakes-japans-top-selling-spot-and-sonys-us-usd5-000-flagship-barely-makes-the-cut\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/kodaks-us-usd100-retro-compact-camera-retakes-japans-top-selling-spot-and-sonys-us-usd5-000-flagship-barely-makes-the-cut",
    "topic": "photo",
    "date": "2026-01-12T17:35:00.000Z"
  },
  {
    "title": " These lifesize 35mm rolls of film are actually digital compact cameras!  ",
    "q": " these lifesize 35mm rolls of film are actually digital compact cameras!   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These lifesize 35mm rolls of film are actually digital compact cameras!  </b><br>Looking for an alternative to the Kodak Charmera? The SnapRoll is a compact camera disguised as a roll of 35mm film<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/these-lifesize-35mm-rolls-of-film-are-actually-digital-compact-cameras\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/these-lifesize-35mm-rolls-of-film-are-actually-digital-compact-cameras",
    "topic": "photo",
    "date": "2026-01-12T17:15:30.000Z"
  },
  {
    "title": " Godox iT32 & X5 review: an ingenious cross-brand flash and trigger kit that’s more than the sum of its parts ",
    "q": " godox it32 & x5 review: an ingenious cross-brand flash and trigger kit that’s more than the sum of its parts  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Godox iT32 & X5 review: an ingenious cross-brand flash and trigger kit that’s more than the sum of its parts </b><br>The Godox iT32 flash and X5 wireless trigger join together with magnetic attraction but additional triggers make dedicated TTL flash possible with a single flash head across several camera systems<br><a href=\"https://www.digitalcameraworld.com/cameras/flashguns/godox-it32-and-x5-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/flashguns/godox-it32-and-x5-review",
    "topic": "photo",
    "date": "2026-01-12T15:00:00.000Z"
  },
  {
    "title": " I wanted to buy a new lens – but I ended up buying a new camera body instead. Here’s what happened… ",
    "q": " i wanted to buy a new lens – but i ended up buying a new camera body instead. here’s what happened…  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I wanted to buy a new lens – but I ended up buying a new camera body instead. Here’s what happened… </b><br>I’ve been looking at winter sale offers on a super-telephoto zoom but stumbled across a Nikon Z6 III deal that’s simply too good to miss<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/i-wanted-to-buy-a-new-lens-but-i-ended-up-buying-a-new-camera-body-instead-heres-what-happened\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/i-wanted-to-buy-a-new-lens-but-i-ended-up-buying-a-new-camera-body-instead-heres-what-happened",
    "topic": "photo",
    "date": "2026-01-12T13:39:57.000Z"
  },
  {
    "title": " I took photos of 36 electric boxes in Buenos Aires and made some decent dough from them. Odd subjects often pay better than postcard views ",
    "q": " i took photos of 36 electric boxes in buenos aires and made some decent dough from them. odd subjects often pay better than postcard views  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I took photos of 36 electric boxes in Buenos Aires and made some decent dough from them. Odd subjects often pay better than postcard views </b><br>I spent my time in the Argentine capital taking photos of less obvious subjects – and my approach paid dividends!<br><a href=\"https://www.digitalcameraworld.com/photography/travel-photography/i-took-photos-of-36-electric-boxes-in-buenos-aires-and-made-some-decent-dough-from-them-odd-subjects-often-pay-better-than-postcard-views\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/travel-photography/i-took-photos-of-36-electric-boxes-in-buenos-aires-and-made-some-decent-dough-from-them-odd-subjects-often-pay-better-than-postcard-views",
    "topic": "photo",
    "date": "2026-01-12T11:21:09.000Z"
  },
  {
    "title": " 100 winning portraits turn Britain's streets into a nationwide photography exhibition ",
    "q": " 100 winning portraits turn britain's streets into a nationwide photography exhibition  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> 100 winning portraits turn Britain's streets into a nationwide photography exhibition </b><br>Portrait of Britain Vol. 8 reveals powerful stories of modern life on digital screens across the UK<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/100-winning-portraits-turn-britains-streets-into-a-nationwide-photography-exhibition\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/100-winning-portraits-turn-britains-streets-into-a-nationwide-photography-exhibition",
    "topic": "photo",
    "date": "2026-01-12T11:15:00.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Photographer Insurance Guide",
    "q": "photographer insurance guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Insurance Guide</b><br>Let’s face it, photography is not a cheap venture to get into. Regardless of whether you’re a professional or a hobbyist, buying and keeping your gear up-to-date can be very expensive. Because of this, it’s incredibly important to keep you…<br><a href=\"https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/",
    "topic": "photo",
    "date": "2026-01-09T06:37:32.000Z"
  },
  {
    "title": "15 Tips for Teaching Photography Workshops",
    "q": "15 tips for teaching photography workshops camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>15 Tips for Teaching Photography Workshops</b><br>Hosting a photography workshop may not be the easiest way to earn additional income, but it can prove rewarding when done right. Should you choose to teach one, follow these 15 tips to help ensure that your workshop is a success!<br><a href=\"https://www.slrlounge.com/tips-for-a-photography-workshop/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tips-for-a-photography-workshop/",
    "topic": "photo",
    "date": "2026-01-08T06:35:30.000Z"
  },
  {
    "title": "Nikon Announces the NIKKOR Z 24-105mm f/4-7.1: A Compact Full-Frame Zoom Built for Everyday Versatility",
    "q": "nikon announces the nikkor z 24-105mm f/4-7.1: a compact full-frame zoom built for everyday versatility camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon Announces the NIKKOR Z 24-105mm f/4-7.1: A Compact Full-Frame Zoom Built for Everyday Versatility</b><br>Nikon has officially announced the NIKKOR Z 24-105mm f/4-7.1, a new standard zoom lens for its full-frame Z-mount system. Priced at $549.95 and scheduled to ship in mid-January 2026, the lens targets photographers and hybrid shooters seeki…<br><a href=\"https://www.slrlounge.com/nikon-announces-the-nikkor-z-24-105mm-f-4-7-1-a-compact-full-frame-zoom-built-for-everyday-versatility/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/nikon-announces-the-nikkor-z-24-105mm-f-4-7-1-a-compact-full-frame-zoom-built-for-everyday-versatility/",
    "topic": "photo",
    "date": "2026-01-07T17:23:31.000Z"
  },
  {
    "title": "How to Fix a Photo With Bad Lighting in Post Using Adobe Lightroom",
    "q": "how to fix a photo with bad lighting in post using adobe lightroom camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Fix a Photo With Bad Lighting in Post Using Adobe Lightroom</b><br>Photography is all about capturing the perfect moment, but sometimes the lighting just doesn’t cooperate. When this happens, it can be frustrating to have a photo that doesn’t showcase your subject as you intended. Fortunately, with the ri…<br><a href=\"https://www.slrlounge.com/how-to-fix-a-photo-with-bad-lighting-adobe-lightroom/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-fix-a-photo-with-bad-lighting-adobe-lightroom/",
    "topic": "photo",
    "date": "2026-01-07T06:31:56.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "Review: NEEWER Z160 Retro Camera Flash",
    "q": "review: neewer z160 retro camera flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: NEEWER Z160 Retro Camera Flash</b><br>THE NEEWER Z160 Retro Camera Flash is a fun, versatile, cool-looking compact and affordable on-camera flash aimed at beginner photographers. It could not be easier to use! It’s also surprisingly useful for a variety of applications. Note: …<br><a href=\"https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/",
    "topic": "photo",
    "date": "2025-12-09T19:00:00.000Z"
  },
  {
    "title": "MagCam Phone Grip & Fill Light Review",
    "q": "magcam phone grip & fill light review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>MagCam Phone Grip & Fill Light Review</b><br>The MagCam Phone Grip by PGYTech is one of those little gadgets that promises to make mobile shooting feel more like handling a real camera, and for the most part, it delivers. It has a smart modular design, a built-in power bank and a han…<br><a href=\"https://photofocus.com/reviews/magcam-phone-grip-fill-light-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/magcam-phone-grip-fill-light-review/",
    "topic": "photo",
    "date": "2025-12-09T12:00:00.000Z"
  },
  {
    "title": "The best robot vacuums we’ve tested for 2026",
    "q": "the best robot vacuums we’ve tested for 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best robot vacuums we’ve tested for 2026</b><br>Robot vacuums are impressive devices that will clean your floors well and — thanks to bigger batteries and better robot brains — rarely get tired of doing their job. Over the last few years, these floor-sweeping bots have gone from utilita…<br><a href=\"https://www.theverge.com/22997597/best-robot-vacuum-cleaner\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
    "topic": "it",
    "date": "2026-01-13T00:04:56.000Z"
  },
  {
    "title": "Framework hikes desktop PC prices as RAM shortage drags on",
    "q": "framework hikes desktop pc prices as ram shortage drags on windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Framework hikes desktop PC prices as RAM shortage drags on</b><br>Just weeks after raising the price of its RAM modules, Framework has announced that it's also increasing the price of its desktop PC in response to the global memory shortage. The Framework Desktop with 32GB of RAM and an AMD Ryzen AI Max …<br><a href=\"https://www.theverge.com/news/860988/framework-desktop-pc-price-increase-ram-memory-shortage\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/860988/framework-desktop-pc-price-increase-ram-memory-shortage",
    "topic": "it",
    "date": "2026-01-12T22:25:08.000Z"
  },
  {
    "title": "Anthropic wants you to use Claude to &#8216;Cowork&#8217; in latest AI agent push",
    "q": "anthropic wants you to use claude to &#8216;cowork&#8217; in latest ai agent push windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Anthropic wants you to use Claude to &#8216;Cowork&#8217; in latest AI agent push</b><br>Anthropic wants to expand Claude's AI agent capabilities and take advantage of the growing hype around Claude Code - and it's doing it with a brand-new feature released Monday, dubbed \"Claude Cowork.\" \"Cowork can take on many of the same t…<br><a href=\"https://www.theverge.com/ai-artificial-intelligence/860730/anthropic-cowork-feature-ai-agents-claude-code\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/ai-artificial-intelligence/860730/anthropic-cowork-feature-ai-agents-claude-code",
    "topic": "it",
    "date": "2026-01-12T19:30:00.000Z"
  },
  {
    "title": "New York wants to regulate Roblox",
    "q": "new york wants to regulate roblox windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New York wants to regulate Roblox</b><br>New York Gov. Kathy Hochul is making kids' online safety a cornerstone of her administration, and she's eyeing a platform that has often flown under the radar: Roblox. As progress in Congress has stagnated, states have become the primary d…<br><a href=\"https://www.theverge.com/policy/860727/new-york-governor-hochul-roblox-kids-online-safety\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/policy/860727/new-york-governor-hochul-roblox-kids-online-safety",
    "topic": "it",
    "date": "2026-01-12T19:24:31.000Z"
  },
  {
    "title": "These are my favorite Switch 2 accessories",
    "q": "these are my favorite switch 2 accessories windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These are my favorite Switch 2 accessories</b><br>The Nintendo Switch 2 can be enjoyed right out of the box, but it’s even better with the right accessories. Some of these add-ons are more crucial than others, especially if you’re deciding what to buy early on. For example, a case and a s…<br><a href=\"https://www.theverge.com/buying-guides/720160/best-switch-2-accessories\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/buying-guides/720160/best-switch-2-accessories",
    "topic": "it",
    "date": "2026-01-12T19:00:00.000Z"
  },
  {
    "title": "Cloudflare Says Winter Olympics Cybersecurity Is at Risk in Spat With Italian Regulators",
    "q": "cloudflare says winter olympics cybersecurity is at risk in spat with italian regulators windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Cloudflare Says Winter Olympics Cybersecurity Is at Risk in Spat With Italian Regulators</b><br>CEO Matthew Prince is unhappy with an antipiracy fine imposed by Italy on the company.<br><a href=\"https://www.cnet.com/tech/services-and-software/cloudflare-says-winter-olympics-cybersecurity-is-at-risk-in-spat-with-italian-regulators/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/cloudflare-says-winter-olympics-cybersecurity-is-at-risk-in-spat-with-italian-regulators/",
    "topic": "it",
    "date": "2026-01-12T22:06:00.000Z"
  },
  {
    "title": " Retro Apple emulator ported to $60 ESP32 microcontroller-powered touchscreen tablet — supports Mac OS8.1 and a virtual MC68040 CPU in major emulation leap ",
    "q": " retro apple emulator ported to $60 esp32 microcontroller-powered touchscreen tablet — supports mac os8.1 and a virtual mc68040 cpu in major emulation leap  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Retro Apple emulator ported to $60 ESP32 microcontroller-powered touchscreen tablet — supports Mac OS8.1 and a virtual MC68040 CPU in major emulation leap </b><br>A new emulator makes running classic Apple Macintosh 68K software a breeze on a cheap, portable, IoT development kit.<br><a href=\"https://www.tomshardware.com/software/macos/retro-apple-emulator-ported-to-usd60-esp32-microcontroller-powered-touchscreen-tablet-supports-mac-os8-1-and-a-virtual-mc68040-cpu-in-major-emulation-leap\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/software/macos/retro-apple-emulator-ported-to-usd60-esp32-microcontroller-powered-touchscreen-tablet-supports-mac-os8-1-and-a-virtual-mc68040-cpu-in-major-emulation-leap",
    "topic": "it",
    "date": "2026-01-12T12:58:18.000Z"
  },
  {
    "title": " Microsoft’s Copilot ambitions in mobile have been crushed as Google locks down AI dominance across Android and iPhone, and makes a deal with Apple ",
    "q": " microsoft’s copilot ambitions in mobile have been crushed as google locks down ai dominance across android and iphone, and makes a deal with apple  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft’s Copilot ambitions in mobile have been crushed as Google locks down AI dominance across Android and iPhone, and makes a deal with Apple </b><br>Apple is partnering with Google to supercharge its AI-powered features, including a major Siri upgrade, which is slated to ship later this year.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/google-confirms-ai-dominance-on-android-and-iphone\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/google-confirms-ai-dominance-on-android-and-iphone",
    "topic": "it",
    "date": "2026-01-12T22:03:57.000Z"
  },
  {
    "title": " Microsoft is ending support for Office Lens on iOS and Android, shutting down one of its most useful mobile apps ",
    "q": " microsoft is ending support for office lens on ios and android, shutting down one of its most useful mobile apps  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is ending support for Office Lens on iOS and Android, shutting down one of its most useful mobile apps </b><br>Microsoft Lens is being retired from iOS and Android. First launched on Windows Phone under a different name, the app is being shut down in favor of OneDrive.<br><a href=\"https://www.windowscentral.com/software-apps/microsoft-just-killed-this-5-star-app-say-goodbye-to-a-windows-phone-legend\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/microsoft-just-killed-this-5-star-app-say-goodbye-to-a-windows-phone-legend",
    "topic": "it",
    "date": "2026-01-12T21:52:04.000Z"
  },
  {
    "title": " Paint has been part of Windows for decades, yet in 2026 Microsoft faces a choice: reinvent it, retire it, or let it quietly linger ",
    "q": " paint has been part of windows for decades, yet in 2026 microsoft faces a choice: reinvent it, retire it, or let it quietly linger  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Paint has been part of Windows for decades, yet in 2026 Microsoft faces a choice: reinvent it, retire it, or let it quietly linger </b><br>Paint is getting a new collapsible toolbar in the latest Insider builds. Is Microsoft finally finding the right balance between \"classic\" simplicity and modern power?<br><a href=\"https://www.windowscentral.com/software-apps/paint-has-been-part-of-windows-for-decades-yet-in-2026-microsoft-faces-a-choice-reinvent-it-retire-it-or-let-it-quietly-linger\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/paint-has-been-part-of-windows-for-decades-yet-in-2026-microsoft-faces-a-choice-reinvent-it-retire-it-or-let-it-quietly-linger",
    "topic": "it",
    "date": "2026-01-12T19:44:04.000Z"
  },
  {
    "title": " \"That's why we decided to cut the line\" — AMD Senior VP explains why there's no FSR Redstone on RDNA 3, leaves room for future compatibility ",
    "q": " \"that's why we decided to cut the line\" — amd senior vp explains why there's no fsr redstone on rdna 3, leaves room for future compatibility  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> \"That's why we decided to cut the line\" — AMD Senior VP explains why there's no FSR Redstone on RDNA 3, leaves room for future compatibility </b><br>In the world of PC upscaling, the best stuff only runs on the latest hardware. AMD's Andrej Zdravkovic explains why that is while responding to the enthusiasts who are forcing the latest FSR updates onto RDNA 3 GPUs.<br><a href=\"https://www.windowscentral.com/hardware/amd/amd-fsr-redstone-rdna-3\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/amd/amd-fsr-redstone-rdna-3",
    "topic": "it",
    "date": "2026-01-12T15:14:34.000Z"
  },
  {
    "title": " Unreleased Intel Arc B770 Battlemage GPU spotted in Panther Lake laptop drivers, but it still doesn't officially exist — why wasn't the \"BMG-G31\" announced at CES? ",
    "q": " unreleased intel arc b770 battlemage gpu spotted in panther lake laptop drivers, but it still doesn't officially exist — why wasn't the \"bmg-g31\" announced at ces?  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Unreleased Intel Arc B770 Battlemage GPU spotted in Panther Lake laptop drivers, but it still doesn't officially exist — why wasn't the \"BMG-G31\" announced at CES? </b><br>Hints of the codenamed Intel Arc BMG-G31 discrete GPU were found in Panther Lake laptop drivers, but the B770 was never announced at CES 2026 in Las Vegas.<br><a href=\"https://www.windowscentral.com/gaming/pc-gaming/arc-b770-battlemage-gpu-referenced-in-driver-updates\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/pc-gaming/arc-b770-battlemage-gpu-referenced-in-driver-updates",
    "topic": "it",
    "date": "2026-01-12T15:09:05.000Z"
  },
  {
    "title": "University of Hawaii Cancer Center hit by ransomware attack",
    "q": "university of hawaii cancer center hit by ransomware attack windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>University of Hawaii Cancer Center hit by ransomware attack</b><br>​University of Hawaii says a ransomware gang breached its Cancer Center in August 2025, stealing data of study participants, including documents from the 1990s containing Social Security numbers. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/university-of-hawaii-cancer-center-hit-by-ransomware-attack/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/university-of-hawaii-cancer-center-hit-by-ransomware-attack/",
    "topic": "it",
    "date": "2026-01-12T18:48:20.000Z"
  },
  {
    "title": "Apple confirms Google Gemini will power Siri, says privacy remains a priority ",
    "q": "apple confirms google gemini will power siri, says privacy remains a priority  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple confirms Google Gemini will power Siri, says privacy remains a priority </b><br>Apple and Google have confirmed that the next version of Siri will use Gemini and Google Cloud in a multi-year collaboration between the two tech giants. [...]<br><a href=\"https://www.bleepingcomputer.com/news/apple/apple-confirms-google-gemini-will-power-siri-says-privacy-remains-a-priority/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/apple/apple-confirms-google-gemini-will-power-siri-says-privacy-remains-a-priority/",
    "topic": "it",
    "date": "2026-01-12T16:43:47.000Z"
  },
  {
    "title": "Microsoft is retiring the Lens scanner app for iOS, Android",
    "q": "microsoft is retiring the lens scanner app for ios, android windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft is retiring the Lens scanner app for iOS, Android</b><br>Microsoft has started retiring the Microsoft Lens PDF scanner app for Android and iOS devices on Friday, January 9th, with plans to remove it from app stores next month. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-is-retiring-the-lens-scanner-app-for-ios-android/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-is-retiring-the-lens-scanner-app-for-ios-android/",
    "topic": "it",
    "date": "2026-01-12T15:48:37.000Z"
  },
  {
    "title": "Obsidian 1.11 is a massive update for desktop, iPhone, and Android",
    "q": "obsidian 1.11 is a massive update for desktop, iphone, and android windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Obsidian 1.11 is a massive update for desktop, iPhone, and Android</b><br>More widgets and a new design for mobile platforms, and some helpful fixes for desktop.<br><a href=\"https://www.howtogeek.com/obsidian-11-1-is-a-massive-update-for-desktop-iphone-and-android/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/obsidian-11-1-is-a-massive-update-for-desktop-iphone-and-android/",
    "topic": "it",
    "date": "2026-01-12T19:41:59.000Z"
  },
  {
    "title": "Older Mac computers are about to lose Google Chrome",
    "q": "older mac computers are about to lose google chrome windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Older Mac computers are about to lose Google Chrome</b><br>If you're stuck on macOS 12, Firefox will be your only option.<br><a href=\"https://www.howtogeek.com/older-mac-computers-are-about-to-lose-google-chrome/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/older-mac-computers-are-about-to-lose-google-chrome/",
    "topic": "it",
    "date": "2026-01-12T17:44:04.000Z"
  },
  {
    "title": "iPhones might finally catch up to Android in this one area",
    "q": "iphones might finally catch up to android in this one area windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>iPhones might finally catch up to Android in this one area</b><br>Apple taps Google Gemini to power next generation of Siri.<br><a href=\"https://www.howtogeek.com/iphones-might-finally-catch-up-to-android-in-this-one-area/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/iphones-might-finally-catch-up-to-android-in-this-one-area/",
    "topic": "it",
    "date": "2026-01-12T16:43:08.000Z"
  },
  {
    "title": "Over 1,500,000 Windows users downloaded this Linux distro in under three months",
    "q": "over 1,500,000 windows users downloaded this linux distro in under three months windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Over 1,500,000 Windows users downloaded this Linux distro in under three months</b><br>It's still going strong.<br><a href=\"https://www.xda-developers.com/over-1500000-windows-users-downloaded-linux-distro-under-three-months/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/over-1500000-windows-users-downloaded-linux-distro-under-three-months/",
    "topic": "it",
    "date": "2026-01-12T23:51:51.000Z"
  },
  {
    "title": "Apple's major Siri upgrade is powered by Google's Gemini",
    "q": "apple's major siri upgrade is powered by google's gemini windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple's major Siri upgrade is powered by Google's Gemini</b><br>The tech industry rivals are working together on the next-generation version of the voice-activated assistant.<br><a href=\"https://www.xda-developers.com/apples-major-siri-upgrade-is-powered-by-googles-gemini/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/apples-major-siri-upgrade-is-powered-by-googles-gemini/",
    "topic": "it",
    "date": "2026-01-12T21:54:50.000Z"
  },
  {
    "title": "The Windows Registry is the problem nobody wants to admit",
    "q": "the windows registry is the problem nobody wants to admit windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Windows Registry is the problem nobody wants to admit</b><br>It's a legacy system Microsoft hasn't moved beyond when it should have<br><a href=\"https://www.xda-developers.com/windows-registry-is-the-problem-nobody-wants-to-admit/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-registry-is-the-problem-nobody-wants-to-admit/",
    "topic": "it",
    "date": "2026-01-12T21:00:21.000Z"
  }
]