[
  {
    "title": "Benro’s Electronic Variable ND Filter Automatically Changes its Strength",
    "q": "benro’s electronic variable nd filter automatically changes its strength camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Benro’s Electronic Variable ND Filter Automatically Changes its Strength</b><br>Benro has unveiled the NE1, an adjustable electronic neutral density (ND) filter system designed for photographers and videographers. Without rotating the filter, users can adjust the ND filter strength from about ND3 to ND64. [Read More]<br><a href=\"https://petapixel.com/2025/12/18/benros-electronic-variable-nd-filter-automatically-changes-its-strength/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/benros-electronic-variable-nd-filter-automatically-changes-its-strength/",
    "topic": "photo",
    "date": "2025-12-18T22:03:14.000Z"
  },
  {
    "title": "This iPhone Case Has a Screen So You Can Shoot Selfies With the Rear Cameras",
    "q": "this iphone case has a screen so you can shoot selfies with the rear cameras camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This iPhone Case Has a Screen So You Can Shoot Selfies With the Rear Cameras</b><br>Despite Apple's impressive and successful efforts to give the iPhone 17 series of smartphones a much better front-facing camera, some iPhone 17 Pro users would still prefer to use their device's rear cameras. However, this has the drawback…<br><a href=\"https://petapixel.com/2025/12/18/this-iphone-case-has-a-screen-so-you-can-shoot-selfies-with-the-rear-cameras/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/this-iphone-case-has-a-screen-so-you-can-shoot-selfies-with-the-rear-cameras/",
    "topic": "photo",
    "date": "2025-12-18T20:06:02.000Z"
  },
  {
    "title": "These Are the Winners of the Huge, Annual $67,500 Photography Grant",
    "q": "these are the winners of the huge, annual $67,500 photography grant camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>These Are the Winners of the Huge, Annual $67,500 Photography Grant</b><br>The winners of the annual W. Eugene Smith Grant in Humanistic Photography -- one of the largest grants in support of the photographic arts that opened for entries in July -- have been announced and the winner is Palestinian-American Maen H…<br><a href=\"https://petapixel.com/2025/12/18/these-are-the-winners-of-the-huge-annual-67500-photography-grant/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/these-are-the-winners-of-the-huge-annual-67500-photography-grant/",
    "topic": "photo",
    "date": "2025-12-18T19:07:23.000Z"
  },
  {
    "title": "Trail Camera Captures Elusive ‘Fisher’ in Ohio County for First Time Since 1800s",
    "q": "trail camera captures elusive ‘fisher’ in ohio county for first time since 1800s camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Trail Camera Captures Elusive ‘Fisher’ in Ohio County for First Time Since 1800s</b><br>A trail camera captured rare footage of a \"fisher\" in Cuyahoga County, Ohio, marking the first confirmed sighting of the elusive species in the area since the 1800s. [Read More]<br><a href=\"https://petapixel.com/2025/12/18/trail-camera-captures-elusive-fisher-in-ohio-county-for-first-time-since-1800s/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/trail-camera-captures-elusive-fisher-in-ohio-county-for-first-time-since-1800s/",
    "topic": "photo",
    "date": "2025-12-18T18:31:36.000Z"
  },
  {
    "title": "Blackmagic Cameras Can Now Pre-Record Up to 10 Minutes of Video",
    "q": "blackmagic cameras can now pre-record up to 10 minutes of video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Blackmagic Cameras Can Now Pre-Record Up to 10 Minutes of Video</b><br>Blackmagic Camera 10.0 has arrived, bringing new features and improved performance to numerous Blackmagic Design camera models, including the Pyxis 12K, Pyxis 6K, and Ursa Broadcast G2. [Read More]<br><a href=\"https://petapixel.com/2025/12/18/blackmagic-cameras-can-now-pre-record-up-to-10-minutes-of-video/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/blackmagic-cameras-can-now-pre-record-up-to-10-minutes-of-video/",
    "topic": "photo",
    "date": "2025-12-18T18:27:34.000Z"
  },
  {
    "title": "50 World Sports Photography Awards Finalists Capture Beauty and Brutality",
    "q": "50 world sports photography awards finalists capture beauty and brutality camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>50 World Sports Photography Awards Finalists Capture Beauty and Brutality</b><br>Around 4,100 photographers from 123 different countries entered over 23,000 photos into the World Sports Photography Awards 2026 competition. While the winners won't be revealed until next month, the finalists across the contest's 24 categ…<br><a href=\"https://petapixel.com/2025/12/18/50-world-sports-photography-awards-finalists-capture-beauty-and-brutality/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/50-world-sports-photography-awards-finalists-capture-beauty-and-brutality/",
    "topic": "photo",
    "date": "2025-12-18T15:52:03.000Z"
  },
  {
    "title": "7Artisans Expands its Fisheye Lineup With $199 MF 6mm f/2",
    "q": "7artisans expands its fisheye lineup with $199 mf 6mm f/2 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>7Artisans Expands its Fisheye Lineup With $199 MF 6mm f/2</b><br>7Artisans has introduced the 6mm f/2, an ultra-wide, manual focus fisheye lens for APS-C cameras. Available for Sony E, Fujifilm X, Canon EOS R, Nikon Z, and Micro Four Thirds mounts, the new ultra-wide lens delivers a dramatic 220° diagon…<br><a href=\"https://petapixel.com/2025/12/18/7artisans-expands-its-fisheye-lineup-with-199-mf-6mm-f-2/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/7artisans-expands-its-fisheye-lineup-with-199-mf-6mm-f-2/",
    "topic": "photo",
    "date": "2025-12-18T15:10:49.000Z"
  },
  {
    "title": "Leica Significantly Updates SL3 and Q3 Series’ Autofocus Performance",
    "q": "leica significantly updates sl3 and q3 series’ autofocus performance camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Leica Significantly Updates SL3 and Q3 Series’ Autofocus Performance</b><br>Leica has announced substantial updates to both the SL3 and the Q3 family of cameras with what it bills as \"comprehensive enhancements,\" specifically enabling a more precise, faster, and more intuitive shooting experience for photos and vi…<br><a href=\"https://petapixel.com/2025/12/18/leica-significantly-updates-sl3-and-q3-series-autofocus-performance/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/18/leica-significantly-updates-sl3-and-q3-series-autofocus-performance/",
    "topic": "photo",
    "date": "2025-12-18T14:00:21.000Z"
  },
  {
    "title": "Mathew's Photo of the year: Computer game industry adventures",
    "q": "mathew's photo of the year: computer game industry adventures camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mathew's Photo of the year: Computer game industry adventures</b><br>Photo: Mathew Anderson and Adam Savage at SXSW 2025 game industry conference track. When the team asked me to contribute to their Photo of the Year series, I wanted to showcase a scene that would help the community gain a deeper understand…<br><a href=\"https://www.dpreview.com/articles/5709132829/mathew-s-photo-of-the-year-computer-game-industry-adventures\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5709132829/mathew-s-photo-of-the-year-computer-game-industry-adventures",
    "topic": "photo",
    "date": "2025-12-18T21:59:00.000Z"
  },
  {
    "title": "This year in camera tech: the advances that shaped 2025",
    "q": "this year in camera tech: the advances that shaped 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This year in camera tech: the advances that shaped 2025</b><br>HDR imagery should allow a more lifelike version of images with interesting highlights. Photo: Richard Butler We often see concern expressed that there's no real innovation in the industry or that, horrors of horrors, there's more progress…<br><a href=\"https://www.dpreview.com/articles/0574423873/this-year-in-camera-tech-the-advances-that-shaped-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0574423873/this-year-in-camera-tech-the-advances-that-shaped-2025",
    "topic": "photo",
    "date": "2025-12-18T15:00:00.000Z"
  },
  {
    "title": "Lensrentals' figures hint at Canon/stills and Sony/video lockout",
    "q": "lensrentals' figures hint at canon/stills and sony/video lockout camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Lensrentals' figures hint at Canon/stills and Sony/video lockout</b><br>Canon RF 24-70mm F2.8L IS: Lensrentals' most-rented lens of 2025. Image: Canon It's that time of year when Lensrentals gives a glimpse into the trends it's seen during the year with its annual list of most-rented gear. This years' numbers …<br><a href=\"https://www.dpreview.com/news/3872941797/canon-and-sony-dominate-for-photo-and-video-in-lensrentals-annual-figures\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3872941797/canon-and-sony-dominate-for-photo-and-video-in-lensrentals-annual-figures",
    "topic": "photo",
    "date": "2025-12-17T20:38:00.000Z"
  },
  {
    "title": "Question of the week: What is the most significant photography lesson you learned in 2025?",
    "q": "question of the week: what is the most significant photography lesson you learned in 2025? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What is the most significant photography lesson you learned in 2025?</b><br>Image: Westend61 / Westend61 via Getty Images Welcome back to our Question of the Week series! This reader-focused series aims to get our photographic community to share thoughts on all sorts of photography-related topics in our forums. We…<br><a href=\"https://www.dpreview.com/forums/threads/question-of-the-week-what-is-the-most-significant-photography-lesson-you-learned-in-2025.4824407/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/question-of-the-week-what-is-the-most-significant-photography-lesson-you-learned-in-2025.4824407/",
    "topic": "photo",
    "date": "2025-12-17T17:00:00.000Z"
  },
  {
    "title": "Gear of the Year - Abby's choice: the Hasselblad X2D II 100C",
    "q": "gear of the year - abby's choice: the hasselblad x2d ii 100c camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Gear of the Year - Abby's choice: the Hasselblad X2D II 100C</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Abby Ferguson 2025 was inadvertently the year of medium format photography for me. It started with my husband gifting me a medium format film camera for Ch…<br><a href=\"https://www.dpreview.com/articles/7581740878/gear-of-the-year-2025-abbys-choice-the-hasselblad-x2d-ii-100c\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7581740878/gear-of-the-year-2025-abbys-choice-the-hasselblad-x2d-ii-100c",
    "topic": "photo",
    "date": "2025-12-17T15:00:00.000Z"
  },
  {
    "title": "Viltrox is bringing its fast 35mm Lab lens to Nikon users",
    "q": "viltrox is bringing its fast 35mm lab lens to nikon users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Viltrox is bringing its fast 35mm Lab lens to Nikon users</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Viltrox Viltrox has announced that its AF 35mm F1.2 Lab lens, previously released for E-mount, is available for Z-mount cameras. As a result, Nikon users n…<br><a href=\"https://www.dpreview.com/news/8651792565/viltrox-is-bringing-its-fast-35mm-lab-lens-to-nikon-users\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/8651792565/viltrox-is-bringing-its-fast-35mm-lab-lens-to-nikon-users",
    "topic": "photo",
    "date": "2025-12-17T14:00:00.000Z"
  },
  {
    "title": "Ricoh's latest, haziest version of the GR IV is nearly here",
    "q": "ricoh's latest, haziest version of the gr iv is nearly here camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Ricoh's latest, haziest version of the GR IV is nearly here</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Ricoh Ricoh has announced that the GR IV HDF is officially coming in January, slightly later than the \"winter 2025\" date the company gave when it announced…<br><a href=\"https://www.dpreview.com/news/5771354232/ricoh-gr-iv-hdf-highlight-diffusion-filter-coming-jan-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/5771354232/ricoh-gr-iv-hdf-highlight-diffusion-filter-coming-jan-2026",
    "topic": "photo",
    "date": "2025-12-16T22:02:00.000Z"
  },
  {
    "title": "Canon EOS R6 III in-depth review: no need for hype, just deliver",
    "q": "canon eos r6 iii in-depth review: no need for hype, just deliver camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III in-depth review: no need for hype, just deliver</b><br>When you use DPReview links to buy products, the site may earn a commission. Sample gallery This widget is not optimized for RSS feed readers. Please open this article's permalink in a browser to view this content. Product Photos: Mitchell…<br><a href=\"https://www.dpreview.com/reviews/canon-eos-r6-iii-in-depth-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/canon-eos-r6-iii-in-depth-review",
    "topic": "photo",
    "date": "2025-12-16T17:56:00.000Z"
  },
  {
    "title": "Nikon is still adding features to the Z9, four years after launch",
    "q": "nikon is still adding features to the z9, four years after launch camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon is still adding features to the Z9, four years after launch</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Nikon Nikon has announced a new firmware update, 5.30, for the Z9, promising a \"significant improvement\" to the autofocus system's performance when trackin…<br><a href=\"https://www.dpreview.com/news/5858543313/nikon-z9-firmware-5p3-update-features\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/5858543313/nikon-z9-firmware-5p3-update-features",
    "topic": "photo",
    "date": "2025-12-16T04:01:00.000Z"
  },
  {
    "title": "Readers' Choice Awards: Vote now for the best camera of 2025",
    "q": "readers' choice awards: vote now for the best camera of 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Readers' Choice Awards: Vote now for the best camera of 2025</b><br>Readers' Choice: Best camera of 2025 2025 was another exciting year for cameras. In addition to a variety of models that fit into easy-to-define categories, including high-end workhorses, enthusiast mirrorless, and entry-level bodies, we s…<br><a href=\"https://www.dpreview.com/articles/9674088427/vote-for-best-camera-of-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9674088427/vote-for-best-camera-of-2025",
    "topic": "photo",
    "date": "2025-12-15T15:00:00.000Z"
  },
  {
    "title": " Play with prisms to get this psychedelic effect in you portrait photos ",
    "q": " play with prisms to get this psychedelic effect in you portrait photos  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Play with prisms to get this psychedelic effect in you portrait photos </b><br>Use prisms in front of the camera lens to create interesting visual effects in your portraits.<br><a href=\"https://www.digitalcameraworld.com/photography/portrait-photography/play-with-prisms-to-get-this-psychedelic-effect-in-you-portrait-photos\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/portrait-photography/play-with-prisms-to-get-this-psychedelic-effect-in-you-portrait-photos",
    "topic": "photo",
    "date": "2025-12-18T19:49:24.000Z"
  },
  {
    "title": " Hit the streets with your creative camera and try our top tips for city slickers ",
    "q": " hit the streets with your creative camera and try our top tips for city slickers  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Hit the streets with your creative camera and try our top tips for city slickers </b><br>Next time you’re in a big city be sure to try out these fun techniques for creative cityscape shots<br><a href=\"https://www.digitalcameraworld.com/photography/street-photography/ready-hit-the-streets-with-your-creative-camera-and-try-our-top-tips-for-city-slickers\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/street-photography/ready-hit-the-streets-with-your-creative-camera-and-try-our-top-tips-for-city-slickers",
    "topic": "photo",
    "date": "2025-12-18T17:43:49.000Z"
  },
  {
    "title": " Canon EOS 250D drops to best price for ages, but is it really worth buying this DSLR camera in 2025? ",
    "q": " canon eos 250d drops to best price for ages, but is it really worth buying this dslr camera in 2025?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Canon EOS 250D drops to best price for ages, but is it really worth buying this DSLR camera in 2025? </b><br>Canon’s long running entry level DSLR still has a lot going for it… and yes, we have heard of mirrorless cameras, thank you<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/canon-eos-250d-drops-to-best-price-for-ages-but-is-it-really-worth-buying-this-dslr-camera-in-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/canon-eos-250d-drops-to-best-price-for-ages-but-is-it-really-worth-buying-this-dslr-camera-in-2025",
    "topic": "photo",
    "date": "2025-12-18T17:30:51.000Z"
  },
  {
    "title": " Sony A7 V camera is now in stores with flagship-level tech for $2,898 ",
    "q": " sony a7 v camera is now in stores with flagship-level tech for $2,898  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Sony A7 V camera is now in stores with flagship-level tech for $2,898 </b><br>Sony A7 V arrives at B&H and Adorama — A true workhorse for photo and video<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/sony-a7-v-camera-is-now-in-stores-with-flagship-level-tech-for-usd2-898\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/sony-a7-v-camera-is-now-in-stores-with-flagship-level-tech-for-usd2-898",
    "topic": "photo",
    "date": "2025-12-18T16:25:21.000Z"
  },
  {
    "title": " Leica's latest camera firmware brings 240MP photography, faster autofocus and a fresh interface ",
    "q": " leica's latest camera firmware brings 240mp photography, faster autofocus and a fresh interface  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Leica's latest camera firmware brings 240MP photography, faster autofocus and a fresh interface </b><br>Big firmware boost for Leica SL-System and Q3 family arrives before year’s end<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/leica-sl-3-gets-massive-240-megapixel-boost-as-q3-and-sl-cameras-gets-significant-firmware-upgrades\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/leica-sl-3-gets-massive-240-megapixel-boost-as-q3-and-sl-cameras-gets-significant-firmware-upgrades",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": " These three new lenses are oddballs, but they’re outselling traditional optics in Japan as a 25-200mm zoom, 1.4x macro, and an unusually affordable f/1.2 lens top sales charts ",
    "q": " these three new lenses are oddballs, but they’re outselling traditional optics in japan as a 25-200mm zoom, 1.4x macro, and an unusually affordable f/1.2 lens top sales charts  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These three new lenses are oddballs, but they’re outselling traditional optics in Japan as a 25-200mm zoom, 1.4x macro, and an unusually affordable f/1.2 lens top sales charts </b><br>The list of best-selling lenses in Japan is topped by three new lenses that have unusual features<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/these-three-new-lenses-are-oddballs-but-theyre-outselling-traditional-optics-in-japan-as-a-25-200mm-zoom-1-4x-macro-and-an-unusually-affordable-f-1-2-lens-top-sales-charts\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/these-three-new-lenses-are-oddballs-but-theyre-outselling-traditional-optics-in-japan-as-a-25-200mm-zoom-1-4x-macro-and-an-unusually-affordable-f-1-2-lens-top-sales-charts",
    "topic": "photo",
    "date": "2025-12-18T13:47:35.000Z"
  },
  {
    "title": " After going all-in on vertical video, Instagram is now coming to TVs. But as a photographer, I have some serious questions about Instagram’s TV test ",
    "q": " after going all-in on vertical video, instagram is now coming to tvs. but as a photographer, i have some serious questions about instagram’s tv test  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> After going all-in on vertical video, Instagram is now coming to TVs. But as a photographer, I have some serious questions about Instagram’s TV test </b><br>Instagram is testing a new app for Amazon Fire TVs, but what about resolution limitations? And, what about still photos?<br><a href=\"https://www.digitalcameraworld.com/tech/social-media/after-going-all-in-on-vertical-video-instagram-is-now-coming-to-tvs-but-as-a-photographer-i-have-some-serious-questions-about-instagrams-tv-test\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/social-media/after-going-all-in-on-vertical-video-instagram-is-now-coming-to-tvs-but-as-a-photographer-i-have-some-serious-questions-about-instagrams-tv-test",
    "topic": "photo",
    "date": "2025-12-18T13:44:37.000Z"
  },
  {
    "title": " Vote for YOUR camera of the year 2025: from pro-grade behemoths to casual compacts, instant hits and beyond, it's your choice! ",
    "q": " vote for your camera of the year 2025: from pro-grade behemoths to casual compacts, instant hits and beyond, it's your choice!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Vote for YOUR camera of the year 2025: from pro-grade behemoths to casual compacts, instant hits and beyond, it's your choice! </b><br>Got a strong opinion on the best camera of the year? Here’s your chance to have your say in my camera of the year reader poll<br><a href=\"https://www.digitalcameraworld.com/cameras/vote-for-your-camera-of-the-year-2025-from-pro-grade-behemoths-to-casual-compacts-instant-hits-and-beyond-its-your-choice\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/vote-for-your-camera-of-the-year-2025-from-pro-grade-behemoths-to-casual-compacts-instant-hits-and-beyond-its-your-choice",
    "topic": "photo",
    "date": "2025-12-18T13:23:47.000Z"
  },
  {
    "title": " Canon EOS R50 V content creator camera hits new low price of just $569 ",
    "q": " canon eos r50 v content creator camera hits new low price of just $569  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Canon EOS R50 V content creator camera hits new low price of just $569 </b><br>Canon EOS R50 VsSlashed to $569 at Adorama — grab $150 off today<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/canon-eos-r50-v-content-creator-camera-hits-new-low-price-of-just-usd569\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/canon-eos-r50-v-content-creator-camera-hits-new-low-price-of-just-usd569",
    "topic": "photo",
    "date": "2025-12-18T11:15:22.000Z"
  },
  {
    "title": "What Tripod Head is Right For Me?",
    "q": "what tripod head is right for me? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What Tripod Head is Right For Me?</b><br>They're not as glamorous as lenses, but having the right one can make all the difference in the world.<br><a href=\"https://www.slrlounge.com/simple-photography-tips-tripod-head-right/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/simple-photography-tips-tripod-head-right/",
    "topic": "photo",
    "date": "2025-12-18T17:37:40.000Z"
  },
  {
    "title": "B&H Photo’s December Sales Highlight Top Gear and Exclusive Daily Deals",
    "q": "b&h photo’s december sales highlight top gear and exclusive daily deals camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>B&H Photo’s December Sales Highlight Top Gear and Exclusive Daily Deals</b><br>With the holidays in full swing, B&H Photo is offering deep discounts across a range of photography and creator gear. Their ongoing promotions include top-rated lenses, creator bundles, and high-performance accessories, all capped off by t…<br><a href=\"https://www.slrlounge.com/bh-photos-december-sales-daily-deal-zone/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/bh-photos-december-sales-daily-deal-zone/",
    "topic": "photo",
    "date": "2025-12-18T17:35:34.000Z"
  },
  {
    "title": "How Street Photography Helps You Feel at Home in a New City",
    "q": "how street photography helps you feel at home in a new city camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How Street Photography Helps You Feel at Home in a New City</b><br>Moving to a new city throws everything off balance. The streets feel foreign, the rhythms are unfamiliar, and even simple tasks like finding a decent coffee shop require actual effort. It takes time to build the mental map that transforms …<br><a href=\"https://www.slrlounge.com/how-street-photography-helps-you-feel-at-home-in-a-new-city/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-street-photography-helps-you-feel-at-home-in-a-new-city/",
    "topic": "photo",
    "date": "2025-12-18T17:16:19.000Z"
  },
  {
    "title": "Lensrentals Reveals Top Rented Photo & Video Gear of 2025: Canon and Sony Dominate Again",
    "q": "lensrentals reveals top rented photo & video gear of 2025: canon and sony dominate again camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Lensrentals Reveals Top Rented Photo & Video Gear of 2025: Canon and Sony Dominate Again</b><br>Each December, Lensrentals shares a data-driven snapshot of the most popular gear in the industry—offering not just a rental recap, but a temperature check on real-world demand from working professionals. The 2025 edition, released today, …<br><a href=\"https://www.slrlounge.com/lensrentals-reveals-top-rented-photo-video-gear-of-2025-canon-and-sony-dominate-again/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/lensrentals-reveals-top-rented-photo-video-gear-of-2025-canon-and-sony-dominate-again/",
    "topic": "photo",
    "date": "2025-12-17T19:42:21.000Z"
  },
  {
    "title": "Cold Weather Photography Tips | How to Defrost and Save a Frozen Camera",
    "q": "cold weather photography tips | how to defrost and save a frozen camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Cold Weather Photography Tips | How to Defrost and Save a Frozen Camera</b><br>In this first video tutorial, we're going to talk about what to do when you get frost on your camera when you shoot at night in extremely cold weather.<br><a href=\"https://www.slrlounge.com/de-frost-and-save-a-frozen-camera-cold-weather-photography-tips/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/de-frost-and-save-a-frozen-camera-cold-weather-photography-tips/",
    "topic": "photo",
    "date": "2025-12-17T17:30:27.000Z"
  },
  {
    "title": "Upgrade Your Editing Workflow: DxO Holiday Deals with Up to 25% Off (Code: SLRLounge)",
    "q": "upgrade your editing workflow: dxo holiday deals with up to 25% off (code: slrlounge) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Upgrade Your Editing Workflow: DxO Holiday Deals with Up to 25% Off (Code: SLRLounge)</b><br>DxO is closing out the year with one of its best promotions yet. From now through January 6, 2026, photographers can save 20% on their purchase of any two or more DxO software titles and get up to a full year of free DxO Premium Support. T…<br><a href=\"https://www.slrlounge.com/dxo-holiday-deals-slrlounge/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-holiday-deals-slrlounge/",
    "topic": "photo",
    "date": "2025-12-17T16:00:00.000Z"
  },
  {
    "title": "Cake Cutting Photography Tips Ideas and Inspiration",
    "q": "cake cutting photography tips ideas and inspiration camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Cake Cutting Photography Tips Ideas and Inspiration</b><br>The cake cutting ceremony is one of the key moments in a wedding reception that is not without its challenges. From lighting to positioning, the proper techniques and preparation are critical to delivering consistently incredible images fo…<br><a href=\"https://www.slrlounge.com/cake-cutting-photography-tips-ideas-and-inspiration/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/cake-cutting-photography-tips-ideas-and-inspiration/",
    "topic": "photo",
    "date": "2025-12-16T17:16:13.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "Review: NEEWER Z160 Retro Camera Flash",
    "q": "review: neewer z160 retro camera flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: NEEWER Z160 Retro Camera Flash</b><br>THE NEEWER Z160 Retro Camera Flash is a fun, versatile, cool-looking compact and affordable on-camera flash aimed at beginner photographers. It could not be easier to use! It’s also surprisingly useful for a variety of applications. Note: …<br><a href=\"https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/",
    "topic": "photo",
    "date": "2025-12-09T19:00:00.000Z"
  },
  {
    "title": "MagCam Phone Grip & Fill Light Review",
    "q": "magcam phone grip & fill light review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>MagCam Phone Grip & Fill Light Review</b><br>The MagCam Phone Grip by PGYTech is one of those little gadgets that promises to make mobile shooting feel more like handling a real camera, and for the most part, it delivers. It has a smart modular design, a built-in power bank and a han…<br><a href=\"https://photofocus.com/reviews/magcam-phone-grip-fill-light-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/magcam-phone-grip-fill-light-review/",
    "topic": "photo",
    "date": "2025-12-09T12:00:00.000Z"
  },
  {
    "title": "Review: NEEWER DT-ENEL15 Camera Battery Charger for travel",
    "q": "review: neewer dt-enel15 camera battery charger for travel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: NEEWER DT-ENEL15 Camera Battery Charger for travel</b><br>NEEWER sent us the travel-size DT-ENEL15 Camera Battery Charger with two batteries. We took it on the road to see how it fared as a travel charger. Note: NEEWER sent us the NEEWER DT-ENEL15 Camera Battery Charger and Two Batteries (for Nik…<br><a href=\"https://photofocus.com/reviews/review-neewer-dt-enel15-camera-battery-charger-for-travel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-dt-enel15-camera-battery-charger-for-travel/",
    "topic": "photo",
    "date": "2025-12-08T17:00:00.000Z"
  },
  {
    "title": "Editing Christmas Portraits in Aperty | Quick & Easy Portrait Retouching ",
    "q": "editing christmas portraits in aperty | quick & easy portrait retouching  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Editing Christmas Portraits in Aperty | Quick & Easy Portrait Retouching </b><br>Today I’m taking you inside Aperty Portrait, the new portrait retouching software from the makers of Luminar Neo, to show you exactly how I use it for fast, clean and consistent edits. If you’ve ever wanted an easy way to retouch portraits…<br><a href=\"https://photofocus.com/software/editing-christmas-portraits-in-aperty-quick-easy-portrait-retouching/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/editing-christmas-portraits-in-aperty-quick-easy-portrait-retouching/",
    "topic": "photo",
    "date": "2025-12-07T20:00:00.000Z"
  },
  {
    "title": "Clean up Backgrounds and remove distractions in Lightroom and Aperty",
    "q": "clean up backgrounds and remove distractions in lightroom and aperty camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Clean up Backgrounds and remove distractions in Lightroom and Aperty</b><br>Today I am walking you through a full edit of an aerial portrait of Jaslyn using Lightroom Classic and Aperty Portrait from Skylum, showing how to clean up backgrounds, remove distractions, refine lighting with masks, and apply quick profe…<br><a href=\"https://photofocus.com/software/clean-up-backgrounds-and-remove-distractions-in-lightroom-and-aperty/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/clean-up-backgrounds-and-remove-distractions-in-lightroom-and-aperty/",
    "topic": "photo",
    "date": "2025-12-06T22:53:43.000Z"
  },
  {
    "title": "Threads wants to be the app you can’t wait to open in the morning",
    "q": "threads wants to be the app you can’t wait to open in the morning windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Threads wants to be the app you can’t wait to open in the morning</b><br>This is an excerpt of Sources by Alex Heath, a newsletter about AI and the tech industry, syndicated just for The Verge subscribers once a week. By all measures, Meta's Threads app had a very good year. The app was Apple's second-most-down…<br><a href=\"https://www.theverge.com/column/847806/head-of-threads-interview\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/column/847806/head-of-threads-interview",
    "topic": "it",
    "date": "2025-12-18T22:30:00.000Z"
  },
  {
    "title": "OpenAI and Anthropic will start predicting when users are underage",
    "q": "openai and anthropic will start predicting when users are underage windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>OpenAI and Anthropic will start predicting when users are underage</b><br>OpenAI and Anthropic are rolling out new ways to detect underage users. As OpenAI has updated its guidelines on how ChatGPT should interact with users between the ages of 13 and 17, Anthropic is working on a new way to identify and boot us…<br><a href=\"https://www.theverge.com/news/847780/openai-anthropic-teen-safety-chatgpt-claude\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/847780/openai-anthropic-teen-safety-chatgpt-claude",
    "topic": "it",
    "date": "2025-12-18T21:55:59.000Z"
  },
  {
    "title": "The best foldable phone you can buy",
    "q": "the best foldable phone you can buy windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best foldable phone you can buy</b><br>A foldable phone isn’t for the faint of heart. They’re generally heavier, pricier, and have less capable cameras than a standard slab-style phone. They’re also still not as durable as regular smartphones, though they’re not nearly as fragi…<br><a href=\"https://www.theverge.com/tech/635839/best-foldable-phone\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/635839/best-foldable-phone",
    "topic": "it",
    "date": "2025-12-18T21:00:00.000Z"
  },
  {
    "title": "LG forced a Copilot web app onto its TVs but will let you delete it",
    "q": "lg forced a copilot web app onto its tvs but will let you delete it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>LG forced a Copilot web app onto its TVs but will let you delete it</b><br>LG says it will let users delete the Microsoft Copilot shortcut it installed on newer TVs after several reports highlighted the unremovable icon. In a statement to The Verge, LG spokesperson Chris De Maria says the company \"respects consum…<br><a href=\"https://www.theverge.com/news/847685/lg-copilot-web-app-delete\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/847685/lg-copilot-web-app-delete",
    "topic": "it",
    "date": "2025-12-18T20:31:51.000Z"
  },
  {
    "title": " I tried the Apple Music app for ChatGPT, and it felt like talking to a music‑obsessed friend ",
    "q": " i tried the apple music app for chatgpt, and it felt like talking to a music‑obsessed friend  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> I tried the Apple Music app for ChatGPT, and it felt like talking to a music‑obsessed friend </b><br>I tested the newly launched Apple Music app inside ChatGPT and found it to be a surprisingly intuitive way to discover and build playlists.<br><a href=\"https://www.techradar.com/ai-platforms-assistants/chatgpt/i-tried-the-apple-music-app-for-chatgpt-and-it-felt-like-talking-to-a-music-obsessed-friend\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/ai-platforms-assistants/chatgpt/i-tried-the-apple-music-app-for-chatgpt-and-it-felt-like-talking-to-a-music-obsessed-friend",
    "topic": "it",
    "date": "2025-12-18T23:00:00.000Z"
  },
  {
    "title": " Just in time for Christmas, the Apple Watch 11 is up to AU$132 off – a new Aussie low that's better than Black Friday! ",
    "q": " just in time for christmas, the apple watch 11 is up to au$132 off – a new aussie low that's better than black friday!  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Just in time for Christmas, the Apple Watch 11 is up to AU$132 off – a new Aussie low that's better than Black Friday! </b><br>The Apple Watch Series 11 is a fantastic health and fitness addition to pair with your iPhone, offering plenty of insight into your activity levels – it's on sale now at a record-low price starting at just AU$547.<br><a href=\"https://www.techradar.com/health-fitness/smartwatches/just-in-time-for-christmas-the-apple-watch-11-is-up-to-au-aud132-off-a-new-aussie-low-thats-better-than-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/health-fitness/smartwatches/just-in-time-for-christmas-the-apple-watch-11-is-up-to-au-aud132-off-a-new-aussie-low-thats-better-than-black-friday",
    "topic": "it",
    "date": "2025-12-18T22:51:56.000Z"
  },
  {
    "title": " It's about time! Microsoft finally kills off encryption cipher blamed for multiple cyberattacks - RC4 bites the dust at last ",
    "q": " it's about time! microsoft finally kills off encryption cipher blamed for multiple cyberattacks - rc4 bites the dust at last  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> It's about time! Microsoft finally kills off encryption cipher blamed for multiple cyberattacks - RC4 bites the dust at last </b><br>Microsoft moves to disable RC4 after decades of exploitation, implementing AES-SHA1 encryption, tools, and network protections for safer systems.<br><a href=\"https://www.techradar.com/pro/its-about-time-microsoft-finally-kills-off-encryption-cipher-blamed-for-multiple-cyberattacks-rc4-bites-the-dust-at-last\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/its-about-time-microsoft-finally-kills-off-encryption-cipher-blamed-for-multiple-cyberattacks-rc4-bites-the-dust-at-last",
    "topic": "it",
    "date": "2025-12-18T22:35:00.000Z"
  },
  {
    "title": " This new ‘smallest’ subwoofer packs deep bass into a 10-inch cube – 1 driver, 2 radiators, 25Hz, 200W of power ",
    "q": " this new ‘smallest’ subwoofer packs deep bass into a 10-inch cube – 1 driver, 2 radiators, 25hz, 200w of power  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> This new ‘smallest’ subwoofer packs deep bass into a 10-inch cube – 1 driver, 2 radiators, 25Hz, 200W of power </b><br>IK Multimedia's small iLoud Sub promises big booms, but with accuracy<br><a href=\"https://www.techradar.com/audio/this-new-smallest-subwoofer-packs-deep-bass-into-a-10-inch-cube-1-driver-2-radiators-25hz-200w-of-power\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/audio/this-new-smallest-subwoofer-packs-deep-bass-into-a-10-inch-cube-1-driver-2-radiators-25hz-200w-of-power",
    "topic": "it",
    "date": "2025-12-18T22:00:00.000Z"
  },
  {
    "title": "Apple Plans OLED iMac Upgrade, but the Wait Could Be Long",
    "q": "apple plans oled imac upgrade, but the wait could be long windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple Plans OLED iMac Upgrade, but the Wait Could Be Long</b><br>The new display could be 20% brighter than the current iMacs.<br><a href=\"https://www.cnet.com/tech/computing/apple-plans-oled-imac-upgrade-in-2027-2028-brighter-screen/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/computing/apple-plans-oled-imac-upgrade-in-2027-2028-brighter-screen/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-12-18T22:53:00.000Z"
  },
  {
    "title": "Google Introduces New Android Features in Pixel Beta Update",
    "q": "google introduces new android features in pixel beta update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Google Introduces New Android Features in Pixel Beta Update</b><br>Participants in the Android Beta Program get first dibs on the next update, which is set to land in official form next year<br><a href=\"https://www.cnet.com/tech/mobile/google-introduces-new-android-features-in-pixel-beta-update/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/mobile/google-introduces-new-android-features-in-pixel-beta-update/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-12-18T22:40:00.000Z"
  },
  {
    "title": "I Saw the Sequel to The Witness, and Its World-Merging Puzzles Look Masterful",
    "q": "i saw the sequel to the witness, and its world-merging puzzles look masterful windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I Saw the Sequel to The Witness, and Its World-Merging Puzzles Look Masterful</b><br>Order of the Sinking Star serves players plenty of brainteasers, while a background story grapples with what it means to be happy.<br><a href=\"https://www.cnet.com/tech/gaming/i-saw-the-sequel-to-the-witness-and-its-world-merging-puzzles-look-masterful/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/gaming/i-saw-the-sequel-to-the-witness-and-its-world-merging-puzzles-look-masterful/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-12-18T21:47:25.000Z"
  },
  {
    "title": " Critical motherboard flaw allows game cheats, Riot Games blocks 'Valorant' players that don't update BIOS — security patches pushed live by all major motherboard vendors ",
    "q": " critical motherboard flaw allows game cheats, riot games blocks 'valorant' players that don't update bios — security patches pushed live by all major motherboard vendors  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Critical motherboard flaw allows game cheats, Riot Games blocks 'Valorant' players that don't update BIOS — security patches pushed live by all major motherboard vendors </b><br>Riot Games discovered a vulnerability in several motherboards that potentially allowed cheating DMA devices to run before protections kicked in after boot.<br><a href=\"https://www.tomshardware.com/video-games/pc-gaming/critical-motherboard-flaw-allows-game-cheats-riot-games-blocks-valorant-players-that-dont-update-bios-security-patches-pushed-live-by-all-major-motherboard-vendors\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/critical-motherboard-flaw-allows-game-cheats-riot-games-blocks-valorant-players-that-dont-update-bios-security-patches-pushed-live-by-all-major-motherboard-vendors",
    "topic": "it",
    "date": "2025-12-18T21:15:23.000Z"
  },
  {
    "title": " Windows Server 2025 gains native NVMe support, 14 years after its introduction — groundbreaking I/O stack drops SCSI emulation limitations for massive throughput and CPU efficiency gains ",
    "q": " windows server 2025 gains native nvme support, 14 years after its introduction — groundbreaking i/o stack drops scsi emulation limitations for massive throughput and cpu efficiency gains  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows Server 2025 gains native NVMe support, 14 years after its introduction — groundbreaking I/O stack drops SCSI emulation limitations for massive throughput and CPU efficiency gains </b><br>Windows Server 2025 gets native NVMe with massive I/O and CPU gains<br><a href=\"https://www.tomshardware.com/desktops/servers/windows-server-2025-gains-native-nvme-support-14-years-after-its-introduction-groundbreaking-i-o-stack-drops-scsi-emulation-limitations-for-massive-throughput-and-cpu-efficiency-gains\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/desktops/servers/windows-server-2025-gains-native-nvme-support-14-years-after-its-introduction-groundbreaking-i-o-stack-drops-scsi-emulation-limitations-for-massive-throughput-and-cpu-efficiency-gains",
    "topic": "it",
    "date": "2025-12-18T18:13:51.000Z"
  },
  {
    "title": "This simple monitor trick improved my productivity tenfold - and it's free to do",
    "q": "this simple monitor trick improved my productivity tenfold - and it's free to do windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This simple monitor trick improved my productivity tenfold - and it's free to do</b><br>Vertical monitors can streamline workflows in certain situations. Here's how to set one up in Windows 11 using built-in and third-party tools.<br><a href=\"https://www.zdnet.com/article/how-to-rotate-pc-monitor/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/how-to-rotate-pc-monitor/",
    "topic": "it",
    "date": "2025-12-18T22:06:00.000Z"
  },
  {
    "title": "I've used Linux for decades, but I'd switch to FreeBSD for this one feature",
    "q": "i've used linux for decades, but i'd switch to freebsd for this one feature windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I've used Linux for decades, but I'd switch to FreeBSD for this one feature</b><br>FreeBSD isn't Linux, but if you didn't know any better, you'd swear it was.<br><a href=\"https://www.zdnet.com/article/freebsd-will-challenge-your-skills-and-make-you-learn-along-the-way/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/freebsd-will-challenge-your-skills-and-make-you-learn-along-the-way/",
    "topic": "it",
    "date": "2025-12-18T21:27:57.000Z"
  },
  {
    "title": " 2026 will be a huge year for Obsidian fans, as Avowed, Grounded 2, and The Outer Worlds 2 all receive major updates ",
    "q": " 2026 will be a huge year for obsidian fans, as avowed, grounded 2, and the outer worlds 2 all receive major updates  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> 2026 will be a huge year for Obsidian fans, as Avowed, Grounded 2, and The Outer Worlds 2 all receive major updates </b><br>From Avowed’s Anniversary Update to Grounded 2’s evolving roadmap and The Outer Worlds 2 DLC, Obsidian has plenty planned for fans heading into 2026.<br><a href=\"https://www.windowscentral.com/gaming/2026-will-be-a-huge-year-for-obsidian-fans-as-avowed-grounded-2-and-the-outer-worlds-2-all-receive-major-updates\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/2026-will-be-a-huge-year-for-obsidian-fans-as-avowed-grounded-2-and-the-outer-worlds-2-all-receive-major-updates",
    "topic": "it",
    "date": "2025-12-18T22:30:34.000Z"
  },
  {
    "title": " Surprise update breathes new life into Just Cause 3, proving the chaotic sandbox still has tricks up its sleeve ",
    "q": " surprise update breathes new life into just cause 3, proving the chaotic sandbox still has tricks up its sleeve  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Surprise update breathes new life into Just Cause 3, proving the chaotic sandbox still has tricks up its sleeve </b><br>Ten years after release, Just Cause 3 has made a quiet but significant change on PC that could improve performance while disrupting parts of its modding scene.<br><a href=\"https://www.windowscentral.com/gaming/surprise-update-breathes-new-life-into-just-cause-3-proving-the-chaotic-sandbox-still-has-tricks-up-its-sleeve\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/surprise-update-breathes-new-life-into-just-cause-3-proving-the-chaotic-sandbox-still-has-tricks-up-its-sleeve",
    "topic": "it",
    "date": "2025-12-18T21:47:10.000Z"
  },
  {
    "title": " How to play all Fallout games on handhelds like Xbox Ally X — the best settings to maximize performance and battery life ",
    "q": " how to play all fallout games on handhelds like xbox ally x — the best settings to maximize performance and battery life  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> How to play all Fallout games on handhelds like Xbox Ally X — the best settings to maximize performance and battery life </b><br>From Fallout 1 to Fallout 76, this guide breaks down the exact steps, fixes, and settings needed to get every Fallout game running smoothly on Windows handhelds.<br><a href=\"https://www.windowscentral.com/gaming/xbox/how-to-play-fallout-games-on-handhelds-xbox-ally-x-steam-deck\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/how-to-play-fallout-games-on-handhelds-xbox-ally-x-steam-deck",
    "topic": "it",
    "date": "2025-12-18T21:43:46.000Z"
  },
  {
    "title": " Your Android phone can now lock your Windows 11 PC — but it still can't unlock your computer ",
    "q": " your android phone can now lock your windows 11 pc — but it still can't unlock your computer  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Your Android phone can now lock your Windows 11 PC — but it still can't unlock your computer </b><br>Link to Windows now lets Android users lock their Windows 11 PC remotely, track recent activity, and share files both ways.<br><a href=\"https://www.windowscentral.com/microsoft/windows/your-android-phone-can-now-lock-your-windows-11-pc-but-it-still-cant-unlock-your-computer\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows/your-android-phone-can-now-lock-your-windows-11-pc-but-it-still-cant-unlock-your-computer",
    "topic": "it",
    "date": "2025-12-18T21:37:11.000Z"
  },
  {
    "title": "Windows 10 OOB update released to fix Message Queuing (MSMQ) issues",
    "q": "windows 10 oob update released to fix message queuing (msmq) issues windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 10 OOB update released to fix Message Queuing (MSMQ) issues</b><br>This month's extended security update for Windows 11 broke Message Queuing (MSMQ), which is typically used by enterprises to manage background tasks. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/windows-10-oob-update-released-to-fix-message-queuing-msmq-issues/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-10-oob-update-released-to-fix-message-queuing-msmq-issues/",
    "topic": "it",
    "date": "2025-12-19T01:15:19.000Z"
  },
  {
    "title": "Microsoft: Recent Windows updates break RemoteApp connections",
    "q": "microsoft: recent windows updates break remoteapp connections windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Recent Windows updates break RemoteApp connections</b><br>Microsoft has confirmed that recent Windows updates trigger RemoteApp connection failures on Windows 11 24H2/25H2 and Windows Server 2025 devices in Azure Virtual Desktop environments. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-recent-updates-break-azure-virtual-desktop-remoteapp-sessions/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-recent-updates-break-azure-virtual-desktop-remoteapp-sessions/",
    "topic": "it",
    "date": "2025-12-18T10:04:25.000Z"
  },
  {
    "title": "Kodi 21.3 is here to make media playback on Linux and Xbox consoles even better",
    "q": "kodi 21.3 is here to make media playback on linux and xbox consoles even better windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Kodi 21.3 is here to make media playback on Linux and Xbox consoles even better</b><br>It also contains lots of fixes.<br><a href=\"https://www.xda-developers.com/kodi-213-is-here-to-make-media-playback-on-linux-and-xbox-consoles-even-better/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/kodi-213-is-here-to-make-media-playback-on-linux-and-xbox-consoles-even-better/",
    "topic": "it",
    "date": "2025-12-18T22:31:55.000Z"
  },
  {
    "title": "This web-based tool makes ESP32 flashing a breeze",
    "q": "this web-based tool makes esp32 flashing a breeze windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This web-based tool makes ESP32 flashing a breeze</b><br>No drivers, no installation necessary to flash and manage partitions<br><a href=\"https://www.xda-developers.com/this-web-based-tool-makes-esp32-flashing-a-breeze/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/this-web-based-tool-makes-esp32-flashing-a-breeze/",
    "topic": "it",
    "date": "2025-12-18T22:00:21.000Z"
  }
]