[
  {
    "title": "Legendary War Photographer Says His Negatives Have Been Taken From Him",
    "q": "legendary war photographer says his negatives have been taken from him camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Legendary War Photographer Says His Negatives Have Been Taken From Him</b><br>Legendary war photographer Al Rockoff -- who was immortalized in the classic movie The Killing Fields -- has claimed that his historic negatives were taken from him against his will in a bitter dispute. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/legendary-war-photographer-says-his-negatives-have-been-taken-from-him/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/legendary-war-photographer-says-his-negatives-have-been-taken-from-him/",
    "topic": "photo",
    "date": "2025-11-29T19:00:03.000Z"
  },
  {
    "title": "18 Gift Ideas for Photographers for All Budgets",
    "q": "18 gift ideas for photographers for all budgets camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>18 Gift Ideas for Photographers for All Budgets</b><br>The holiday season is not far off, and photographers may be thinking about what they want as a gift. Here are some gift ideas for photographers of all levels of experience and budgets. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/",
    "topic": "photo",
    "date": "2025-11-29T18:00:37.000Z"
  },
  {
    "title": "Camp Snap 8 (CS-8) Review: Pretty But Preposterous",
    "q": "camp snap 8 (cs-8) review: pretty but preposterous camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Camp Snap 8 (CS-8) Review: Pretty But Preposterous</b><br>The original Camp Snap camera was released a while back and became an unexpected hit. This digital camera was extremely limited and lacked an LCD screen in an attempt to bring the fun back to photography. Now Camp Snap is bringing this phi…<br><a href=\"https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/",
    "topic": "photo",
    "date": "2025-11-29T15:01:05.000Z"
  },
  {
    "title": "113 Years Ago, the US Tried to Outlaw Fake Photographs",
    "q": "113 years ago, the us tried to outlaw fake photographs camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>113 Years Ago, the US Tried to Outlaw Fake Photographs</b><br>It’s easy to imagine that anxiety over manipulated images began with Photoshop or AI, but photographers have been wrestling with the problem almost since the birth of the medium. More than a century ago (113 years back to be exact), the U.…<br><a href=\"https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "This New Astrophotography Camera Has a 44MP Full-Frame Sensor",
    "q": "this new astrophotography camera has a 44mp full-frame sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This New Astrophotography Camera Has a 44MP Full-Frame Sensor</b><br>ZWO has announced a new 44-megapixel full-frame camera designed specifically for astrophotography, and its specs are impressive. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/",
    "topic": "photo",
    "date": "2025-11-28T22:03:46.000Z"
  },
  {
    "title": "The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’",
    "q": "the five most shocking claims made by netflix’s ‘the stringer’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’</b><br>Finally the day has come: The Stringer: The Man Who Took the Photo, a film about who really took the famous Napalm Girl photo during the Vietnam War, has dropped on Netflix meaning anyone with a subscription can now see what the fuss is al…<br><a href=\"https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/",
    "topic": "photo",
    "date": "2025-11-28T22:00:20.000Z"
  },
  {
    "title": "Sony Releases Major Firmware Updates for a7R V and a7 IV",
    "q": "sony releases major firmware updates for a7r v and a7 iv camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony Releases Major Firmware Updates for a7R V and a7 IV</b><br>Sony has issued significant new firmware updates for two of its most widely used full-frame mirrorless cameras, bringing the a7R V to Version 4.00 and the a7 IV to Version 6.00. The updates expand focus control options, add new video workf…<br><a href=\"https://petapixel.com/2025/11/28/sony-releases-major-firmware-updates-for-a7r-v-and-a7-iv/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/sony-releases-major-firmware-updates-for-a7r-v-and-a7-iv/",
    "topic": "photo",
    "date": "2025-11-28T19:03:25.000Z"
  },
  {
    "title": "This Free Calculator Figures Out Your Anamorphic Aspect Ratios",
    "q": "this free calculator figures out your anamorphic aspect ratios camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Free Calculator Figures Out Your Anamorphic Aspect Ratios</b><br>Anamorphic lenses are a regular part of many cinematographers' kits, especially as new anamorphic lenses become more affordable and more cameras include more video recording features that help anamorphic optics shine. However, it can be ch…<br><a href=\"https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/",
    "topic": "photo",
    "date": "2025-11-28T18:22:43.000Z"
  },
  {
    "title": "The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now",
    "q": "the 10 best deals on full-frame mirrorless cameras right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now</b><br>We already have a deep-dive article about all the best deals on cameras for Black Friday and Cyber Monday, but some of the deals are so good that they warrant a bit more attention. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/",
    "topic": "photo",
    "date": "2025-11-28T17:31:02.000Z"
  },
  {
    "title": "Do you need to learn Manual mode right away?",
    "q": "do you need to learn manual mode right away? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do you need to learn Manual mode right away?</b><br>Photo: Abby Ferguson If you're a beginner photographer who spends any time on the internet, chances are you've been bombarded with content saying that you need to learn Manual mode immediately. It's a frequent refrain that \"real\" photograp…<br><a href=\"https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": "2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation",
    "q": "2025 royal photographic society awards reveal groundbreaking winners in art, science and innovation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation</b><br>Photos from left to right: Omar Victor Diop, Susan Derges HonFRPS and Jaskirt Dhaliwal-Boora The Royal Photographic Society has announced the recipients of its 2025 Awards. The contest highlights significant contributions across both the a…<br><a href=\"https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation",
    "topic": "photo",
    "date": "2025-11-24T15:55:00.000Z"
  },
  {
    "title": " This ‘Rising Star’ award might change your photographic career (or at least your relationship with broccoli) ",
    "q": " this ‘rising star’ award might change your photographic career (or at least your relationship with broccoli)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This ‘Rising Star’ award might change your photographic career (or at least your relationship with broccoli) </b><br>If you've ever spent half an afternoon coaxing a sprig of coriander to flutter just so, there’s a new award with your name all over it.<br><a href=\"https://www.digitalcameraworld.com/photography/food-photography/this-rising-star-award-might-change-your-photographic-career-or-at-least-your-relationship-with-broccoli\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/food-photography/this-rising-star-award-might-change-your-photographic-career-or-at-least-your-relationship-with-broccoli",
    "topic": "photo",
    "date": "2025-11-30T12:00:00.000Z"
  },
  {
    "title": " Find Your Frame: A Street Photography Masterclass by Craig Whitehead review ",
    "q": " find your frame: a street photography masterclass by craig whitehead review  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Find Your Frame: A Street Photography Masterclass by Craig Whitehead review </b><br>A concise, well-structured book packed with practical advice and clear examples; an ideal starting point for anyone wanting to improve their street photography.<br><a href=\"https://www.digitalcameraworld.com/photography/books/find-your-frame-a-street-photography-masterclass-by-craig-whitehead-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/books/find-your-frame-a-street-photography-masterclass-by-craig-whitehead-review",
    "topic": "photo",
    "date": "2025-11-30T10:00:00.000Z"
  },
  {
    "title": " Kodak didn’t want you to see this and kept this revolutionary camera secret for 25 years ",
    "q": " kodak didn’t want you to see this and kept this revolutionary camera secret for 25 years  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Kodak didn’t want you to see this and kept this revolutionary camera secret for 25 years </b><br>Classic Cameras #13: The 24-year-old engineer who built the first digital camera that weighed eight pounds and ran on 16x AA batteries:<br><a href=\"https://www.digitalcameraworld.com/cameras/digital-cameras/kodak-didnt-want-you-to-see-this-and-kept-this-revolutionary-camera-secret-for-25-years\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/digital-cameras/kodak-didnt-want-you-to-see-this-and-kept-this-revolutionary-camera-secret-for-25-years",
    "topic": "photo",
    "date": "2025-11-30T09:56:22.000Z"
  },
  {
    "title": " I will NEVER sell these 10 cameras from my collection! ",
    "q": " i will never sell these 10 cameras from my collection!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I will NEVER sell these 10 cameras from my collection! </b><br>I just sold $3,000 worth of cameras to free up some space –but these 10 cameras are going to stay on my shelf forever<br><a href=\"https://www.digitalcameraworld.com/cameras/digital-cameras/i-will-never-sell-these-10-cameras-from-my-collection\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/digital-cameras/i-will-never-sell-these-10-cameras-from-my-collection",
    "topic": "photo",
    "date": "2025-11-30T07:18:00.000Z"
  },
  {
    "title": " We love this viral retro compact camera so much, we featured it on our podcast –and now it's cheaper than ever! ",
    "q": " we love this viral retro compact camera so much, we featured it on our podcast –and now it's cheaper than ever!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> We love this viral retro compact camera so much, we featured it on our podcast –and now it's cheaper than ever! </b><br>The Chuzhao TLR retro compact camera has been a hot seller since it came out –and not only is it back in stock, it's at a bargain price<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/we-love-this-viral-retro-compact-camera-so-much-we-featured-it-on-our-podcast-and-now-its-cheaper-than-ever\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/we-love-this-viral-retro-compact-camera-so-much-we-featured-it-on-our-podcast-and-now-its-cheaper-than-ever",
    "topic": "photo",
    "date": "2025-11-30T06:15:44.000Z"
  },
  {
    "title": " This is \"probably the best 70-200mm zoom in the world\" –and now you can save over £900 on it ",
    "q": " this is \"probably the best 70-200mm zoom in the world\" –and now you can save over £900 on it  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This is \"probably the best 70-200mm zoom in the world\" –and now you can save over £900 on it </b><br>The Nikon Z 70-200mm f/2.8 VR S is a top-tier telephoto, known for its steep price tag, but with this deal, you get it for just under £1,700<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/this-is-probably-the-best-70-200mm-zoom-in-the-world-and-now-you-can-save-over-gbp900-on-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/this-is-probably-the-best-70-200mm-zoom-in-the-world-and-now-you-can-save-over-gbp900-on-it",
    "topic": "photo",
    "date": "2025-11-29T16:20:00.000Z"
  },
  {
    "title": " These Canon camera settings are my secret sauce for nailing great photos of weddings ",
    "q": " these canon camera settings are my secret sauce for nailing great photos of weddings  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These Canon camera settings are my secret sauce for nailing great photos of weddings </b><br>Modern mirrorless features make it easier than ever to take top shots of happy couples tying the knot<br><a href=\"https://www.digitalcameraworld.com/photography/wedding-photography/these-canon-camera-settings-are-my-secret-sauce-for-nailing-great-photos-of-weddings\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/wedding-photography/these-canon-camera-settings-are-my-secret-sauce-for-nailing-great-photos-of-weddings",
    "topic": "photo",
    "date": "2025-11-29T15:08:00.000Z"
  },
  {
    "title": " \"Photography has the power to protect remote cultures… and I'm on a mission to use it!\" – Why this photographer captures portraits, and the gear he trusts ",
    "q": " \"photography has the power to protect remote cultures… and i'm on a mission to use it!\" – why this photographer captures portraits, and the gear he trusts  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> \"Photography has the power to protect remote cultures… and I'm on a mission to use it!\" – Why this photographer captures portraits, and the gear he trusts </b><br>Tribal traditions are under threat from globalization, and Terrence Mendoza has sworn to record them before they disappear, working with two full-frame cameras, wide-angle and zoom lenses<br><a href=\"https://www.digitalcameraworld.com/photography/travel-photography/photography-has-the-power-to-protect-remote-cultures-and-im-on-a-mission-to-use-it-why-this-photographer-captures-portraits-and-the-gear-he-trusts\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/travel-photography/photography-has-the-power-to-protect-remote-cultures-and-im-on-a-mission-to-use-it-why-this-photographer-captures-portraits-and-the-gear-he-trusts",
    "topic": "photo",
    "date": "2025-11-29T13:26:00.000Z"
  },
  {
    "title": "Fall Children’s Portrait Photography Tutorial",
    "q": "fall children’s portrait photography tutorial camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fall Children’s Portrait Photography Tutorial</b><br>We're going to create a rich, Autumn-toned portrait, from start to finish.<br><a href=\"https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/",
    "topic": "photo",
    "date": "2025-11-30T06:06:28.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Best Memory Cards for Photographers",
    "q": "best memory cards for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Cards for Photographers</b><br>People tend to focus more on cameras and lenses when discussing camera gear. Those are exciting, fun purchases! However, once a new photographer find themselves out taking photos, the next piece of gear takes center stage, and becomes infi…<br><a href=\"https://www.slrlounge.com/best-memory-cards-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-cards-for-photographers/",
    "topic": "photo",
    "date": "2025-11-26T23:41:26.000Z"
  },
  {
    "title": "TourBox Elite Plus Review | A Versatile New Creative Controller",
    "q": "tourbox elite plus review | a versatile new creative controller camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>TourBox Elite Plus Review | A Versatile New Creative Controller</b><br>Over the last few years, we’ve seen an explosion of various innovations that streamline creative workflows. From photographers and illustrators to video editors and animators, everyone is looking for this combination: speed and precision. …<br><a href=\"https://www.slrlounge.com/tourbox-elite-plus-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tourbox-elite-plus-review/",
    "topic": "photo",
    "date": "2025-11-26T16:00:00.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "The absolute best Cyber Monday deals you can already shop",
    "q": "the absolute best cyber monday deals you can already shop windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The absolute best Cyber Monday deals you can already shop</b><br>Black Friday might officially be over, but that doesn’t mean the deals have simply evaporated. As we turn our attention to Cyber Monday, many of our favorite deals are still holding strong. That means you have another chance to save if you…<br><a href=\"https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025",
    "topic": "it",
    "date": "2025-11-30T12:30:00.000Z"
  },
  {
    "title": "The 201 Black Friday deals you can still get",
    "q": "the 201 black friday deals you can still get windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The 201 Black Friday deals you can still get</b><br>Black Friday is technically a thing of the past, but many of the best deals we told you about yesterday — including deep discounts on the AirPods Pro 3, the Pixel Watch 4, and the latest Kindle Paperwhite — are still kicking for now. In so…<br><a href=\"https://www.theverge.com/gadgets/832641/black-friday-2025-best-deals-tech-gadgets-still-available\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/832641/black-friday-2025-best-deals-tech-gadgets-still-available",
    "topic": "it",
    "date": "2025-11-30T01:30:51.000Z"
  },
  {
    "title": "Anker’s handy little 3-port charger is just 35 bucks",
    "q": "anker’s handy little 3-port charger is just 35 bucks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Anker’s handy little 3-port charger is just 35 bucks</b><br>Is there anything quite like the satisfying snap of folding prongs? Earlier this year, I decided to level up my travel game and invest in a charger to bring on trips, rather than raiding my desk outlets every time I packed. I needed a mult…<br><a href=\"https://www.theverge.com/gadgets/833697/anker-prime-charger-67w-3-port\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833697/anker-prime-charger-67w-3-port",
    "topic": "it",
    "date": "2025-11-29T23:00:00.000Z"
  },
  {
    "title": "The best gaming headset I tried this year is $60 off for Black Friday",
    "q": "the best gaming headset i tried this year is $60 off for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best gaming headset I tried this year is $60 off for Black Friday</b><br>Earlier this year, I reviewed the Fractal Scape, a wireless gaming headset made for PC (also compatible with Switch 2) that really wowed me. Frankly, I wasn’t expecting much in this debut headset from a company known mostly for making PC c…<br><a href=\"https://www.theverge.com/gadgets/829932/wireless-pc-gaming-headset-fractal-scape-deal-sale-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/829932/wireless-pc-gaming-headset-fractal-scape-deal-sale-black-friday",
    "topic": "it",
    "date": "2025-11-29T22:48:25.000Z"
  },
  {
    "title": "I tested 15 cases for the Switch 2 and these are the best",
    "q": "i tested 15 cases for the switch 2 and these are the best windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tested 15 cases for the Switch 2 and these are the best</b><br>Our picks include carrying cases and ones you can leave on during handheld and docked play. | Image: The Verge, Getty Images Editor’s note: Black Friday deals are still happening, so check out the latest and greatest discounts that today h…<br><a href=\"https://www.theverge.com/reviews/691319/best-switch-2-cases\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/reviews/691319/best-switch-2-cases",
    "topic": "it",
    "date": "2025-11-29T21:27:33.000Z"
  },
  {
    "title": "The Fujifilm X Half is on sale for what it should have originally cost",
    "q": "the fujifilm x half is on sale for what it should have originally cost windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Fujifilm X Half is on sale for what it should have originally cost</b><br>Fujifilm knows how to commit to a bit. | Photo: Vjeran Pavic / The Verge Fujifilm’s unusual X Half elicited a lot of feelings from photographers when it came out earlier this year — from “That looks like so much fun,” to “Wait, it costs ho…<br><a href=\"https://www.theverge.com/gadgets/833668/fujifilm-x-half-camera-price-black-friday-cyber-monday\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833668/fujifilm-x-half-camera-price-black-friday-cyber-monday",
    "topic": "it",
    "date": "2025-11-29T21:08:03.000Z"
  },
  {
    "title": "I’ve tested the latest Switch 2 controllers, and this one is the best",
    "q": "i’ve tested the latest switch 2 controllers, and this one is the best windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I’ve tested the latest Switch 2 controllers, and this one is the best</b><br>Editor’s note: Black Friday deals are still happening, so check out the latest and greatest discounts that today has to offer. If you choose to get an extra controller for your Nintendo Switch 2, you can spend a lot — and get a lot in retu…<br><a href=\"https://www.theverge.com/tech/791574/best-switch-2-controllers\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/791574/best-switch-2-controllers",
    "topic": "it",
    "date": "2025-11-29T21:00:53.000Z"
  },
  {
    "title": "Behold, the black Apple Watch Ultra 2 is $200 off during Black Friday",
    "q": "behold, the black apple watch ultra 2 is $200 off during black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Behold, the black Apple Watch Ultra 2 is $200 off during Black Friday</b><br>What time is it? Time to look freaking cool. Last year, I wrote that you do not need a black Apple Watch Ultra 2. It was simply a color refresh, I said. The original Apple Watch Ultra on your wrist was still perfectly fine. The landfills o…<br><a href=\"https://www.theverge.com/gadgets/833432/black-apple-watch-ultra-2-black-friday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833432/black-apple-watch-ultra-2-black-friday-deal-sale",
    "topic": "it",
    "date": "2025-11-29T21:00:00.000Z"
  },
  {
    "title": "I bought this $110 Nespresso rig and it’s been caffeinated bliss ever since",
    "q": "i bought this $110 nespresso rig and it’s been caffeinated bliss ever since windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I bought this $110 Nespresso rig and it’s been caffeinated bliss ever since</b><br>I’m working late, because I’m a writer. Need espresso. | Image: Delonghi Before I went to Italy on vacation, I was fine with instant coffee and my electric kettle. I’m no coffee snob — just get that sweet caffeine into my veins as fast as …<br><a href=\"https://www.theverge.com/gadgets/833482/delonghi-nespresso-vertuo-black-friday-deal\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833482/delonghi-nespresso-vertuo-black-friday-deal",
    "topic": "it",
    "date": "2025-11-29T20:30:00.000Z"
  },
  {
    "title": "The Android phone you should buy your dad is just $349",
    "q": "the android phone you should buy your dad is just $349 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Android phone you should buy your dad is just $349</b><br>The 9A will likely be replaced by a new model this spring, but when has Dad ever cared about keeping up with trends? Not to generalize, but the Google Pixel 9A is a classic dad phone. It’s not fussy. It’s durable and scheduled to get softw…<br><a href=\"https://www.theverge.com/gadgets/833639/google-pixel-9a-black-friday-cyber-monday-2025-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833639/google-pixel-9a-black-friday-cyber-monday-2025-deal-sale",
    "topic": "it",
    "date": "2025-11-29T20:03:51.000Z"
  },
  {
    "title": " The best Cyber Monday MacBook deals – save up to 30% on my favorite MacBook Pro and MacBook Air models ",
    "q": " the best cyber monday macbook deals – save up to 30% on my favorite macbook pro and macbook air models  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The best Cyber Monday MacBook deals – save up to 30% on my favorite MacBook Pro and MacBook Air models </b><br>All the best MacBook Air and MacBook Pro deals, chosen by a diehard Mac fan.<br><a href=\"https://www.techradar.com/computing/macbooks/the-best-cyber-monday-macbook-deals-save-up-to-30-percent-on-my-favorite-macbook-pro-and-macbook-air-models\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/macbooks/the-best-cyber-monday-macbook-deals-save-up-to-30-percent-on-my-favorite-macbook-pro-and-macbook-air-models",
    "topic": "it",
    "date": "2025-11-30T11:26:05.000Z"
  },
  {
    "title": " The 30 best Cyber Monday streaming deals, including Hulu, Prime Video, HBO Max, Apple TV, Paramount+ and more ",
    "q": " the 30 best cyber monday streaming deals, including hulu, prime video, hbo max, apple tv, paramount+ and more  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The 30 best Cyber Monday streaming deals, including Hulu, Prime Video, HBO Max, Apple TV, Paramount+ and more </b><br>I know how steep 2025’s streaming price hikes have been and these Cyber Monday streaming deals can help you stay ahead.<br><a href=\"https://www.techradar.com/live/news/cyber-monday-streaming-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/live/news/cyber-monday-streaming-deals-2025",
    "topic": "it",
    "date": "2025-11-30T10:34:45.000Z"
  },
  {
    "title": " Mindset change is key to nurturing cybersecurity innovation ",
    "q": " mindset change is key to nurturing cybersecurity innovation  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Mindset change is key to nurturing cybersecurity innovation </b><br>Exploring the power of a mindset shift in cybersecurity to harness risk and drive innovation.<br><a href=\"https://www.techradar.com/pro/mindset-change-is-key-to-nurturing-cybersecurity-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/mindset-change-is-key-to-nurturing-cybersecurity-innovation",
    "topic": "it",
    "date": "2025-11-30T10:00:00.000Z"
  },
  {
    "title": " Gaming-first Linux distro delivers a petabyte of ISOs in one month as users avoid forced updates to Windows 11 —  Bazzite distro is another safe haven for Win 10 refugees ",
    "q": " gaming-first linux distro delivers a petabyte of isos in one month as users avoid forced updates to windows 11 —  bazzite distro is another safe haven for win 10 refugees  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Gaming-first Linux distro delivers a petabyte of ISOs in one month as users avoid forced updates to Windows 11 —  Bazzite distro is another safe haven for Win 10 refugees </b><br>Bazzite devs boast of 'over 1 petabyte of Bazzite ISOs' downloaded in last month.<br><a href=\"https://www.tomshardware.com/software/linux/gaming-first-linux-distro-delivers-a-petabyte-of-isos-in-one-month-as-users-avoid-forced-updates-to-windows-11-bazzite-distro-is-another-safe-haven-for-win-10-refugees\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/software/linux/gaming-first-linux-distro-delivers-a-petabyte-of-isos-in-one-month-as-users-avoid-forced-updates-to-windows-11-bazzite-distro-is-another-safe-haven-for-win-10-refugees",
    "topic": "it",
    "date": "2025-11-30T11:30:00.000Z"
  },
  {
    "title": "How much RAM does your PC actually need in 2025? A Windows and Mac expert weighs in",
    "q": "how much ram does your pc actually need in 2025? a windows and mac expert weighs in windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How much RAM does your PC actually need in 2025? A Windows and Mac expert weighs in</b><br>Thinking about upgrading your slow PC? Are you unsure how much RAM you actually need? Here's what this tech reviewer thinks.<br><a href=\"https://www.zdnet.com/article/how-much-ram-does-your-pc-actually-need-in-2025-a-windows-and-mac-expert-weighs-in/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/how-much-ram-does-your-pc-actually-need-in-2025-a-windows-and-mac-expert-weighs-in/",
    "topic": "it",
    "date": "2025-12-01T10:00:00.000Z"
  },
  {
    "title": "We found over 100 Cyber Monday tech deals up to 75% off: Shop Amazon, Best Buy, and more",
    "q": "we found over 100 cyber monday tech deals up to 75% off: shop amazon, best buy, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>We found over 100 Cyber Monday tech deals up to 75% off: Shop Amazon, Best Buy, and more</b><br>Black Friday is over, and Cyber Monday is nearly here. Every major retailer is still offering strong discounts on items from Apple, Samsung, LG, Garmin, and more.<br><a href=\"https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-29/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-29/",
    "topic": "it",
    "date": "2025-11-30T12:27:00.000Z"
  },
  {
    "title": "I'm live-tracking the best Black Friday iPad deals still available: Apple discounts up to 25%",
    "q": "i'm live-tracking the best black friday ipad deals still available: apple discounts up to 25% windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I'm live-tracking the best Black Friday iPad deals still available: Apple discounts up to 25%</b><br>Cyber Monday deals feature some of the best prices you can get on an iPad, iPad Air, iPad Mini, and iPad Pro.<br><a href=\"https://www.zdnet.com/article/black-friday-ipad-deals-amazon-walmart-best-buy-11-29/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-ipad-deals-amazon-walmart-best-buy-11-29/",
    "topic": "it",
    "date": "2025-11-30T12:25:00.000Z"
  },
  {
    "title": "Finally, an Android tablet that I wouldn't mind putting my iPad Pro away for (especially at this price)",
    "q": "finally, an android tablet that i wouldn't mind putting my ipad pro away for (especially at this price) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Finally, an Android tablet that I wouldn't mind putting my iPad Pro away for (especially at this price)</b><br>The OnePlus Pad 3 offers significant improvements over its predecessor, while still being competitively priced against Samsung and Apple.<br><a href=\"https://www.zdnet.com/article/finally-an-android-tablet-that-i-wouldnt-mind-putting-my-ipad-pro-away-for-especially-at-this-price/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/finally-an-android-tablet-that-i-wouldnt-mind-putting-my-ipad-pro-away-for-especially-at-this-price/",
    "topic": "it",
    "date": "2025-11-30T03:35:00.000Z"
  },
  {
    "title": " We've rounded up our favorite games to play on handhelds like Steam Deck and Xbox Ally X — And they're all discounted for Cyber Monday ",
    "q": " we've rounded up our favorite games to play on handhelds like steam deck and xbox ally x — and they're all discounted for cyber monday  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> We've rounded up our favorite games to play on handhelds like Steam Deck and Xbox Ally X — And they're all discounted for Cyber Monday </b><br>Those of us on the Windows Central gaming team came together to list our very favorite games to play on our preferred handheld gaming PCs. Some of us even revealed our favorite handheld accessories. Best of all, most of them are on sale fo…<br><a href=\"https://www.windowscentral.com/hardware/handheld-gaming-pc/best-game-deals-play-on-handheld-gaming-pc-steam-deck-xbox-ally-legion-go\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/handheld-gaming-pc/best-game-deals-play-on-handheld-gaming-pc-steam-deck-xbox-ally-legion-go",
    "topic": "it",
    "date": "2025-11-29T23:27:22.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "Public GitLab repositories exposed more than 17,000 secrets",
    "q": "public gitlab repositories exposed more than 17,000 secrets windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Public GitLab repositories exposed more than 17,000 secrets</b><br>After scanning all 5.6 million public repositories on GitLab Cloud, a security engineer discovered more than 17,000 exposed secrets across over 2,800 unique domains. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/",
    "topic": "it",
    "date": "2025-11-28T17:43:02.000Z"
  },
  {
    "title": "Here's how I encrypt my Windows PC without BitLocker",
    "q": "here's how i encrypt my windows pc without bitlocker windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here's how I encrypt my Windows PC without BitLocker</b><br>You don't need to buy Windows Pro to have secure files.<br><a href=\"https://www.howtogeek.com/encrypt-windows-pc-without-bitlocker/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/encrypt-windows-pc-without-bitlocker/",
    "topic": "it",
    "date": "2025-11-29T23:00:14.000Z"
  },
  {
    "title": "4 New dark patterns added to Windows 11 in 2025",
    "q": "4 new dark patterns added to windows 11 in 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>4 New dark patterns added to Windows 11 in 2025</b><br>In a mirror darkly some patch notes.<br><a href=\"https://www.howtogeek.com/new-dark-patterns-added-to-windows-11-in-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/new-dark-patterns-added-to-windows-11-in-2025/",
    "topic": "it",
    "date": "2025-11-29T23:00:14.000Z"
  },
  {
    "title": "Don't set up Linux from scratch, these Turnkey distros do it for you",
    "q": "don't set up linux from scratch, these turnkey distros do it for you windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Don't set up Linux from scratch, these Turnkey distros do it for you</b><br>You don't need to set up Linux manually every time.<br><a href=\"https://www.howtogeek.com/turnkey-distros-set-up-linux-for-you/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/turnkey-distros-set-up-linux-for-you/",
    "topic": "it",
    "date": "2025-11-29T21:30:14.000Z"
  },
  {
    "title": "Windows 11's newest bug just made signing in so much harder",
    "q": "windows 11's newest bug just made signing in so much harder windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11's newest bug just made signing in so much harder</b><br>The password icon is there... you just can't see it.<br><a href=\"https://www.howtogeek.com/windows-11s-newest-bug-just-made-signing-in-so-much-harder/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/windows-11s-newest-bug-just-made-signing-in-so-much-harder/",
    "topic": "it",
    "date": "2025-11-29T21:25:09.000Z"
  },
  {
    "title": "I tried an obscure method for running Windows 11 on the Raspberry Pi – it worked really well",
    "q": "i tried an obscure method for running windows 11 on the raspberry pi – it worked really well windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tried an obscure method for running Windows 11 on the Raspberry Pi – it worked really well</b><br>Botspot VM is surprisingly great for virtualizing Windows 11 on a Raspberry Pi<br><a href=\"https://www.xda-developers.com/an-obscure-method-for-running-windows-11-on-raspberry-pi/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/an-obscure-method-for-running-windows-11-on-raspberry-pi/",
    "topic": "it",
    "date": "2025-11-30T11:00:17.000Z"
  },
  {
    "title": "EndeavourOS’s latest update makes Nvidia gaming on Linux much easier to set up",
    "q": "endeavouros’s latest update makes nvidia gaming on linux much easier to set up windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>EndeavourOS’s latest update makes Nvidia gaming on Linux much easier to set up</b><br>No more messing around with drivers.<br><a href=\"https://www.xda-developers.com/endeavouross-latest-update-makes-nvidia-gaming-linux-easier-set-up/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/endeavouross-latest-update-makes-nvidia-gaming-linux-easier-set-up/",
    "topic": "it",
    "date": "2025-11-30T07:00:36.000Z"
  },
  {
    "title": "A Windows 11 bug is hiding your password sign-in button, and you have to hunt for it",
    "q": "a windows 11 bug is hiding your password sign-in button, and you have to hunt for it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>A Windows 11 bug is hiding your password sign-in button, and you have to hunt for it</b><br>How good are you at hide-and-seek?<br><a href=\"https://www.xda-developers.com/windows-11-bug-hiding-your-password-sign-in-button/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-11-bug-hiding-your-password-sign-in-button/",
    "topic": "it",
    "date": "2025-11-30T06:21:31.000Z"
  }
]