[
  {
    "title": "Larry the Cat Trips Up Polish President’s Photographer",
    "q": "larry the cat trips up polish president’s photographer camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Larry the Cat Trips Up Polish President’s Photographer</b><br>Larry the Cat, Chief Mouser to the Cabinet Office at the British Prime Minister's office, tripped up a photographer as he attempted to exit Number 10 Downing Street on Tuesday. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/larry-the-cat-trips-up-polish-presidents-photographer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/larry-the-cat-trips-up-polish-presidents-photographer/",
    "topic": "photo",
    "date": "2026-01-15T18:20:49.000Z"
  },
  {
    "title": "Chris Really Likes the Instax Mini Evo Cinema | The PetaPixel Podcast",
    "q": "chris really likes the instax mini evo cinema | the petapixel podcast camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Chris Really Likes the Instax Mini Evo Cinema | The PetaPixel Podcast</b><br>This week on The PetaPixel Podcast, Chris Niccolls, Jordan Drake, and Jaron Schneider are joined by Sarah Teng to talk about the Instax Mini Evo Cinema. And, in a weird bizzaro world twist, it's Chris who has to convince Sarah that it's gr…<br><a href=\"https://petapixel.com/2026/01/15/chris-really-likes-the-instax-mini-evo-cinema-the-petapixel-podcast/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/chris-really-likes-the-instax-mini-evo-cinema-the-petapixel-podcast/",
    "topic": "photo",
    "date": "2026-01-15T18:01:26.000Z"
  },
  {
    "title": "Await Digital Camera Uses ‘Film Rolls’ and Delivers 4 x 6 Prints",
    "q": "await digital camera uses ‘film rolls’ and delivers 4 x 6 prints camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Await Digital Camera Uses ‘Film Rolls’ and Delivers 4 x 6 Prints</b><br>For a company that’s made its name in high-end cables, chargers, and Bluetooth trackers, Rolling Square isn’t known for making cameras. First teased at IFA 2025 in Berlin, the Swiss brand unveiled its Await Camera at CES 2026 in Las Vegas …<br><a href=\"https://petapixel.com/2026/01/15/await-digital-camera-uses-film-rolls-and-delivers-4-x-6-prints/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/await-digital-camera-uses-film-rolls-and-delivers-4-x-6-prints/",
    "topic": "photo",
    "date": "2026-01-15T17:19:55.000Z"
  },
  {
    "title": "Evoto Alienated Photographers By Releasing a Tool Designed to Replace Them",
    "q": "evoto alienated photographers by releasing a tool designed to replace them camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Evoto Alienated Photographers By Releasing a Tool Designed to Replace Them</b><br>Evoto has had a tough week. While the AI photo editing software company was on hand at Imaging USA … [Read More]<br><a href=\"https://petapixel.com/2026/01/15/evoto-alienated-photographers-by-releasing-a-tool-designed-to-replace-them/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/evoto-alienated-photographers-by-releasing-a-tool-designed-to-replace-them/",
    "topic": "photo",
    "date": "2026-01-15T16:06:19.000Z"
  },
  {
    "title": "Thypoch’s New Ksana 21mm f/3.5 Lens Channels the Spirit of 1970s Cinema",
    "q": "thypoch’s new ksana 21mm f/3.5 lens channels the spirit of 1970s cinema camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Thypoch’s New Ksana 21mm f/3.5 Lens Channels the Spirit of 1970s Cinema</b><br>In trademark Thypoch style, the company's new Ksana 21mm f/3.5 M-Mount lens promises to channel a vintage spirit and deliver photos rich with character and warmth. The new lens promises the classic imaging of beloved 1970s-era lenses. [Rea…<br><a href=\"https://petapixel.com/2026/01/15/thypochs-new-ksana-21mm-f-3-5-lens-channels-the-spirit-of-1970s-cinema/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/thypochs-new-ksana-21mm-f-3-5-lens-channels-the-spirit-of-1970s-cinema/",
    "topic": "photo",
    "date": "2026-01-15T15:19:22.000Z"
  },
  {
    "title": "Sports Photographer Accused of Scamming Clients, Over 130 Complaints Filed",
    "q": "sports photographer accused of scamming clients, over 130 complaints filed camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sports Photographer Accused of Scamming Clients, Over 130 Complaints Filed</b><br>A sports photographer has been accused of scamming people out of their money and photographs across the U.S., prompting a growing law enforcement investigation. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/sports-photographer-accused-of-scamming-clients-over-130-complaints-filed/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/sports-photographer-accused-of-scamming-clients-over-130-complaints-filed/",
    "topic": "photo",
    "date": "2026-01-15T15:03:19.000Z"
  },
  {
    "title": "Photographer Recreates Iconic Shot of E.T. Crossing the Moon",
    "q": "photographer recreates iconic shot of e.t. crossing the moon camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Recreates Iconic Shot of E.T. Crossing the Moon</b><br>A photo of E.T. the Extra-Terrestrial crossing the horizon silhouetted against the Moon was two years in the making, Michael Meighan tells PetaPixel. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/photographer-recreates-iconic-shot-of-e-t-crossing-the-moon/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/photographer-recreates-iconic-shot-of-e-t-crossing-the-moon/",
    "topic": "photo",
    "date": "2026-01-15T12:48:18.000Z"
  },
  {
    "title": "Sports Photography at its Finest: Winners of 2026 World Awards",
    "q": "sports photography at its finest: winners of 2026 world awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sports Photography at its Finest: Winners of 2026 World Awards</b><br>A shadow image of Spain’s Carlos Alcaraz’s racket perfectly hitting the ball has taken the top prize at The World Sports Photography Awards 2026. [Read More]<br><a href=\"https://petapixel.com/2026/01/15/world-sports-photography-awards-winners-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/15/world-sports-photography-awards-winners-2026/",
    "topic": "photo",
    "date": "2026-01-15T10:47:49.000Z"
  },
  {
    "title": "Ricoh GR IV Monochrome Review: Black and White Comes at a Premium",
    "q": "ricoh gr iv monochrome review: black and white comes at a premium camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Ricoh GR IV Monochrome Review: Black and White Comes at a Premium</b><br>Why buy a dedicated monochromatic camera when a regular camera can take black and white photos? It's more expensive, far less versatile, and made for a very small market of users. That's the question I hear a lot, and I get it. But I would…<br><a href=\"https://petapixel.com/2026/01/14/ricoh-gr-iv-monochrome-review-black-and-white-comes-at-a-premium/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/14/ricoh-gr-iv-monochrome-review-black-and-white-comes-at-a-premium/",
    "topic": "photo",
    "date": "2026-01-14T22:01:17.000Z"
  },
  {
    "title": "The Ricoh GR IV Monochrome Will Cost an Extra $700",
    "q": "the ricoh gr iv monochrome will cost an extra $700 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Ricoh GR IV Monochrome Will Cost an Extra $700</b><br>Ricoh has finally announced pricing for the GR IV Monochrome -- a camera it officially revealed last October -- and it's steep: $2,199.95. That's $700 more than the base model, which represents a 46% price increase. [Read More]<br><a href=\"https://petapixel.com/2026/01/14/the-ricoh-gr-iv-monochrome-will-cost-an-extra-700/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/14/the-ricoh-gr-iv-monochrome-will-cost-an-extra-700/",
    "topic": "photo",
    "date": "2026-01-14T22:00:41.000Z"
  },
  {
    "title": "Sony a7 V video studio scene: what do you really need?",
    "q": "sony a7 v video studio scene: what do you really need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony a7 V video studio scene: what do you really need?</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We've taken a look at how the Sony a7 V performs when it comes to stills, now it's time to turn our attention to video. The company's latest…<br><a href=\"https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene",
    "topic": "photo",
    "date": "2026-01-15T14:00:00.000Z"
  },
  {
    "title": "Breaking Leica's monopoly: Ricoh releases GR IV Mono",
    "q": "breaking leica's monopoly: ricoh releases gr iv mono camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Breaking Leica's monopoly: Ricoh releases GR IV Mono</b><br>When you use DPReview links to buy products, the site may earn a commission. Sample gallery This widget is not optimized for RSS feed readers. Please open this article's permalink in a browser to view this content. Product photos: Richard …<br><a href=\"https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch",
    "topic": "photo",
    "date": "2026-01-14T22:00:00.000Z"
  },
  {
    "title": "Question of the week: What projects are you undertaking to move your photography forward?",
    "q": "question of the week: what projects are you undertaking to move your photography forward? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What projects are you undertaking to move your photography forward?</b><br>All photographers inevitably deal with creative droughts or periods when they feel their skills have plateaued. At the end of last year, I wrote about part of why (and how) that's manifested for me over the past few years. For me, one comm…<br><a href=\"https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/",
    "topic": "photo",
    "date": "2026-01-14T15:50:00.000Z"
  },
  {
    "title": "Fujifilm fully raises the curtain on the cinematic Instax",
    "q": "fujifilm fully raises the curtain on the cinematic instax camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm fully raises the curtain on the cinematic Instax</b><br>Image: Fujifilm Last week, Fujifilm Japan launched a surprising and rather controversial new offering in its Instax lineup, the Instax Mini Evo Cinema. The company has now announced the global release of the hybrid camera, providing more d…<br><a href=\"https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": "Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor",
    "q": "eric fossum earns the prestigious draper prize for pioneering the cmos image sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor</b><br>Image: Draper Eric Fossum, the inventor of the modern CMOS image sensor and a longtime friend of DPReview, was recently awarded the 2026 Charles Stark Draper Prize for Engineering. The award, which is granted every two years by the Nationa…<br><a href=\"https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor",
    "topic": "photo",
    "date": "2026-01-13T20:10:00.000Z"
  },
  {
    "title": "Apple’s new Creative Cloud competitor lets you edit photos, music and video",
    "q": "apple’s new creative cloud competitor lets you edit photos, music and video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple’s new Creative Cloud competitor lets you edit photos, music and video</b><br>Image: Apple Apple has announced a new app bundle for creatives dubbed Apple Creator Studio. The subscription serves as somewhat of an alternative to Adobe's Creative Cloud, as it includes apps for photo, video and music editing, plus Appl…<br><a href=\"https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video",
    "topic": "photo",
    "date": "2026-01-13T18:31:00.000Z"
  },
  {
    "title": "Will SD cards remain forever stuck in the past?",
    "q": "will sd cards remain forever stuck in the past? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Will SD cards remain forever stuck in the past?</b><br>With no sign of faster SD cards, the CFexpress format is currently coming out on top. Photo: Richard Butler This year's CES trade show came and went with no apparent progress for the SD memory card format, despite higher speeds and capacit…<br><a href=\"https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past",
    "topic": "photo",
    "date": "2026-01-13T15:00:00.000Z"
  },
  {
    "title": "Portrait of Britain: Celebrating the faces that define a nation",
    "q": "portrait of britain: celebrating the faces that define a nation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Portrait of Britain: Celebrating the faces that define a nation</b><br>Portrait of Britain Vol. 8 Winners The British Journal of Photography has announced the winners of Portrait of Britain Vol. 8. The contest, which began in 2016, aims to celebrate the diverse mosaic of individuals who make up Great Britain …<br><a href=\"https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation",
    "topic": "photo",
    "date": "2026-01-12T21:48:00.000Z"
  },
  {
    "title": "DPReview Reader's Choice Awards 2025: Product of the Year",
    "q": "dpreview reader's choice awards 2025: product of the year camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Reader's Choice Awards 2025: Product of the Year</b><br>When you use DPReview links to buy products, the site may earn a commission. Product of the Year 2025: the results The final round of voting has closed, and it's time to reveal the winners of our 2025 Readers' Choice Awards! Beginning in D…<br><a href=\"https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Finding your way out of a creative drought with photo projects",
    "q": "finding your way out of a creative drought with photo projects camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Finding your way out of a creative drought with photo projects</b><br>An image from my third 365 project, taken in 2012. Photo: Abby Ferguson Every photographer inevitably goes through periods where they hit a wall. That wall can come from all kinds of things, including a lack of inspiration, growth stagnati…<br><a href=\"https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects",
    "topic": "photo",
    "date": "2026-01-11T15:00:00.000Z"
  },
  {
    "title": " Fujifilm’s new Instax Mini Evo Cinema takes inspiration from classic 1960s Fuji Single-8 cine cameras that were actually superior to Kodak Super 8 ",
    "q": " fujifilm’s new instax mini evo cinema takes inspiration from classic 1960s fuji single-8 cine cameras that were actually superior to kodak super 8  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Fujifilm’s new Instax Mini Evo Cinema takes inspiration from classic 1960s Fuji Single-8 cine cameras that were actually superior to Kodak Super 8 </b><br>The story behind the vintage tech that inspired Fujifilm's weird new Instax Mini Evo Cinema camera<br><a href=\"https://www.digitalcameraworld.com/cameras/film-cameras/fujifilms-new-instax-mini-evo-cinema-takes-inspiration-from-classic-1960s-fuji-single-8-cine-cameras-that-were-actually-superior-to-kodak-super-8\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/film-cameras/fujifilms-new-instax-mini-evo-cinema-takes-inspiration-from-classic-1960s-fuji-single-8-cine-cameras-that-were-actually-superior-to-kodak-super-8",
    "topic": "photo",
    "date": "2026-01-15T16:59:31.000Z"
  },
  {
    "title": " The Galaxy S26 Ultra may get subtle hardware upgrades for its main and telephoto cameras ",
    "q": " the galaxy s26 ultra may get subtle hardware upgrades for its main and telephoto cameras  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Galaxy S26 Ultra may get subtle hardware upgrades for its main and telephoto cameras </b><br>Samsung's next flagship phone is expected to inherit most of its camera hardware from the S25 Ultra, but image quality might still be boosted<br><a href=\"https://www.digitalcameraworld.com/tech/phones/the-galaxy-s26-ultra-may-get-subtle-hardware-upgrades-for-its-main-and-telephoto-cameras\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/phones/the-galaxy-s26-ultra-may-get-subtle-hardware-upgrades-for-its-main-and-telephoto-cameras",
    "topic": "photo",
    "date": "2026-01-15T15:04:07.000Z"
  },
  {
    "title": " The Olympus E-M10 Mark IV is the last Olympus camera standing. But how long will the cheap compact mirrorless stick around for? ",
    "q": " the olympus e-m10 mark iv is the last olympus camera standing. but how long will the cheap compact mirrorless stick around for?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Olympus E-M10 Mark IV is the last Olympus camera standing. But how long will the cheap compact mirrorless stick around for? </b><br>Despite being discontinued in Japan, OM System says the E-M10 Mark IV will remain available as a budget compact mirrorless in the US<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-olympus-e-m10-mark-iv-is-the-last-olympus-camera-standing-but-how-long-will-the-cheap-compact-mirrorless-stick-around-for\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-olympus-e-m10-mark-iv-is-the-last-olympus-camera-standing-but-how-long-will-the-cheap-compact-mirrorless-stick-around-for",
    "topic": "photo",
    "date": "2026-01-15T13:26:14.000Z"
  },
  {
    "title": " Ricoh GR IV Monochrome compact camera goes all in on black and white with a built-in red filter for stormy skies ",
    "q": " ricoh gr iv monochrome compact camera goes all in on black and white with a built-in red filter for stormy skies  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Ricoh GR IV Monochrome compact camera goes all in on black and white with a built-in red filter for stormy skies </b><br>The Ricoh GR IV Monochrome is a love letter to pure black-and-white photography<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/ricoh-gr-iv-monochrome-compact-camera-goes-all-in-on-black-and-white-with-a-built-in-red-filter-for-stormy-skies\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/ricoh-gr-iv-monochrome-compact-camera-goes-all-in-on-black-and-white-with-a-built-in-red-filter-for-stormy-skies",
    "topic": "photo",
    "date": "2026-01-15T08:31:31.000Z"
  },
  {
    "title": " Finally #1! Released back in 2023, this beginner-friendly mirrorless is Japan’s best-selling camera in 2025 ",
    "q": " finally #1! released back in 2023, this beginner-friendly mirrorless is japan’s best-selling camera in 2025  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Finally #1! Released back in 2023, this beginner-friendly mirrorless is Japan’s best-selling camera in 2025 </b><br>This camera climbed from third to first in three years: It's compact, beginner-friendly, will teach you photography, and is available for under US$800<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/finally-1-released-back-in-2023-this-beginner-friendly-mirrorless-is-japans-best-selling-camera-in-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/finally-1-released-back-in-2023-this-beginner-friendly-mirrorless-is-japans-best-selling-camera-in-2025",
    "topic": "photo",
    "date": "2026-01-15T08:10:35.000Z"
  },
  {
    "title": " OK, I’ll admit it… I’ve used black and white to cover up a bad photo before! ",
    "q": " ok, i’ll admit it… i’ve used black and white to cover up a bad photo before!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> OK, I’ll admit it… I’ve used black and white to cover up a bad photo before! </b><br>I've used B&W as a crutch before and I'd bet we probably all have, too!<br><a href=\"https://www.digitalcameraworld.com/photography/photo-editing/ok-ill-admit-it-ive-used-black-and-white-to-cover-up-a-bad-photo-before\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photo-editing/ok-ill-admit-it-ive-used-black-and-white-to-cover-up-a-bad-photo-before",
    "topic": "photo",
    "date": "2026-01-15T07:42:56.000Z"
  },
  {
    "title": " This colorful new Kodak compact camera is a low-tech digicam with instant prints – and a US$80 / £80 price ",
    "q": " this colorful new kodak compact camera is a low-tech digicam with instant prints – and a us$80 / £80 price  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This colorful new Kodak compact camera is a low-tech digicam with instant prints – and a US$80 / £80 price </b><br>The Kodak Printomatic+ is a screenless digital camera that prints out images on ZINK paper<br><a href=\"https://www.digitalcameraworld.com/cameras/instant-cameras/this-colorful-new-kodak-compact-camera-is-a-low-tech-digital-compact-camera-with-instant-prints-and-a-us-usd80-gbp80-price\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/this-colorful-new-kodak-compact-camera-is-a-low-tech-digital-compact-camera-with-instant-prints-and-a-us-usd80-gbp80-price",
    "topic": "photo",
    "date": "2026-01-14T14:59:18.000Z"
  },
  {
    "title": " This oddly-shaped lens filter creates motion blur without the need for a slow shutter speed for a mix of sharpness and motion ",
    "q": " this oddly-shaped lens filter creates motion blur without the need for a slow shutter speed for a mix of sharpness and motion  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This oddly-shaped lens filter creates motion blur without the need for a slow shutter speed for a mix of sharpness and motion </b><br>The PolarPro CineFlow Motion filter creates a mix of motion-like blur and sharp subjects in-camera<br><a href=\"https://www.digitalcameraworld.com/cameras/lens-filters/this-oddly-shaped-lens-filter-creates-motion-blur-without-the-need-for-a-slow-shutter-speed-for-a-mix-of-sharpness-and-motion\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lens-filters/this-oddly-shaped-lens-filter-creates-motion-blur-without-the-need-for-a-slow-shutter-speed-for-a-mix-of-sharpness-and-motion",
    "topic": "photo",
    "date": "2026-01-14T14:00:34.000Z"
  },
  {
    "title": " Nikon’s underrated f/2.8 telephoto zoom just hit its lowest price ever ",
    "q": " nikon’s underrated f/2.8 telephoto zoom just hit its lowest price ever  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Nikon’s underrated f/2.8 telephoto zoom just hit its lowest price ever </b><br>Don’t sleep on this deal: Nikon’s 70–180mm f/2.8 hits a new low<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/nikons-underrated-f-2-8-telephoto-zoom-just-hit-its-lowest-price-ever\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/nikons-underrated-f-2-8-telephoto-zoom-just-hit-its-lowest-price-ever",
    "topic": "photo",
    "date": "2026-01-14T13:55:54.000Z"
  },
  {
    "title": "3 Ways To Photograph Family Group Photos With Flash",
    "q": "3 ways to photograph family group photos with flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>3 Ways To Photograph Family Group Photos With Flash</b><br>Here are three ways to change the way you photography family formals.<br><a href=\"https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/",
    "topic": "photo",
    "date": "2026-01-14T19:59:28.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Photographer Insurance Guide",
    "q": "photographer insurance guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Insurance Guide</b><br>Let’s face it, photography is not a cheap venture to get into. Regardless of whether you’re a professional or a hobbyist, buying and keeping your gear up-to-date can be very expensive. Because of this, it’s incredibly important to keep you…<br><a href=\"https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/",
    "topic": "photo",
    "date": "2026-01-09T06:37:32.000Z"
  },
  {
    "title": "15 Tips for Teaching Photography Workshops",
    "q": "15 tips for teaching photography workshops camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>15 Tips for Teaching Photography Workshops</b><br>Hosting a photography workshop may not be the easiest way to earn additional income, but it can prove rewarding when done right. Should you choose to teach one, follow these 15 tips to help ensure that your workshop is a success!<br><a href=\"https://www.slrlounge.com/tips-for-a-photography-workshop/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tips-for-a-photography-workshop/",
    "topic": "photo",
    "date": "2026-01-08T06:35:30.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "Here are the best AirPods deals you can get right now",
    "q": "here are the best airpods deals you can get right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here are the best AirPods deals you can get right now</b><br>The latest AirPods Pro have received a modest discount. | Photo: Chris Welch / The Verge If you know where to look, you can often score deals on Apple’s ever-expanding AirPods lineup. Both the AirPods Max and AirPods 4 (with and without AN…<br><a href=\"https://www.theverge.com/21302051/best-apple-airpods-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21302051/best-apple-airpods-deals",
    "topic": "it",
    "date": "2026-01-15T18:14:25.000Z"
  },
  {
    "title": "I’ve tested the latest Switch 2 controllers, and this one is the best",
    "q": "i’ve tested the latest switch 2 controllers, and this one is the best windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I’ve tested the latest Switch 2 controllers, and this one is the best</b><br>If you choose to get an extra controller for your Nintendo Switch 2, you can spend a lot — and get a lot in return. Buying Nintendo’s own $89 Switch 2 Pro Controller, for instance, will net you the console’s only wireless controller with a…<br><a href=\"https://www.theverge.com/tech/791574/best-switch-2-controllers\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/791574/best-switch-2-controllers",
    "topic": "it",
    "date": "2026-01-15T17:51:34.000Z"
  },
  {
    "title": "Microsoft is closing its employee library and cutting back on subscriptions",
    "q": "microsoft is closing its employee library and cutting back on subscriptions windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft is closing its employee library and cutting back on subscriptions</b><br>Microsoft’s headquarters in Redmond, Washington. | Image: Getty Images Microsoft's library of books is so heavy that it once caused a campus building to sink, according to an unproven legend among employees. Now those physical books, journ…<br><a href=\"https://www.theverge.com/tech/862531/microsoft-library-closure-transition-changes-notepad\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/862531/microsoft-library-closure-transition-changes-notepad",
    "topic": "it",
    "date": "2026-01-15T17:00:00.000Z"
  },
  {
    "title": "The best Fitbits for your fitness and health",
    "q": "the best fitbits for your fitness and health windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Fitbits for your fitness and health</b><br>Despite being acquired by Google five years ago, Fitbit remains one of the most recognizable names in the industry. While its products aren’t designed with hardcore athletes, Fitbit makes excellent devices for tracking overall activity as …<br><a href=\"https://www.theverge.com/22982833/best-fitbit-watch-fitness-tracker\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22982833/best-fitbit-watch-fitness-tracker",
    "topic": "it",
    "date": "2026-01-15T16:55:12.000Z"
  },
  {
    "title": " The hidden iPhone setting that instantly turns your phone into a sleep machine ",
    "q": " the hidden iphone setting that instantly turns your phone into a sleep machine  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The hidden iPhone setting that instantly turns your phone into a sleep machine </b><br>The iPhone has a hidden sound library that not enough people know about. Here's how you can use it to help sleep better and work more efficiently.<br><a href=\"https://www.techradar.com/phones/iphone/the-hidden-iphone-setting-that-instantly-turns-your-phone-into-a-sleep-machine\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/phones/iphone/the-hidden-iphone-setting-that-instantly-turns-your-phone-into-a-sleep-machine",
    "topic": "it",
    "date": "2026-01-15T18:00:00.000Z"
  },
  {
    "title": " Square Enix confirms a new Final Fantasy 7 Remake Intergrade update for PS5 and PC will arrive alongside the Nintendo Switch 2 and Xbox versions ",
    "q": " square enix confirms a new final fantasy 7 remake intergrade update for ps5 and pc will arrive alongside the nintendo switch 2 and xbox versions  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Square Enix confirms a new Final Fantasy 7 Remake Intergrade update for PS5 and PC will arrive alongside the Nintendo Switch 2 and Xbox versions </b><br>Final Fantasy 7 Remake Intergrade is set to receive a free PS5 and PC update that will add Streamline Progression, the same day the Nintendo Switch 2 and Xbox editions release.<br><a href=\"https://www.techradar.com/gaming/square-enix-confirms-a-new-final-fantasy-7-remake-intergrade-update-for-ps5-and-pc-will-arrive-alongside-the-nintendo-switch-2-and-xbox-versions\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/gaming/square-enix-confirms-a-new-final-fantasy-7-remake-intergrade-update-for-ps5-and-pc-will-arrive-alongside-the-nintendo-switch-2-and-xbox-versions",
    "topic": "it",
    "date": "2026-01-15T17:08:03.000Z"
  },
  {
    "title": "Verizon Will Give $20 Credit You'll Need to Claim Following Major Outage (Live Updates)",
    "q": "verizon will give $20 credit you'll need to claim following major outage (live updates) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Verizon Will Give $20 Credit You'll Need to Claim Following Major Outage (Live Updates)</b><br>The hours-long outage affected 2 million customers, and the carrier will offer credits to anyone affected.<br><a href=\"https://www.cnet.com/news-live/verizon-outage-january-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/news-live/verizon-outage-january-2026/",
    "topic": "it",
    "date": "2026-01-15T16:46:00.000Z"
  },
  {
    "title": "As a Fitness Expert, These Are the Best Rowing Machines I’ve Tested",
    "q": "as a fitness expert, these are the best rowing machines i’ve tested windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>As a Fitness Expert, These Are the Best Rowing Machines I’ve Tested</b><br>These machines make it easy to get a full-body workout at home.<br><a href=\"https://www.cnet.com/health/fitness/best-rowing-machine/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/health/fitness/best-rowing-machine/",
    "topic": "it",
    "date": "2026-01-15T13:28:00.000Z"
  },
  {
    "title": "Better Than a Ball Machine: I Checked Out 2 Tennis Robots and Now Want One",
    "q": "better than a ball machine: i checked out 2 tennis robots and now want one windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Better Than a Ball Machine: I Checked Out 2 Tennis Robots and Now Want One</b><br>Love means nothing to these robots.<br><a href=\"https://www.cnet.com/culture/sports/better-than-a-ball-machine-i-checked-out-two-tennis-robots-and-now-want-one/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/culture/sports/better-than-a-ball-machine-i-checked-out-two-tennis-robots-and-now-want-one/",
    "topic": "it",
    "date": "2026-01-15T13:01:15.000Z"
  },
  {
    "title": " Buying all DLC for Monster Hunter Wilds unlocks twice the FPS performance — higher FPS accidentally paywalled by resource-hogging background check for paid content ",
    "q": " buying all dlc for monster hunter wilds unlocks twice the fps performance — higher fps accidentally paywalled by resource-hogging background check for paid content  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Buying all DLC for Monster Hunter Wilds unlocks twice the FPS performance — higher FPS accidentally paywalled by resource-hogging background check for paid content </b><br>A performance-crushing bug in Monster Hunter Wilds appears to vanish as more DLC is purchased and added to the game.<br><a href=\"https://www.tomshardware.com/video-games/pc-gaming/buying-all-dlc-for-monster-hunter-wilds-unlocks-twice-the-fps-performance-higher-fps-accidentally-paywalled-by-resource-hogging-background-check-for-paid-content\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/pc-gaming/buying-all-dlc-for-monster-hunter-wilds-unlocks-twice-the-fps-performance-higher-fps-accidentally-paywalled-by-resource-hogging-background-check-for-paid-content",
    "topic": "it",
    "date": "2026-01-15T12:58:17.000Z"
  },
  {
    "title": "Your Windows 11 laptop has a secret power setting that's seriously useful - how to find it",
    "q": "your windows 11 laptop has a secret power setting that's seriously useful - how to find it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Your Windows 11 laptop has a secret power setting that's seriously useful - how to find it</b><br>Windows 11 has a built-in report that provides insight into your laptop's battery health, including whether a replacement is actually needed.<br><a href=\"https://www.zdnet.com/article/how-to-check-battery-report-in-windows-11/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/how-to-check-battery-report-in-windows-11/",
    "topic": "it",
    "date": "2026-01-15T17:18:00.000Z"
  },
  {
    "title": " Turn Microsoft into \"Microslop\" everywhere with this new browser extension — CEO Satya Nadella discourages the term, but it's having the opposite effect ",
    "q": " turn microsoft into \"microslop\" everywhere with this new browser extension — ceo satya nadella discourages the term, but it's having the opposite effect  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Turn Microsoft into \"Microslop\" everywhere with this new browser extension — CEO Satya Nadella discourages the term, but it's having the opposite effect </b><br>A new Google Chrome browser extension called \"Microsoft to Microslop\" comes after Microsoft's CEO discouraged people from calling his AI \"slop.\"<br><a href=\"https://www.windowscentral.com/microsoft/turn-microsoft-into-microslop-everywhere-with-this-new-browser-extension\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/turn-microsoft-into-microslop-everywhere-with-this-new-browser-extension",
    "topic": "it",
    "date": "2026-01-15T12:00:00.000Z"
  },
  {
    "title": " Microsoft Copilot blamed by UK police chief for controversial soccer fan ban — incorrect evidence triggered by AI hallucinations ",
    "q": " microsoft copilot blamed by uk police chief for controversial soccer fan ban — incorrect evidence triggered by ai hallucinations  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft Copilot blamed by UK police chief for controversial soccer fan ban — incorrect evidence triggered by AI hallucinations </b><br>UK police blame Microsoft Copilot for a soccer fan error, raising concerns about the use of the unpredictable technology in law enforcement.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsoft-copilot/copilot-blamed-by-uk-police-chief-for-soccer-fan-ban\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsoft-copilot/copilot-blamed-by-uk-police-chief-for-soccer-fan-ban",
    "topic": "it",
    "date": "2026-01-15T11:01:57.000Z"
  },
  {
    "title": " Valve's Steam Machine will have \"fewer constraints\" for games to be Verified than Steam Deck — plus, an explanation for that weird Steam Controller puck ",
    "q": " valve's steam machine will have \"fewer constraints\" for games to be verified than steam deck — plus, an explanation for that weird steam controller puck  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Valve's Steam Machine will have \"fewer constraints\" for games to be Verified than Steam Deck — plus, an explanation for that weird Steam Controller puck </b><br>Valve's new Steam Machine will have \"fewer constraints\" for getting games Verified than the Steam Deck does, which is good news for game devs.<br><a href=\"https://www.windowscentral.com/gaming/pc-gaming/valves-steam-machine-will-have-fewer-constraints-for-games-to-be-verified-than-steam-deck-plus-an-explanation-for-that-weird-steam-controller-puck\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/pc-gaming/valves-steam-machine-will-have-fewer-constraints-for-games-to-be-verified-than-steam-deck-plus-an-explanation-for-that-weird-steam-controller-puck",
    "topic": "it",
    "date": "2026-01-14T21:34:47.000Z"
  },
  {
    "title": " Windows 11’s newest must‑have app just added Qualcomm laptop support in a major update — and it’s still baffling Microsoft didn’t make it ",
    "q": " windows 11’s newest must‑have app just added qualcomm laptop support in a major update — and it’s still baffling microsoft didn’t make it  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11’s newest must‑have app just added Qualcomm laptop support in a major update — and it’s still baffling Microsoft didn’t make it </b><br>A major update to this essential customization adds ARM64 support and lets you pick where flyouts appear.<br><a href=\"https://www.windowscentral.com/software-apps/windows-11s-newest-must-have-app-just-added-qualcomm-laptop-support-in-a-major-update-and-its-still-baffling-microsoft-didnt-make-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/windows-11s-newest-must-have-app-just-added-qualcomm-laptop-support-in-a-major-update-and-its-still-baffling-microsoft-didnt-make-it",
    "topic": "it",
    "date": "2026-01-14T20:15:48.000Z"
  },
  {
    "title": "FTC bans GM from selling drivers' location data for five years",
    "q": "ftc bans gm from selling drivers' location data for five years windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>FTC bans GM from selling drivers' location data for five years</b><br>The FTC has finalized an order with General Motors, settling charges that it collected and sold the location and driving data of millions of drivers without consent. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/ftc-bans-general-motors-from-selling-drivers-location-data-for-five-years/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/ftc-bans-general-motors-from-selling-drivers-location-data-for-five-years/",
    "topic": "it",
    "date": "2026-01-15T09:59:30.000Z"
  },
  {
    "title": "Palo Alto Networks warns of DoS bug letting hackers disable firewalls",
    "q": "palo alto networks warns of dos bug letting hackers disable firewalls windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Palo Alto Networks warns of DoS bug letting hackers disable firewalls</b><br>Palo Alto Networks patched a high-severity vulnerability that could allow unauthenticated attackers to disable firewall protections in denial-of-service (DoS) attacks. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/palo-alto-networks-warns-of-dos-bug-letting-hackers-disable-firewalls/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/palo-alto-networks-warns-of-dos-bug-letting-hackers-disable-firewalls/",
    "topic": "it",
    "date": "2026-01-15T09:02:42.000Z"
  },
  {
    "title": "Microsoft disrupts massive RedVDS cybercrime virtual desktop service",
    "q": "microsoft disrupts massive redvds cybercrime virtual desktop service windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft disrupts massive RedVDS cybercrime virtual desktop service</b><br>Microsoft announced on Wednesday that it disrupted RedVDS, a massive cybercrime platform linked to at least $40 million in reported losses in the United States alone since March 2025. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/microsoft-seizes-servers-disrupts-massive-redvds-cybercrime-platform/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-seizes-servers-disrupts-massive-redvds-cybercrime-platform/",
    "topic": "it",
    "date": "2026-01-15T07:11:45.000Z"
  },
  {
    "title": "The Raspberry Pi 5 has a new add-on board to boost performance",
    "q": "the raspberry pi 5 has a new add-on board to boost performance windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Raspberry Pi 5 has a new add-on board to boost performance</b><br>More power for machine learning tasks and generative AI models.<br><a href=\"https://www.howtogeek.com/the-raspberry-pi-5-has-a-new-add-on-board-to-boost-performance/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/the-raspberry-pi-5-has-a-new-add-on-board-to-boost-performance/",
    "topic": "it",
    "date": "2026-01-15T16:45:47.000Z"
  },
  {
    "title": "4 bad Windows habits Linux will finally help you break",
    "q": "4 bad windows habits linux will finally help you break windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>4 bad Windows habits Linux will finally help you break</b><br>Linux gets you closer to your computer<br><a href=\"https://www.xda-developers.com/4-bad-computing-habits-that-windows-teaches-you-that-linux-can-help-you-break/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/4-bad-computing-habits-that-windows-teaches-you-that-linux-can-help-you-break/",
    "topic": "it",
    "date": "2026-01-15T17:00:19.000Z"
  },
  {
    "title": "These 7 Docker containers make Linux the perfect home lab OS",
    "q": "these 7 docker containers make linux the perfect home lab os windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These 7 Docker containers make Linux the perfect home lab OS</b><br>Create the ultimate OS for your home lab.<br><a href=\"https://www.xda-developers.com/docker-containers-that-make-linux-the-perfect-os-for-home-lab/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/docker-containers-that-make-linux-the-perfect-os-for-home-lab/",
    "topic": "it",
    "date": "2026-01-15T14:30:20.000Z"
  }
]