[
  {
    "title": "Discovering a Digital Photo Editing Workflow Beyond Adobe",
    "q": "discovering a digital photo editing workflow beyond adobe camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Discovering a Digital Photo Editing Workflow Beyond Adobe</b><br>We can quickly acquire tens of thousands of photos. Therefore, managing them effectively is essential. Equally, we are becoming more demanding of our development and editing software. Recently, the most effective way of managing our workfl…<br><a href=\"https://petapixel.com/2026/01/17/discovering-a-digital-photo-editing-workflow-beyond-adobe/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/17/discovering-a-digital-photo-editing-workflow-beyond-adobe/",
    "topic": "photo",
    "date": "2026-01-17T16:00:56.000Z"
  },
  {
    "title": "Gen Z Photographers Take Center Stage in New Exhibition",
    "q": "gen z photographers take center stage in new exhibition camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Gen Z Photographers Take Center Stage in New Exhibition</b><br>A new exhibition spotlights Gen Z photographers, exploring the distinctive themes and perspectives that define their generation’s creativity. [Read More]<br><a href=\"https://petapixel.com/2026/01/17/gen-z-photographers-take-center-stage-in-new-exhibition/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/17/gen-z-photographers-take-center-stage-in-new-exhibition/",
    "topic": "photo",
    "date": "2026-01-17T14:00:11.000Z"
  },
  {
    "title": "Photographer Shoots, Develops, and Publishes NFL Film Photos Before the Game Ends",
    "q": "photographer shoots, develops, and publishes nfl film photos before the game ends camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Shoots, Develops, and Publishes NFL Film Photos Before the Game Ends</b><br>While most film shooters have to wait days, weeks, and sometimes even months to get their film back from the lab, Miles Myerscough-Harris of Expired Film Club recently shot an NFL game and posted the photos on Instagram before the game end…<br><a href=\"https://petapixel.com/2026/01/17/photographer-shoots-develops-and-publishes-nfl-film-photos-before-the-game-ends/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/17/photographer-shoots-develops-and-publishes-nfl-film-photos-before-the-game-ends/",
    "topic": "photo",
    "date": "2026-01-17T13:00:15.000Z"
  },
  {
    "title": "Uncovering the Secret Lenses Inside Old-School Analog Photo Booths",
    "q": "uncovering the secret lenses inside old-school analog photo booths camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Uncovering the Secret Lenses Inside Old-School Analog Photo Booths</b><br>Photographer and YouTube creator Mathieu Stern loves vintage lenses. He also loves vintage analog photo booths. So Stern set out to find out exactly which lenses are used in old-school film photo booths so he could recreate the exact look …<br><a href=\"https://petapixel.com/2026/01/16/uncovering-the-secret-lenses-inside-old-school-analog-photo-booths/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/uncovering-the-secret-lenses-inside-old-school-analog-photo-booths/",
    "topic": "photo",
    "date": "2026-01-16T21:47:37.000Z"
  },
  {
    "title": "Brightin Star Launches $270 MF 50mm f/1.05 Full-Frame Lens",
    "q": "brightin star launches $270 mf 50mm f/1.05 full-frame lens camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Brightin Star Launches $270 MF 50mm f/1.05 Full-Frame Lens</b><br>Brightin Star has announced the MF 50mm f/1.05, a full-frame manual-focus prime lens designed for mirrorless cameras across E, RF, Z, and L mounts. Featuring an ultra-fast maximum aperture and a classic 50mm focal length, the lens targets …<br><a href=\"https://petapixel.com/2026/01/16/brightin-star-launches-270-mf-50mm-f-1-05-full-frame-lens/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/brightin-star-launches-270-mf-50mm-f-1-05-full-frame-lens/",
    "topic": "photo",
    "date": "2026-01-16T20:53:20.000Z"
  },
  {
    "title": "No, the Fujifilm X-H2S Has Not Been Discontinued",
    "q": "no, the fujifilm x-h2s has not been discontinued camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>No, the Fujifilm X-H2S Has Not Been Discontinued</b><br>There has been speculation that the Fujifilm X-H2S might be on its last legs, but Fujifilm tells PetaPixel the camera remains an active product for the company. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/no-the-fujifilm-x-h2s-has-not-been-discontinued/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/no-the-fujifilm-x-h2s-has-not-been-discontinued/",
    "topic": "photo",
    "date": "2026-01-16T20:15:01.000Z"
  },
  {
    "title": "Honor Magic 8 Pro Review: A Camera Caught Between Instinct and Algorithm",
    "q": "honor magic 8 pro review: a camera caught between instinct and algorithm camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Honor Magic 8 Pro Review: A Camera Caught Between Instinct and Algorithm</b><br>The Honor Magic 8 Pro is part photography upstart and part AI canvas in how it approaches still photos, relying more and more on what machine learning can do along the way. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/honor-magic-8-pro-review-a-camera-caught-between-instinct-and-algorithm/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/honor-magic-8-pro-review-a-camera-caught-between-instinct-and-algorithm/",
    "topic": "photo",
    "date": "2026-01-16T17:41:53.000Z"
  },
  {
    "title": "Photographing Vietnam With Just Two Prime Lenses",
    "q": "photographing vietnam with just two prime lenses camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Vietnam With Just Two Prime Lenses</b><br>A few months ago, I traveled to Vietnam with my family, and I only had 11 days to experience as much of the country as I could. From the chaotic energy of Hanoi’s streets, to the preserved stillness of Hoi An, the calm waters of Ha Long Ba…<br><a href=\"https://petapixel.com/2026/01/16/photographing-vietnam-with-just-two-prime-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/photographing-vietnam-with-just-two-prime-lenses/",
    "topic": "photo",
    "date": "2026-01-16T16:35:06.000Z"
  },
  {
    "title": "The Story of ‘Grace,’ The Only Official State Photograph in the US",
    "q": "the story of ‘grace,’ the only official state photograph in the us camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Story of ‘Grace,’ The Only Official State Photograph in the US</b><br>When Eric Enstrom entered his photograph of Charles Wilden sitting at a table with his head bowed into a Minnesota photo contest, it lost because the judges thought it didn't make enough use of light. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/the-story-of-grace-the-only-official-state-photograph-in-the-us/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/the-story-of-grace-the-only-official-state-photograph-in-the-us/",
    "topic": "photo",
    "date": "2026-01-16T16:20:49.000Z"
  },
  {
    "title": "As Monkeys Escape Onto the Streets of St. Louis, AI Photos Add to the Chaos",
    "q": "as monkeys escape onto the streets of st. louis, ai photos add to the chaos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>As Monkeys Escape Onto the Streets of St. Louis, AI Photos Add to the Chaos</b><br>This week in Missouri, a band of vervet monkeys and a single goat were spotted roaming the streets of St. Louis. But while it made international headlines, it was further complicated by an avalanche of AI-generated photos. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/as-monkeys-escape-onto-the-streets-of-st-louis-ai-photos-add-to-the-chaos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/as-monkeys-escape-onto-the-streets-of-st-louis-ai-photos-add-to-the-chaos/",
    "topic": "photo",
    "date": "2026-01-16T16:13:55.000Z"
  },
  {
    "title": "Do photographers need the fastest external SSD? We tested three to find out",
    "q": "do photographers need the fastest external ssd? we tested three to find out camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do photographers need the fastest external SSD? We tested three to find out</b><br>We put the USB 3.2 Gen 2 Samsung T7 Shield, USB4 SanDisk Extreme Pro and Thunderbolt 5 OWC Envoy Ultra head-to-head. Photo: Mitchell Clark These days, there are an overwhelming number of options when it comes to buying an external SSD to e…<br><a href=\"https://www.dpreview.com/reviews/usb-4-thunderbolt-5-ssd-owc-sandisk-speeds-roundup\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/usb-4-thunderbolt-5-ssd-owc-sandisk-speeds-roundup",
    "topic": "photo",
    "date": "2026-01-17T14:00:00.000Z"
  },
  {
    "title": "From whales to coral reefs, this photo contest showcases underwater excellence",
    "q": "from whales to coral reefs, this photo contest showcases underwater excellence camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>From whales to coral reefs, this photo contest showcases underwater excellence</b><br>2025 DPG Masters Underwater Imaging Competition DivePhotoGuide (DPG) has announced the winners of its Masters Underwater Imaging Competition 2025. The contest consists of nine image categories, including wide angle, macro, over-under, comp…<br><a href=\"https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition",
    "topic": "photo",
    "date": "2026-01-16T15:16:00.000Z"
  },
  {
    "title": "Timed-to-perfection moments from the World Sports Photography Awards",
    "q": "timed-to-perfection moments from the world sports photography awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Timed-to-perfection moments from the World Sports Photography Awards</b><br>2026 World Sports Photography Awards The winners of the 2026 World Sports Photography Awards have been announced, highlighting impeccable timing, dramatic lighting and memorable moments. The contest showcases work from sports photographers…<br><a href=\"https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards",
    "topic": "photo",
    "date": "2026-01-15T18:55:00.000Z"
  },
  {
    "title": "Sony a7 V video studio scene: what do you really need?",
    "q": "sony a7 v video studio scene: what do you really need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony a7 V video studio scene: what do you really need?</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We've taken a look at how the Sony a7 V performs when it comes to stills, now it's time to turn our attention to video. The company's latest…<br><a href=\"https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene",
    "topic": "photo",
    "date": "2026-01-15T14:00:00.000Z"
  },
  {
    "title": "Breaking Leica's monopoly: Ricoh releases GR IV Mono",
    "q": "breaking leica's monopoly: ricoh releases gr iv mono camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Breaking Leica's monopoly: Ricoh releases GR IV Mono</b><br>When you use DPReview links to buy products, the site may earn a commission. Sample gallery This widget is not optimized for RSS feed readers. Please open this article's permalink in a browser to view this content. Product photos: Richard …<br><a href=\"https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch",
    "topic": "photo",
    "date": "2026-01-14T22:00:00.000Z"
  },
  {
    "title": "Question of the week: What projects are you undertaking to move your photography forward?",
    "q": "question of the week: what projects are you undertaking to move your photography forward? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What projects are you undertaking to move your photography forward?</b><br>All photographers inevitably deal with creative droughts or periods when they feel their skills have plateaued. At the end of last year, I wrote about part of why (and how) that's manifested for me over the past few years. For me, one comm…<br><a href=\"https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/",
    "topic": "photo",
    "date": "2026-01-14T15:50:00.000Z"
  },
  {
    "title": "Fujifilm fully raises the curtain on the cinematic Instax",
    "q": "fujifilm fully raises the curtain on the cinematic instax camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm fully raises the curtain on the cinematic Instax</b><br>Image: Fujifilm Last week, Fujifilm Japan launched a surprising and rather controversial new offering in its Instax lineup, the Instax Mini Evo Cinema. The company has now announced the global release of the hybrid camera, providing more d…<br><a href=\"https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": "Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor",
    "q": "eric fossum earns the prestigious draper prize for pioneering the cmos image sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor</b><br>Image: Draper Eric Fossum, the inventor of the modern CMOS image sensor and a longtime friend of DPReview, was recently awarded the 2026 Charles Stark Draper Prize for Engineering. The award, which is granted every two years by the Nationa…<br><a href=\"https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor",
    "topic": "photo",
    "date": "2026-01-13T20:10:00.000Z"
  },
  {
    "title": "Apple’s new Creative Cloud competitor lets you edit photos, music and video",
    "q": "apple’s new creative cloud competitor lets you edit photos, music and video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple’s new Creative Cloud competitor lets you edit photos, music and video</b><br>Image: Apple Apple has announced a new app bundle for creatives dubbed Apple Creator Studio. The subscription serves as somewhat of an alternative to Adobe's Creative Cloud, as it includes apps for photo, video and music editing, plus Appl…<br><a href=\"https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video",
    "topic": "photo",
    "date": "2026-01-13T18:31:00.000Z"
  },
  {
    "title": "Will SD cards remain forever stuck in the past?",
    "q": "will sd cards remain forever stuck in the past? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Will SD cards remain forever stuck in the past?</b><br>With no sign of faster SD cards, the CFexpress format is currently coming out on top. Photo: Richard Butler This year's CES trade show came and went with no apparent progress for the SD memory card format, despite higher speeds and capacit…<br><a href=\"https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past",
    "topic": "photo",
    "date": "2026-01-13T15:00:00.000Z"
  },
  {
    "title": " A new semiconductor tariff is here. But the newest tariff may actually be GOOD news for American photographers ",
    "q": " a new semiconductor tariff is here. but the newest tariff may actually be good news for american photographers  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> A new semiconductor tariff is here. But the newest tariff may actually be GOOD news for American photographers </b><br>A new 25% tariff on imported semiconductors is now in effect, but the import tax does not affect consumer electronics as originally threatened<br><a href=\"https://www.digitalcameraworld.com/cameras/a-new-semiconductor-tariff-is-here-but-the-newest-tariff-may-actually-be-good-news-for-american-photographers\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/a-new-semiconductor-tariff-is-here-but-the-newest-tariff-may-actually-be-good-news-for-american-photographers",
    "topic": "photo",
    "date": "2026-01-18T01:10:00.000Z"
  },
  {
    "title": " “Make this look like film” –I tried VSCO’s new AI prompt photo editing. It’s not perfect, but it did generate retro looks ",
    "q": " “make this look like film” –i tried vsco’s new ai prompt photo editing. it’s not perfect, but it did generate retro looks  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> “Make this look like film” –I tried VSCO’s new AI prompt photo editing. It’s not perfect, but it did generate retro looks </b><br>Photo editing app VSCO has launched a new Prompt tool inside its AI Lab<br><a href=\"https://www.digitalcameraworld.com/photography/photo-editing/make-this-look-like-film-i-tried-vscos-new-ai-prompt-photo-editing-its-not-perfect-but-it-did-generate-retro-looks\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photo-editing/make-this-look-like-film-i-tried-vscos-new-ai-prompt-photo-editing-its-not-perfect-but-it-did-generate-retro-looks",
    "topic": "photo",
    "date": "2026-01-17T19:15:00.000Z"
  },
  {
    "title": " Students have never had it so good, between Apple Creator Studio and an abundance of free photo- and video-editing apps ",
    "q": " students have never had it so good, between apple creator studio and an abundance of free photo- and video-editing apps  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Students have never had it so good, between Apple Creator Studio and an abundance of free photo- and video-editing apps </b><br>I cut my teeth on editing software when it cost the Earth. Apple Creator Studio is another reminder that the price of admission for students barely exists any more. And that's a good thing!<br><a href=\"https://www.digitalcameraworld.com/tech/software/students-have-never-had-it-so-good-between-apple-creator-studio-and-an-abundance-of-free-photo-and-video-editing-apps\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/software/students-have-never-had-it-so-good-between-apple-creator-studio-and-an-abundance-of-free-photo-and-video-editing-apps",
    "topic": "photo",
    "date": "2026-01-17T16:20:00.000Z"
  },
  {
    "title": " Why Japan's #3 best-selling lens is more exciting than the #1 (and it's not an optic made by Sony!) ",
    "q": " why japan's #3 best-selling lens is more exciting than the #1 (and it's not an optic made by sony!)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Why Japan's #3 best-selling lens is more exciting than the #1 (and it's not an optic made by Sony!) </b><br>This 20-200mm superzoom is a supremely travel-friendly lens with 20mm coverage and 10x zoom versatility<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/why-japans-3-best-selling-lens-is-more-exciting-than-the-1-and-its-not-an-optic-made-by-sony\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/why-japans-3-best-selling-lens-is-more-exciting-than-the-1-and-its-not-an-optic-made-by-sony",
    "topic": "photo",
    "date": "2026-01-17T13:25:00.000Z"
  },
  {
    "title": " Massive patent leak suggests Insta360 is planning to take out DJI's dominant Osmo Pocket 3 vlogging camera ",
    "q": " massive patent leak suggests insta360 is planning to take out dji's dominant osmo pocket 3 vlogging camera  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Massive patent leak suggests Insta360 is planning to take out DJI's dominant Osmo Pocket 3 vlogging camera </b><br>Insta360 look to take one of the jewels from DJI's crown with a patent leak revealing a competitor for the legendary Pocket 3...<br><a href=\"https://www.digitalcameraworld.com/cameras/action-cameras/massive-patent-leak-suggests-insta360-is-planning-to-take-out-djis-dominant-osmo-pocket-3-vlogging-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/action-cameras/massive-patent-leak-suggests-insta360-is-planning-to-take-out-djis-dominant-osmo-pocket-3-vlogging-camera",
    "topic": "photo",
    "date": "2026-01-17T13:23:11.000Z"
  },
  {
    "title": " I’m sick and tired of being told to stop taking photos on the street, so I was flabbergasted when a security guard did this! ",
    "q": " i’m sick and tired of being told to stop taking photos on the street, so i was flabbergasted when a security guard did this!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I’m sick and tired of being told to stop taking photos on the street, so I was flabbergasted when a security guard did this! </b><br>Where’s the harm in standing in a public place, taking photos of equally public places around town? I don’t know, but I keep getting the cold shoulder… but last week, the very opposite happened<br><a href=\"https://www.digitalcameraworld.com/photography/street-photography/im-sick-and-tired-of-being-told-to-stop-taking-photos-on-the-street-so-i-was-flabbergasted-when-a-security-guard-did-this\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/street-photography/im-sick-and-tired-of-being-told-to-stop-taking-photos-on-the-street-so-i-was-flabbergasted-when-a-security-guard-did-this",
    "topic": "photo",
    "date": "2026-01-17T12:34:12.000Z"
  },
  {
    "title": " Why on earth would you turn your back to the sun to photograph a landscape at sunset? ",
    "q": " why on earth would you turn your back to the sun to photograph a landscape at sunset?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Why on earth would you turn your back to the sun to photograph a landscape at sunset? </b><br>I turned my back on a perfect sunset, and it was the best decision I ever made<br><a href=\"https://www.digitalcameraworld.com/photography/landscape-photography/why-on-earth-would-you-turn-your-back-to-the-sun-to-photography-a-landscape-at-sunset\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/landscape-photography/why-on-earth-would-you-turn-your-back-to-the-sun-to-photography-a-landscape-at-sunset",
    "topic": "photo",
    "date": "2026-01-17T12:15:34.000Z"
  },
  {
    "title": " Love bites: This powerful wildlife photo, taken with a Sony A1, captures the beautiful chaos of motherhood ",
    "q": " love bites: this powerful wildlife photo, taken with a sony a1, captures the beautiful chaos of motherhood  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Love bites: This powerful wildlife photo, taken with a Sony A1, captures the beautiful chaos of motherhood </b><br>Photographer Janet Gustin froze a split-second moment of tender chaos in this award-winning image<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/love-bites-this-powerful-wildlife-photo-taken-with-a-sony-a1-captures-the-beautiful-chaos-of-motherhood\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/love-bites-this-powerful-wildlife-photo-taken-with-a-sony-a1-captures-the-beautiful-chaos-of-motherhood",
    "topic": "photo",
    "date": "2026-01-17T10:10:00.000Z"
  },
  {
    "title": " Is Canon's \"unicorn lens\" finally here?  ",
    "q": " is canon's \"unicorn lens\" finally here?   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Is Canon's \"unicorn lens\" finally here?  </b><br>The long-rumored (and even longer-desired) \"unicorn lens\",the Canon RF 35mm f/1.2L,might finally be on its way<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/is-canons-unicorn-lens-finally-here\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/is-canons-unicorn-lens-finally-here",
    "topic": "photo",
    "date": "2026-01-17T07:18:00.000Z"
  },
  {
    "title": "Dynamic 3-Light Sports Portrait Setup",
    "q": "dynamic 3-light sports portrait setup camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Dynamic 3-Light Sports Portrait Setup</b><br>When it comes to taking sports photography portraits, capturing dynamic energy is the name of the game. Sports portraits often convey a sense of action and energy with dramatic poses and lighting, the latter of which often relies on using …<br><a href=\"https://www.slrlounge.com/dynamic-3-light-sports-portrait-setup/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dynamic-3-light-sports-portrait-setup/",
    "topic": "photo",
    "date": "2026-01-16T20:25:28.000Z"
  },
  {
    "title": "3 Ways To Photograph Family Group Photos With Flash",
    "q": "3 ways to photograph family group photos with flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>3 Ways To Photograph Family Group Photos With Flash</b><br>Setting up one directional off-camera flash with a shoot-through umbrella may be your go-to lighting setup for family formals, but what other ways can you light a group of people to create more drama or visual interest? Light alters the mo…<br><a href=\"https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/",
    "topic": "photo",
    "date": "2026-01-14T19:59:28.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "The Setapp Mobile iOS store is shutting down on February 16th",
    "q": "the setapp mobile ios store is shutting down on february 16th windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Setapp Mobile iOS store is shutting down on February 16th</b><br>Setapp Mobile seemed like one of the many alternative app markets with promise that launched in the wake of the EU's Digital Markets Act (DMA). While the law may have forced Apple to allow third-party app stores on its devices, it couldn't…<br><a href=\"https://www.theverge.com/news/863978/setapp-mobile-ios-store-shutdown\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/863978/setapp-mobile-ios-store-shutdown",
    "topic": "it",
    "date": "2026-01-17T17:36:54.000Z"
  },
  {
    "title": "The LG C5 and Apple’s M4 Mac Mini are both steeply discounted this weekend",
    "q": "the lg c5 and apple’s m4 mac mini are both steeply discounted this weekend windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The LG C5 and Apple’s M4 Mac Mini are both steeply discounted this weekend</b><br>Small footprint. Speedy performance. | Image: The Verge Happy Saturday, folks! This week, Best Buy kicked off its so-called “Winter Sale,” introducing a whole host of price cuts that range from not-so-good to legitimately great, at least f…<br><a href=\"https://www.theverge.com/gadgets/863503/apple-mac-mini-m4-lg-c5-oled-tv-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/863503/apple-mac-mini-m4-lg-c5-oled-tv-deal-sale",
    "topic": "it",
    "date": "2026-01-17T15:38:25.000Z"
  },
  {
    "title": "Fear and blogging (and prerelease laptop testing) in Las Vegas",
    "q": "fear and blogging (and prerelease laptop testing) in las vegas windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Fear and blogging (and prerelease laptop testing) in Las Vegas</b><br>During a chaotic multiday event, I found myself working anywhere. And always in a rush. At CES, I did what you're not supposed to do: I brought a pre-production laptop to use as my primary workhorse during a hectic event. The unproven rifl…<br><a href=\"https://www.theverge.com/tech/862985/asus-zenbook-a16-snapdragon-x2-ces-early-testing-hands-on\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/862985/asus-zenbook-a16-snapdragon-x2-ces-early-testing-hands-on",
    "topic": "it",
    "date": "2026-01-17T13:00:00.000Z"
  },
  {
    "title": "The best deals on MacBooks right now",
    "q": "the best deals on macbooks right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best deals on MacBooks right now</b><br>The 15-inch MacBook Air offers better speakers than its 13-inch sibling, but is otherwise similar. Apple currently sells MacBooks equipped with its own M-series processors in a wide range of sizes and price points, all of which run the com…<br><a href=\"https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals",
    "topic": "it",
    "date": "2026-01-16T23:48:15.000Z"
  },
  {
    "title": "Verizon's $20 Credit Is Available for You to Claim Following Major Outage (Live Updates)",
    "q": "verizon's $20 credit is available for you to claim following major outage (live updates) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Verizon's $20 Credit Is Available for You to Claim Following Major Outage (Live Updates)</b><br>After the hourslong outage affected 2 million customers, the wireless carrier is offering a $20 credit per account.<br><a href=\"https://www.cnet.com/news-live/verizon-outage-january-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/news-live/verizon-outage-january-2026/",
    "topic": "it",
    "date": "2026-01-17T15:55:00.000Z"
  },
  {
    "title": " Wikipedia is now 25 years old — world’s 7th most popular website now has over 7 million English articles and 7 billion monthly visitors ",
    "q": " wikipedia is now 25 years old — world’s 7th most popular website now has over 7 million english articles and 7 billion monthly visitors  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Wikipedia is now 25 years old — world’s 7th most popular website now has over 7 million English articles and 7 billion monthly visitors </b><br>Wikipedia is 25. Founded on this day in 2001, this community contributor driven site has convincingly usurped what were once the default general reference works of choice, like Encyclopædia Britannica and Microsoft Encarta.<br><a href=\"https://www.tomshardware.com/tech-industry/wikipedia-is-now-25-years-old-worlds-7th-most-popular-website-now-has-over-7-million-english-articles-and-7-billion-monthly-visitors\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/wikipedia-is-now-25-years-old-worlds-7th-most-popular-website-now-has-over-7-million-english-articles-and-7-billion-monthly-visitors",
    "topic": "it",
    "date": "2026-01-17T13:08:47.000Z"
  },
  {
    "title": "Windows 11 Home vs. Windows 11 Pro: I compared both versions, and here's my upgrade advice",
    "q": "windows 11 home vs. windows 11 pro: i compared both versions, and here's my upgrade advice windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 Home vs. Windows 11 Pro: I compared both versions, and here's my upgrade advice</b><br>Windows 11 Pro gives you greater control over settings, but is it worth the extra cost? I break down the differences between the two systems.<br><a href=\"https://www.zdnet.com/article/windows-11-home-vs-windows-11-pro/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/windows-11-home-vs-windows-11-pro/",
    "topic": "it",
    "date": "2026-01-18T00:00:39.000Z"
  },
  {
    "title": "I used Microsoft's free Windows 11 battery health tool to diagnose my PC - and got helpful results",
    "q": "i used microsoft's free windows 11 battery health tool to diagnose my pc - and got helpful results windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I used Microsoft's free Windows 11 battery health tool to diagnose my PC - and got helpful results</b><br>Windows 11 has a built-in report that provides insight into your laptop's battery status, including whether a replacement is actually needed.<br><a href=\"https://www.zdnet.com/article/battery-health-report-windows-11-pc/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/battery-health-report-windows-11-pc/",
    "topic": "it",
    "date": "2026-01-17T13:00:50.000Z"
  },
  {
    "title": " PC hardware is entering a golden age of design and engineering, while Windows — with its newfound AI obsession — has never felt worse. Something must change. ",
    "q": " pc hardware is entering a golden age of design and engineering, while windows — with its newfound ai obsession — has never felt worse. something must change.  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> PC hardware is entering a golden age of design and engineering, while Windows — with its newfound AI obsession — has never felt worse. Something must change. </b><br>My visit to CES 2026 cemented my opinion that PC hardware has never been in a better state from a design and engineering standpoint. Windows, on the other hand, seems to be on the decline.<br><a href=\"https://www.windowscentral.com/microsoft/windows/pc-hardware-golden-age-windows-never-worse\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows/pc-hardware-golden-age-windows-never-worse",
    "topic": "it",
    "date": "2026-01-17T17:00:00.000Z"
  },
  {
    "title": " Microsoft Edge is killing off its Collections feature, leaving users scrambling to figure out what happens to their saved data ",
    "q": " microsoft edge is killing off its collections feature, leaving users scrambling to figure out what happens to their saved data  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft Edge is killing off its Collections feature, leaving users scrambling to figure out what happens to their saved data </b><br>The clock is ticking for Microsoft Edge Collections. As retirement looms, users face a choice: lose their saved notes or move their data offline.<br><a href=\"https://www.windowscentral.com/software-apps/microsoft-edge-is-killing-off-its-collections-feature\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/microsoft-edge-is-killing-off-its-collections-feature",
    "topic": "it",
    "date": "2026-01-17T15:20:26.000Z"
  },
  {
    "title": " Microsoft finally built a Slack‑to‑Teams migration tool, but it leaves DMs behind — raising questions about how useful it really is ",
    "q": " microsoft finally built a slack‑to‑teams migration tool, but it leaves dms behind — raising questions about how useful it really is  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft finally built a Slack‑to‑Teams migration tool, but it leaves DMs behind — raising questions about how useful it really is </b><br>Microsoft is rolling out a native Slack-to-Teams migration tool this month, but it only supports channel data, leaving DMs and workflows in the cold.<br><a href=\"https://www.windowscentral.com/software-apps/microsoft-finally-built-a-slack-to-teams-migration-tool-but-it-leaves-dms-behind-raising-questions-about-how-useful-it-really-is\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/microsoft-finally-built-a-slack-to-teams-migration-tool-but-it-leaves-dms-behind-raising-questions-about-how-useful-it-really-is",
    "topic": "it",
    "date": "2026-01-17T14:09:02.000Z"
  },
  {
    "title": " OpenAI is slapping ads into ChatGPT — Microsoft Copilot is obviously next ",
    "q": " openai is slapping ads into chatgpt — microsoft copilot is obviously next  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> OpenAI is slapping ads into ChatGPT — Microsoft Copilot is obviously next </b><br>OpenAI CEO Sam Altman has had an unfortunate dose of reality, reckoning with the fact ChatGPT is a uniquely powerful money destruction machine.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/openai-is-slapping-ads-into-chatgpt-microsoft-copilot-is-obviously-next\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/openai-is-slapping-ads-into-chatgpt-microsoft-copilot-is-obviously-next",
    "topic": "it",
    "date": "2026-01-17T12:44:45.000Z"
  },
  {
    "title": "Credential-stealing Chrome extensions target enterprise HR platforms",
    "q": "credential-stealing chrome extensions target enterprise hr platforms windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Credential-stealing Chrome extensions target enterprise HR platforms</b><br>Malicious Chrome extensions on the Chrome Web Store masquerading as productivity and security tools for enterprise HR and ERP platforms were discovered stealing authentication credentials or blocking management pages used to respond to sec…<br><a href=\"https://www.bleepingcomputer.com/news/security/credential-stealing-chrome-extensions-target-enterprise-hr-platforms/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/credential-stealing-chrome-extensions-target-enterprise-hr-platforms/",
    "topic": "it",
    "date": "2026-01-17T16:19:30.000Z"
  },
  {
    "title": "Microsoft: Windows 11 update causes Outlook freezes for POP users",
    "q": "microsoft: windows 11 update causes outlook freezes for pop users windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows 11 update causes Outlook freezes for POP users</b><br>Microsoft confirmed that the KB5074109 January Windows 11 security update causes the classic Outlook desktop client to freeze and hang for users with POP email accounts. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-update-causes-outlook-freezes-for-pop-users/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-update-causes-outlook-freezes-for-pop-users/",
    "topic": "it",
    "date": "2026-01-16T12:12:41.000Z"
  },
  {
    "title": "KDE Plasma 6.7 is bringing dark mode toggle, push to talk, and more",
    "q": "kde plasma 6.7 is bringing dark mode toggle, push to talk, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>KDE Plasma 6.7 is bringing dark mode toggle, push to talk, and more</b><br>There's a lot coming in the next update.<br><a href=\"https://www.howtogeek.com/kde-plasma-67-is-bringing-dark-mode-toggle-push-to-talk-and-more/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/kde-plasma-67-is-bringing-dark-mode-toggle-push-to-talk-and-more/",
    "topic": "it",
    "date": "2026-01-17T19:52:10.000Z"
  },
  {
    "title": "This cheap tool should be in every driver's trunk",
    "q": "this cheap tool should be in every driver's trunk windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This cheap tool should be in every driver's trunk</b><br>A portable tire inflator is way more useful than you think.<br><a href=\"https://www.howtogeek.com/cheap-tool-every-drivers-trunk/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/cheap-tool-every-drivers-trunk/",
    "topic": "it",
    "date": "2026-01-17T19:30:16.000Z"
  },
  {
    "title": "Microsoft Excel's Selection Pane: The best tool you didn't know you had",
    "q": "microsoft excel's selection pane: the best tool you didn't know you had windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft Excel's Selection Pane: The best tool you didn't know you had</b><br>Manage layers, hide overlapping charts, and find ghost objects using Excel’s powerful Selection Pane.<br><a href=\"https://www.howtogeek.com/microsoft-excel-selection-pane-best-tool-didnt-know-had/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-selection-pane-best-tool-didnt-know-had/",
    "topic": "it",
    "date": "2026-01-17T17:15:16.000Z"
  },
  {
    "title": "The forgotten Apple device that hooked us on smartphones",
    "q": "the forgotten apple device that hooked us on smartphones windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The forgotten Apple device that hooked us on smartphones</b><br>It was just a touch short of the real deal.<br><a href=\"https://www.howtogeek.com/the-forgotten-apple-device-that-hooked-us-on-smartphones/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/the-forgotten-apple-device-that-hooked-us-on-smartphones/",
    "topic": "it",
    "date": "2026-01-17T17:00:16.000Z"
  },
  {
    "title": "Someone finally got the Adobe CC installers working on Linux with Wine",
    "q": "someone finally got the adobe cc installers working on linux with wine windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Someone finally got the Adobe CC installers working on Linux with Wine</b><br>It's a miracle.<br><a href=\"https://www.xda-developers.com/someone-finally-got-the-adobe-cc-installers-working-on-linux-with-wine/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/someone-finally-got-the-adobe-cc-installers-working-on-linux-with-wine/",
    "topic": "it",
    "date": "2026-01-18T06:17:38.000Z"
  },
  {
    "title": "Forget Microsoft Loop: Try these open-source apps instead",
    "q": "forget microsoft loop: try these open-source apps instead windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Forget Microsoft Loop: Try these open-source apps instead</b><br>Same idea, but open-source<br><a href=\"https://www.xda-developers.com/forget-microsoft-loop-try-open-source-apps-instead/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/forget-microsoft-loop-try-open-source-apps-instead/",
    "topic": "it",
    "date": "2026-01-17T23:01:21.000Z"
  },
  {
    "title": "An external NVMe in a USB4 enclosure became the best drive I own",
    "q": "an external nvme in a usb4 enclosure became the best drive i own windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>An external NVMe in a USB4 enclosure became the best drive I own</b><br>While it might get hot, it's fast enough to run Windows externally<br><a href=\"https://www.xda-developers.com/an-external-nvme-in-a-usb4-enclosure-became-the-best-drive-i-own/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/an-external-nvme-in-a-usb4-enclosure-became-the-best-drive-i-own/",
    "topic": "it",
    "date": "2026-01-17T21:30:20.000Z"
  },
  {
    "title": "Windows Server 2025 belongs in home labs, not just enterprises",
    "q": "windows server 2025 belongs in home labs, not just enterprises windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows Server 2025 belongs in home labs, not just enterprises</b><br>It's surprisingly usable at home<br><a href=\"https://www.xda-developers.com/windows-server-2025-belongs-in-homelabs-not-just-enterprises/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-server-2025-belongs-in-homelabs-not-just-enterprises/",
    "topic": "it",
    "date": "2026-01-17T21:00:20.000Z"
  }
]