[
  {
    "title": "Fujifilm Instax Mini Evo Cinema Review: Wait, This Is Awesome",
    "q": "fujifilm instax mini evo cinema review: wait, this is awesome camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm Instax Mini Evo Cinema Review: Wait, This Is Awesome</b><br>By now, everyone knows about the dominance that Fujifilm holds over the instant photography market. Instax is a huge part of its business and has become the de facto photography gift for birthdays, parties, and at the holidays. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/fujifilm-instax-mini-evo-cinema-review-wait-this-is-awesome/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/fujifilm-instax-mini-evo-cinema-review-wait-this-is-awesome/",
    "topic": "photo",
    "date": "2026-01-14T02:01:15.000Z"
  },
  {
    "title": "‘Pole to Pole With Will Smith’ Breaks New Scientific and Photographic Ground",
    "q": "‘pole to pole with will smith’ breaks new scientific and photographic ground camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘Pole to Pole With Will Smith’ Breaks New Scientific and Photographic Ground</b><br>In National Geographics new series, \"Pole to Pole With Will Smith,\" viewers follow Smith and world-renowned experts on an adventure across the globe, starting at the South Pole and concluding in the season finale at the North Pole with sto…<br><a href=\"https://petapixel.com/2026/01/13/pole-to-pole-with-will-smith-breaks-new-scientific-and-photographic-ground/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/pole-to-pole-with-will-smith-breaks-new-scientific-and-photographic-ground/",
    "topic": "photo",
    "date": "2026-01-13T21:57:49.000Z"
  },
  {
    "title": "DxO Modules Now Support Over 110,000 Camera and Lens Combos",
    "q": "dxo modules now support over 110,000 camera and lens combos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO Modules Now Support Over 110,000 Camera and Lens Combos</b><br>DxO Labs has released 326 new modules for its photo editing applications, including support for the latest gear from Canon, Nikon, Sony, Fujifilm, Hasselblad, Leica, and more. The additions bring the total number of camera and lens combina…<br><a href=\"https://petapixel.com/2026/01/13/dxo-modules-now-support-over-110000-camera-and-lens-combos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/dxo-modules-now-support-over-110000-camera-and-lens-combos/",
    "topic": "photo",
    "date": "2026-01-13T19:53:50.000Z"
  },
  {
    "title": "Iconic Oscar Wilde Portrait by Legendary Photographer Sarony to Be Sold at Auction",
    "q": "iconic oscar wilde portrait by legendary photographer sarony to be sold at auction camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Iconic Oscar Wilde Portrait by Legendary Photographer Sarony to Be Sold at Auction</b><br>An iconic 1882 photograph of Oscar Wilde, taken by renowned New York photographer Napoleon Sarony, is set to be sold at auction next month. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/iconic-oscar-wilde-portrait-by-legendary-photographer-sarony-to-be-sold-at-auction/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/iconic-oscar-wilde-portrait-by-legendary-photographer-sarony-to-be-sold-at-auction/",
    "topic": "photo",
    "date": "2026-01-13T18:56:16.000Z"
  },
  {
    "title": "Webb Space Telescope’s Special Aperture Turns One Sensor Into Seven",
    "q": "webb space telescope’s special aperture turns one sensor into seven camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Webb Space Telescope’s Special Aperture Turns One Sensor Into Seven</b><br>NASA's James Webb Space Telescope used its sophisticated aperture mechanism to capture unprecedented images of the heart of the Circinus Galaxy, providing astronomers with data unlike anything previously obtained and completely upending th…<br><a href=\"https://petapixel.com/2026/01/13/webb-space-telescopes-special-aperture-turns-one-sensor-into-seven/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/webb-space-telescopes-special-aperture-turns-one-sensor-into-seven/",
    "topic": "photo",
    "date": "2026-01-13T17:24:40.000Z"
  },
  {
    "title": "Photographer Sues Canadian Police Over Protest Arrest Case That Could Reshape Press Freedom",
    "q": "photographer sues canadian police over protest arrest case that could reshape press freedom camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Sues Canadian Police Over Protest Arrest Case That Could Reshape Press Freedom</b><br>A photographer and the news outlet that sent her to cover a protest are suing the Canadian police over her arrest in a case that could redefine who counts as a journalist in an era where \"anyone with a cellphone\" can be considered media. […<br><a href=\"https://petapixel.com/2026/01/13/photographer-sues-canadian-police-over-protest-arrest-case-that-could-reshape-press-freedom/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/photographer-sues-canadian-police-over-protest-arrest-case-that-could-reshape-press-freedom/",
    "topic": "photo",
    "date": "2026-01-13T15:56:12.000Z"
  },
  {
    "title": "Photographer Tells Story Behind Iconic Deftones Album Cover",
    "q": "photographer tells story behind iconic deftones album cover camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Tells Story Behind Iconic Deftones Album Cover</b><br>You might not have heard the album Around the Fur by 1990s alternative metal band Deftones, but there is a good chance you've seen the photo on the cover. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/photographer-tells-story-behind-iconic-deftones-album-cover/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/photographer-tells-story-behind-iconic-deftones-album-cover/",
    "topic": "photo",
    "date": "2026-01-13T15:07:09.000Z"
  },
  {
    "title": "Fujifilm fully raises the curtain on the cinematic Instax",
    "q": "fujifilm fully raises the curtain on the cinematic instax camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm fully raises the curtain on the cinematic Instax</b><br>Image: Fujifilm Last week, Fujifilm Japan launched a surprising and rather controversial new offering in its Instax lineup, the Instax Mini Evo Cinema. The company has now announced the global release of the hybrid camera, providing more d…<br><a href=\"https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": "Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor",
    "q": "eric fossum earns the prestigious draper prize for pioneering the cmos image sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor</b><br>Image: Draper Eric Fossum, the inventor of the modern CMOS image sensor and a longtime friend of DPReview, was recently awarded the 2026 Charles Stark Draper Prize for Engineering. The award, which is granted every two years by the Nationa…<br><a href=\"https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor",
    "topic": "photo",
    "date": "2026-01-13T20:10:00.000Z"
  },
  {
    "title": "Apple’s new Creative Cloud competitor lets you edit photos, music and video",
    "q": "apple’s new creative cloud competitor lets you edit photos, music and video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple’s new Creative Cloud competitor lets you edit photos, music and video</b><br>Image: Apple Apple has announced a new app bundle for creatives dubbed Apple Creator Studio. The subscription serves as somewhat of an alternative to Adobe's Creative Cloud, as it includes apps for photo, video and music editing, plus Appl…<br><a href=\"https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video",
    "topic": "photo",
    "date": "2026-01-13T18:31:00.000Z"
  },
  {
    "title": "Will SD cards remain forever stuck in the past?",
    "q": "will sd cards remain forever stuck in the past? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Will SD cards remain forever stuck in the past?</b><br>With no sign of faster SD cards, the CFexpress format is currently coming out on top. Photo: Richard Butler This year's CES trade show came and went with no apparent progress for the SD memory card format, despite higher speeds and capacit…<br><a href=\"https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past",
    "topic": "photo",
    "date": "2026-01-13T15:00:00.000Z"
  },
  {
    "title": "Portrait of Britain: Celebrating the faces that define a nation",
    "q": "portrait of britain: celebrating the faces that define a nation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Portrait of Britain: Celebrating the faces that define a nation</b><br>Portrait of Britain Vol. 8 Winners The British Journal of Photography has announced the winners of Portrait of Britain Vol. 8. The contest, which began in 2016, aims to celebrate the diverse mosaic of individuals who make up Great Britain …<br><a href=\"https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation",
    "topic": "photo",
    "date": "2026-01-12T21:48:00.000Z"
  },
  {
    "title": "DPReview Reader's Choice Awards 2025: Product of the Year",
    "q": "dpreview reader's choice awards 2025: product of the year camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Reader's Choice Awards 2025: Product of the Year</b><br>When you use DPReview links to buy products, the site may earn a commission. Product of the Year 2025: the results The final round of voting has closed, and it's time to reveal the winners of our 2025 Readers' Choice Awards! Beginning in D…<br><a href=\"https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Finding your way out of a creative drought with photo projects",
    "q": "finding your way out of a creative drought with photo projects camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Finding your way out of a creative drought with photo projects</b><br>An image from my third 365 project, taken in 2012. Photo: Abby Ferguson Every photographer inevitably goes through periods where they hit a wall. That wall can come from all kinds of things, including a lack of inspiration, growth stagnati…<br><a href=\"https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects",
    "topic": "photo",
    "date": "2026-01-11T15:00:00.000Z"
  },
  {
    "title": "Announcing our January 2026 photo challenge: \"Silly Signs\"",
    "q": "announcing our january 2026 photo challenge: \"silly signs\" camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Announcing our January 2026 photo challenge: \"Silly Signs\"</b><br>I came across this sign in a park in St. Petersburg, Russia, many years ago. It says, \"Attention! Keep an eye on your things.\" While the message is serious and a good reminder to tourists, I always thought the illustration was creative and…<br><a href=\"https://www.dpreview.com/articles/0843676549/january-2026-editors-photo-challenge-announced\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0843676549/january-2026-editors-photo-challenge-announced",
    "topic": "photo",
    "date": "2026-01-11T14:00:00.000Z"
  },
  {
    "title": "Photographing Mongolia in winter: part 1",
    "q": "photographing mongolia in winter: part 1 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Mongolia in winter: part 1</b><br>The Khongor Sand Dunes in Mongolia, partially covered by snow and ice. DJI Mavic 2 Pro | ISO 100 | 1/200 sec | F8 Photo: Erez Marom Today, I'd like to talk about my experience shooting landscapes and wildlife in Mongolia. Known for its rem…<br><a href=\"https://www.dpreview.com/articles/6654015450/photographing-mongolia-in-winter-part-1\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/6654015450/photographing-mongolia-in-winter-part-1",
    "topic": "photo",
    "date": "2026-01-10T14:00:00.000Z"
  },
  {
    "title": "The weird way to get a \"free\" X half",
    "q": "the weird way to get a \"free\" x half camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The weird way to get a \"free\" X half</b><br>When you use DPReview links to buy products, the site may earn a commission. More practically, the camera is also $200 off at most retailers, too. Photo: Richard Butler UPDATE Jan. 12: This deal no longer appears to be active on Adorama's …<br><a href=\"https://www.dpreview.com/articles/7840103808/x-half-adorama-sale-free-with-x-t5\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7840103808/x-half-adorama-sale-free-with-x-t5",
    "topic": "photo",
    "date": "2026-01-09T20:07:00.000Z"
  },
  {
    "title": " DJI Pocket 4 and Avata 360: Everything we know about the leaked 2026 DJI camera and drone roadmap ",
    "q": " dji pocket 4 and avata 360: everything we know about the leaked 2026 dji camera and drone roadmap  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> DJI Pocket 4 and Avata 360: Everything we know about the leaked 2026 DJI camera and drone roadmap </b><br>Leaked images of the DJI Pocket 4 suggest a massive hardware shift: a dual-camera 'Pro' model that could redefine vlogging cameras for 2026 – for some...<br><a href=\"https://www.digitalcameraworld.com/cameras/action-cameras/dji-pocket-4-and-avata-360-everything-we-know-about-the-leaked-2026-dji-camera-and-drone-roadmap\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/action-cameras/dji-pocket-4-and-avata-360-everything-we-know-about-the-leaked-2026-dji-camera-and-drone-roadmap",
    "topic": "photo",
    "date": "2026-01-14T12:05:16.000Z"
  },
  {
    "title": " What on earth is a grip arm - and why you need one in your photo studio set-up? ",
    "q": " what on earth is a grip arm - and why you need one in your photo studio set-up?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> What on earth is a grip arm - and why you need one in your photo studio set-up? </b><br>The grip arm is an essential piece of equipment in the studio photographer’s arsenal. Here are three top grip arm uses…<br><a href=\"https://www.digitalcameraworld.com/photography/lighting/what-on-earth-is-a-grip-arm-and-why-you-need-one-in-your-photo-studio-set-up\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/lighting/what-on-earth-is-a-grip-arm-and-why-you-need-one-in-your-photo-studio-set-up",
    "topic": "photo",
    "date": "2026-01-14T10:55:00.000Z"
  },
  {
    "title": " Shot with a Fujifilm X-T4 camera, this entrancing image beautifully captures an ancient Hindu ritual  ",
    "q": " shot with a fujifilm x-t4 camera, this entrancing image beautifully captures an ancient hindu ritual   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Shot with a Fujifilm X-T4 camera, this entrancing image beautifully captures an ancient Hindu ritual  </b><br>Indranil Sengupta's award-winning shot captures the intimate moment a young performer is transformed into a Hindu deity<br><a href=\"https://www.digitalcameraworld.com/photography/travel-photography/shot-with-a-fujifilm-x-t4-camera-this-entrancing-image-beautifully-captures-an-ancient-hindu-ritual\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/travel-photography/shot-with-a-fujifilm-x-t4-camera-this-entrancing-image-beautifully-captures-an-ancient-hindu-ritual",
    "topic": "photo",
    "date": "2026-01-14T09:15:00.000Z"
  },
  {
    "title": " DxO’s optical corrections now cover an unprecedented 110,230 camera and lens combinations ",
    "q": " dxo’s optical corrections now cover an unprecedented 110,230 camera and lens combinations  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> DxO’s optical corrections now cover an unprecedented 110,230 camera and lens combinations </b><br>DxO’s two-decade mission to create an unmatched optical corrections library reaches a huge milestone<br><a href=\"https://www.digitalcameraworld.com/tech/software/dxos-optical-corrections-now-cover-an-unprecedented-110-230-camera-and-lens-combinations\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/software/dxos-optical-corrections-now-cover-an-unprecedented-110-230-camera-and-lens-combinations",
    "topic": "photo",
    "date": "2026-01-14T08:22:37.000Z"
  },
  {
    "title": " Apple’s Photoshop alternative Pixelmator Pro is coming to iPad, including Apple Pencil support ",
    "q": " apple’s photoshop alternative pixelmator pro is coming to ipad, including apple pencil support  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Apple’s Photoshop alternative Pixelmator Pro is coming to iPad, including Apple Pencil support </b><br>Apple's recently acquired photo editor is coming to iPad as Apple launches the Creator Studio subscription<br><a href=\"https://www.digitalcameraworld.com/photography/photo-editing/apples-photoshop-alternative-pixelmator-pro-is-coming-to-ipad-including-apple-pencil-support\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photo-editing/apples-photoshop-alternative-pixelmator-pro-is-coming-to-ipad-including-apple-pencil-support",
    "topic": "photo",
    "date": "2026-01-14T07:20:00.000Z"
  },
  {
    "title": " Fujifilm Instax Mini Evo Cinema review: I tried the Fujifilm decades camera and I’m obsessed with the time-traveling dial – but there are some bugs ",
    "q": " fujifilm instax mini evo cinema review: i tried the fujifilm decades camera and i’m obsessed with the time-traveling dial – but there are some bugs  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Fujifilm Instax Mini Evo Cinema review: I tried the Fujifilm decades camera and I’m obsessed with the time-traveling dial – but there are some bugs </b><br>The Fujifilm Instax Mini Evo Cinema is the strangest camera I've used, but it's also incredibly fun<br><a href=\"https://www.digitalcameraworld.com/cameras/instant-cameras/fujifilm-instax-mini-evo-cinema-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/fujifilm-instax-mini-evo-cinema-review",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": " I tried the delightfully weird Instax Mini Evo Cinema compact camera. I only wish I could turn back time to 90s camera prices ",
    "q": " i tried the delightfully weird instax mini evo cinema compact camera. i only wish i could turn back time to 90s camera prices  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I tried the delightfully weird Instax Mini Evo Cinema compact camera. I only wish I could turn back time to 90s camera prices </b><br>Now officially available outside Japan, the Instax Mini Evo Cinema is delightfully strange, but not without its flaws<br><a href=\"https://www.digitalcameraworld.com/cameras/instant-cameras/i-tried-the-delightfully-weird-instax-mini-evo-cinema-compact-camera-i-only-wish-i-could-turn-back-time-to-90s-camera-prices\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/i-tried-the-delightfully-weird-instax-mini-evo-cinema-compact-camera-i-only-wish-i-could-turn-back-time-to-90s-camera-prices",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": " AU$1,500,000 up for grabs in world's richest photography awards as 2026 HIPA contest theme is revealed! ",
    "q": " au$1,500,000 up for grabs in world's richest photography awards as 2026 hipa contest theme is revealed!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> AU$1,500,000 up for grabs in world's richest photography awards as 2026 HIPA contest theme is revealed! </b><br>HIPA 2026 photo contest opens for entries and is looking for images on the theme of Family<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/au-aud1-500-000-up-for-grabs-in-worlds-richest-photography-awards-as-2026-hipa-contest-theme-is-revealed\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/au-aud1-500-000-up-for-grabs-in-worlds-richest-photography-awards-as-2026-hipa-contest-theme-is-revealed",
    "topic": "photo",
    "date": "2026-01-13T22:40:19.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Photographer Insurance Guide",
    "q": "photographer insurance guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Insurance Guide</b><br>Let’s face it, photography is not a cheap venture to get into. Regardless of whether you’re a professional or a hobbyist, buying and keeping your gear up-to-date can be very expensive. Because of this, it’s incredibly important to keep you…<br><a href=\"https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/",
    "topic": "photo",
    "date": "2026-01-09T06:37:32.000Z"
  },
  {
    "title": "15 Tips for Teaching Photography Workshops",
    "q": "15 tips for teaching photography workshops camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>15 Tips for Teaching Photography Workshops</b><br>Hosting a photography workshop may not be the easiest way to earn additional income, but it can prove rewarding when done right. Should you choose to teach one, follow these 15 tips to help ensure that your workshop is a success!<br><a href=\"https://www.slrlounge.com/tips-for-a-photography-workshop/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tips-for-a-photography-workshop/",
    "topic": "photo",
    "date": "2026-01-08T06:35:30.000Z"
  },
  {
    "title": "Nikon Announces the NIKKOR Z 24-105mm f/4-7.1: A Compact Full-Frame Zoom Built for Everyday Versatility",
    "q": "nikon announces the nikkor z 24-105mm f/4-7.1: a compact full-frame zoom built for everyday versatility camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon Announces the NIKKOR Z 24-105mm f/4-7.1: A Compact Full-Frame Zoom Built for Everyday Versatility</b><br>Nikon has officially announced the NIKKOR Z 24-105mm f/4-7.1, a new standard zoom lens for its full-frame Z-mount system. Priced at $549.95 and scheduled to ship in mid-January 2026, the lens targets photographers and hybrid shooters seeki…<br><a href=\"https://www.slrlounge.com/nikon-announces-the-nikkor-z-24-105mm-f-4-7-1-a-compact-full-frame-zoom-built-for-everyday-versatility/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/nikon-announces-the-nikkor-z-24-105mm-f-4-7-1-a-compact-full-frame-zoom-built-for-everyday-versatility/",
    "topic": "photo",
    "date": "2026-01-07T17:23:31.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "Review: NEEWER Z160 Retro Camera Flash",
    "q": "review: neewer z160 retro camera flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: NEEWER Z160 Retro Camera Flash</b><br>THE NEEWER Z160 Retro Camera Flash is a fun, versatile, cool-looking compact and affordable on-camera flash aimed at beginner photographers. It could not be easier to use! It’s also surprisingly useful for a variety of applications. Note: …<br><a href=\"https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/",
    "topic": "photo",
    "date": "2025-12-09T19:00:00.000Z"
  },
  {
    "title": "Inside the White House shitposting machine",
    "q": "inside the white house shitposting machine windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Inside the White House shitposting machine</b><br>Screens at the White House display AI-modified videos of House Minority Leader Hakeem Jeffries (D-NY) and U.S. Senate Minority Leader Chuck Schumer (D-NY) that were shared on social media by President Donald Trump. | Credit: Alex Wong/Gett…<br><a href=\"https://www.theverge.com/column/861476/trump-memes-venezuela-ice-shooting\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/column/861476/trump-memes-venezuela-ice-shooting",
    "topic": "it",
    "date": "2026-01-13T23:27:00.000Z"
  },
  {
    "title": "WeatherTech founder might be the newest US consumer protection official",
    "q": "weathertech founder might be the newest us consumer protection official windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>WeatherTech founder might be the newest US consumer protection official</b><br>President Donald Trump made an unconventional pick for his nomination to the Federal Trade Commission: WeatherTech founder and CEO David MacNeil. MacNeil founded the company, which makes weather-resistant car floor mats, in 1989, according…<br><a href=\"https://www.theverge.com/news/861560/weathertech-founder-david-macneil-federal-trade-commission\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/861560/weathertech-founder-david-macneil-federal-trade-commission",
    "topic": "it",
    "date": "2026-01-13T22:28:00.000Z"
  },
  {
    "title": "I tested several cases for the Switch 2 and these are the best",
    "q": "i tested several cases for the switch 2 and these are the best windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tested several cases for the Switch 2 and these are the best</b><br>Our picks include carrying cases and ones you can leave on during handheld and docked play. | Image: The Verge, Getty Images You might find it kind of sad to put your hard-earned Switch 2 into a protective case. To me, it’s freeing. Sure, …<br><a href=\"https://www.theverge.com/reviews/691319/best-switch-2-cases\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/reviews/691319/best-switch-2-cases",
    "topic": "it",
    "date": "2026-01-13T21:25:05.000Z"
  },
  {
    "title": "The best phone to buy right now",
    "q": "the best phone to buy right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best phone to buy right now</b><br>Haven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable…<br><a href=\"https://www.theverge.com/22163811/best-phone\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22163811/best-phone",
    "topic": "it",
    "date": "2026-01-13T20:51:53.000Z"
  },
  {
    "title": "The best noise-canceling headphones to buy right now",
    "q": "the best noise-canceling headphones to buy right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best noise-canceling headphones to buy right now</b><br>Whether you’re wearing them for the morning commute, while traveling, or if you’re simply trying to find some peace and quiet while working at home, noise-canceling headphones are a more essential piece of kit nowadays than ever before. An…<br><a href=\"https://www.theverge.com/21345733/best-noise-canceling-headphones\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21345733/best-noise-canceling-headphones",
    "topic": "it",
    "date": "2026-01-13T20:25:49.000Z"
  },
  {
    "title": " \"We will set a high bar\" - Microsoft reveals multiple new data centers, and promises your energy bills won't go up to pay for them ",
    "q": " \"we will set a high bar\" - microsoft reveals multiple new data centers, and promises your energy bills won't go up to pay for them  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> \"We will set a high bar\" - Microsoft reveals multiple new data centers, and promises your energy bills won't go up to pay for them </b><br>Microsoft promises to break the age-old tradition of passing costs on to the consumer.<br><a href=\"https://www.techradar.com/pro/we-will-set-a-high-bar-microsoft-reveals-multiple-new-data-centers-but-says-your-energy-bills-wont-go-up-to-pay-for-them\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/we-will-set-a-high-bar-microsoft-reveals-multiple-new-data-centers-but-says-your-energy-bills-wont-go-up-to-pay-for-them",
    "topic": "it",
    "date": "2026-01-14T12:25:00.000Z"
  },
  {
    "title": "Your iPhone 15 Pro Can Access Apple's Visual Intelligence. Here's How",
    "q": "your iphone 15 pro can access apple's visual intelligence. here's how windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Your iPhone 15 Pro Can Access Apple's Visual Intelligence. Here's How</b><br>You don't need an iPhone 16 or iPhone 17 to access this Apple Intelligence feature.<br><a href=\"https://www.cnet.com/tech/services-and-software/apple-iphone-15-pro-visual-intelligence-control-center/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/apple-iphone-15-pro-visual-intelligence-control-center/",
    "topic": "it",
    "date": "2026-01-14T11:01:15.000Z"
  },
  {
    "title": "These 7 Linux commands are deprecated so don't use them - here's why",
    "q": "these 7 linux commands are deprecated so don't use them - here's why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These 7 Linux commands are deprecated so don't use them - here's why</b><br>Certain Linux commands are no longer maintained for a number of reasons - including security vulnerabilities. Here's the list.<br><a href=\"https://www.zdnet.com/article/linux-commands-deprecated-why-do-not-use/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/linux-commands-deprecated-why-do-not-use/",
    "topic": "it",
    "date": "2026-01-14T12:00:43.000Z"
  },
  {
    "title": "I'm a creator and my new favorite Linux distro is multimedia perfection - here's why",
    "q": "i'm a creator and my new favorite linux distro is multimedia perfection - here's why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I'm a creator and my new favorite Linux distro is multimedia perfection - here's why</b><br>Several Linux distributions are specifically geared towards multimedia creators, but Modicia OS stands out to me for several reasons.<br><a href=\"https://www.zdnet.com/article/modicia-os-favorite-linux-distro-multimedia-creative/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/modicia-os-favorite-linux-distro-multimedia-creative/",
    "topic": "it",
    "date": "2026-01-14T10:00:51.000Z"
  },
  {
    "title": "I watched a live NBA game on Apple Vision Pro for 3 hours - it let me down in the best way",
    "q": "i watched a live nba game on apple vision pro for 3 hours - it let me down in the best way windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I watched a live NBA game on Apple Vision Pro for 3 hours - it let me down in the best way</b><br>All the basketball action, none of the sweat, spilled beers, and gruesome ad breaks.<br><a href=\"https://www.zdnet.com/article/apple-vision-pro-nba-lakers-immersive-hands-on/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/apple-vision-pro-nba-lakers-immersive-hands-on/",
    "topic": "it",
    "date": "2026-01-14T02:51:00.000Z"
  },
  {
    "title": " GOG's new owner brands Windows as poor quality while he ponders Linux support — \"I'm not surprised that people gravitate outside of the Windows ecosystem.\" ",
    "q": " gog's new owner brands windows as poor quality while he ponders linux support — \"i'm not surprised that people gravitate outside of the windows ecosystem.\"  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> GOG's new owner brands Windows as poor quality while he ponders Linux support — \"I'm not surprised that people gravitate outside of the Windows ecosystem.\" </b><br>GOG’s new owner, Michał Kiciński, has criticised Windows as poor-quality software, as the DRM-free PC game store begins exploring stronger Linux support for the future.<br><a href=\"https://www.windowscentral.com/gaming/pc-gaming/gog-new-owner-brands-windows-as-poor-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/pc-gaming/gog-new-owner-brands-windows-as-poor-quality",
    "topic": "it",
    "date": "2026-01-14T12:15:00.000Z"
  },
  {
    "title": " Microsoft isn't deleting your Windows 11 files, but OneDrive's sync system is causing confusion and frustration: \"I think they should have to go to jail for this.\" ",
    "q": " microsoft isn't deleting your windows 11 files, but onedrive's sync system is causing confusion and frustration: \"i think they should have to go to jail for this.\"  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft isn't deleting your Windows 11 files, but OneDrive's sync system is causing confusion and frustration: \"I think they should have to go to jail for this.\" </b><br>Microsoft hasn't deleted your files from your local folders; they have just been relocated and synced to OneDrive because the backup feature was enabled by default when upgrading to Windows 11, version 25H2.<br><a href=\"https://www.windowscentral.com/software-apps/microsoft-isnt-deleting-your-windows-11-files-onedrive-sync-confusion\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/microsoft-isnt-deleting-your-windows-11-files-onedrive-sync-confusion",
    "topic": "it",
    "date": "2026-01-14T12:00:00.000Z"
  },
  {
    "title": " Microsoft claims \"Community First\" AI data center infrastructure — also known as maximum corpo-washing ",
    "q": " microsoft claims \"community first\" ai data center infrastructure — also known as maximum corpo-washing  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft claims \"Community First\" AI data center infrastructure — also known as maximum corpo-washing </b><br>Microsoft has begun to realize the backlash to its AI infrastructure push is serious enough to create an entire \"Community First\" data center plan.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsoft-building-community-first-ai-data-center-infrastructure-sounds-like-corpo-washing\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsoft-building-community-first-ai-data-center-infrastructure-sounds-like-corpo-washing",
    "topic": "it",
    "date": "2026-01-14T11:00:00.000Z"
  },
  {
    "title": " One of the best Xbox Play Anywhere games just got its notorious save bug fixed for Xbox Ally and Xbox PC ",
    "q": " one of the best xbox play anywhere games just got its notorious save bug fixed for xbox ally and xbox pc  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> One of the best Xbox Play Anywhere games just got its notorious save bug fixed for Xbox Ally and Xbox PC </b><br>We complained and moaned, and Xbox listened. Kojima Productions, Xbox, and 505 Games collaborate on a strange bug preventing save files from working correctly for Death Stranding on Xbox PC / Xbox Ally.<br><a href=\"https://www.windowscentral.com/gaming/pc-gaming/death-stranding-xbox-pc-save-bug-fixed\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/pc-gaming/death-stranding-xbox-pc-save-bug-fixed",
    "topic": "it",
    "date": "2026-01-14T10:30:04.000Z"
  },
  {
    "title": " The first Windows 11 OS update for 2026 is now rolling out with important fixes — including one that impacts battery life on PCs with an NPU ",
    "q": " the first windows 11 os update for 2026 is now rolling out with important fixes — including one that impacts battery life on pcs with an npu  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The first Windows 11 OS update for 2026 is now rolling out with important fixes — including one that impacts battery life on PCs with an NPU </b><br>The first Windows 11 OS update for 2026 is now rolling out with important fixes — including one that impacts battery life on PCs with an NPU<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-11-kb5074109-january-2026-security-update-available-now-npu-battery-life-fix\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/windows-11-kb5074109-january-2026-security-update-available-now-npu-battery-life-fix",
    "topic": "it",
    "date": "2026-01-14T09:17:32.000Z"
  },
  {
    "title": " Help shape the future of Windows Central with our audience survey ",
    "q": " help shape the future of windows central with our audience survey  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Help shape the future of Windows Central with our audience survey </b><br>Your input will guide future coverage, features, and community initiatives.<br><a href=\"https://www.windowscentral.com/microsoft/windows/help-shape-the-future-of-windows-central-with-our-audience-survey\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows/help-shape-the-future-of-windows-central-with-our-audience-survey",
    "topic": "it",
    "date": "2026-01-13T20:53:33.000Z"
  },
  {
    "title": "Cloud marketplace Pax8 accidentally exposes data on 1,800 MSP partners",
    "q": "cloud marketplace pax8 accidentally exposes data on 1,800 msp partners windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Cloud marketplace Pax8 accidentally exposes data on 1,800 MSP partners</b><br>Cloud marketplace and distributor Pax8 has confirmed that it mistakenly sent an email to fewer than 40 UK-based partners containing a spreadsheet with internal business information, including MSP customer and Microsoft licensing data. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/cloud-marketplace-pax8-accidentally-exposes-data-on-1-800-msp-partners/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/cloud-marketplace-pax8-accidentally-exposes-data-on-1-800-msp-partners/",
    "topic": "it",
    "date": "2026-01-14T12:01:07.000Z"
  },
  {
    "title": "Microsoft: Windows 365 update blocks access to Cloud PC sessions",
    "q": "microsoft: windows 365 update blocks access to cloud pc sessions windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows 365 update blocks access to Cloud PC sessions</b><br>Microsoft confirmed that a recent Windows 365 update is blocking customers from accessing their Microsoft 365 Cloud PC sessions. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-365-update-blocks-access-to-cloud-pc-sessions/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-365-update-blocks-access-to-cloud-pc-sessions/",
    "topic": "it",
    "date": "2026-01-14T09:55:06.000Z"
  },
  {
    "title": "New VoidLink malware framework targets Linux cloud servers",
    "q": "new voidlink malware framework targets linux cloud servers windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New VoidLink malware framework targets Linux cloud servers</b><br>A newly discovered advanced cloud-native Linux malware framework named VoidLink focuses on cloud environments, providing attackers with custom loaders, implants, rootkits, and plugins designed for modern infrastructures. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/new-voidlink-malware-framework-targets-linux-cloud-servers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/new-voidlink-malware-framework-targets-linux-cloud-servers/",
    "topic": "it",
    "date": "2026-01-13T22:12:20.000Z"
  },
  {
    "title": "New Windows updates replace expiring Secure Boot certificates",
    "q": "new windows updates replace expiring secure boot certificates windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New Windows updates replace expiring Secure Boot certificates</b><br>Microsoft has started rolling out new Secure Boot certificates that will automatically install on eligible Windows 11 24H2 and 25H2 systems. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/microsoft-rolls-out-new-secure-boot-certificates-for-windows-devices/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-rolls-out-new-secure-boot-certificates-for-windows-devices/",
    "topic": "it",
    "date": "2026-01-13T19:57:33.000Z"
  },
  {
    "title": "Microsoft releases Windows 10 KB5073724 extended security update",
    "q": "microsoft releases windows 10 kb5073724 extended security update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft releases Windows 10 KB5073724 extended security update</b><br>Microsoft has released the KB5073724 extended security update to fix the Patch Tuesday security updates, including 3 zero-days and a fix for expiring Secure Boot certificates. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-windows-10-kb5073724-extended-security-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-windows-10-kb5073724-extended-security-update/",
    "topic": "it",
    "date": "2026-01-13T18:56:21.000Z"
  },
  {
    "title": "Why I can't quit Excel: 5 desktop features open-source alternatives are missing",
    "q": "why i can't quit excel: 5 desktop features open-source alternatives are missing windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Why I can't quit Excel: 5 desktop features open-source alternatives are missing</b><br>From Power Query to the Data Model, here are the five architectural gaps that keep me paying for Microsoft 365.<br><a href=\"https://www.howtogeek.com/microsoft-excel-cant-quit-desktop-features-open-source-alternatives-are-missing/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-cant-quit-desktop-features-open-source-alternatives-are-missing/",
    "topic": "it",
    "date": "2026-01-14T11:30:15.000Z"
  },
  {
    "title": "Jellyfin's Roku app has a new coat of paint",
    "q": "jellyfin's roku app has a new coat of paint windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Jellyfin's Roku app has a new coat of paint</b><br>Don't worry, it's not like Plex's Roku app update.<br><a href=\"https://www.howtogeek.com/jellyfin-on-roku-just-got-a-big-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/jellyfin-on-roku-just-got-a-big-update/",
    "topic": "it",
    "date": "2026-01-13T21:16:49.000Z"
  },
  {
    "title": "My favorite Windows 11 modding tool just made adjusting app volumes a breeze",
    "q": "my favorite windows 11 modding tool just made adjusting app volumes a breeze windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>My favorite Windows 11 modding tool just made adjusting app volumes a breeze</b><br>Another win for the hawk.<br><a href=\"https://www.xda-developers.com/my-favorite-windows-11-modding-tool-just-made-adjusting-app-volumes-a-breeze/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/my-favorite-windows-11-modding-tool-just-made-adjusting-app-volumes-a-breeze/",
    "topic": "it",
    "date": "2026-01-14T07:29:48.000Z"
  },
  {
    "title": "I tried Microsoft's NotebookLM rival in OneNote and it's amazing",
    "q": "i tried microsoft's notebooklm rival in onenote and it's amazing windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tried Microsoft's NotebookLM rival in OneNote and it's amazing</b><br>Copilot Notebooks are the future<br><a href=\"https://www.xda-developers.com/copilot-notebooks-is-the-best-feature-of-onenote/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/copilot-notebooks-is-the-best-feature-of-onenote/",
    "topic": "it",
    "date": "2026-01-14T02:00:20.000Z"
  }
]