[
  {
    "title": "Uncovering the Secret Lenses Inside Old-School Analog Photo Booths",
    "q": "uncovering the secret lenses inside old-school analog photo booths camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Uncovering the Secret Lenses Inside Old-School Analog Photo Booths</b><br>Photographer and YouTube creator Mathieu Stern loves vintage lenses. He also loves vintage analog photo booths. So Stern set out to find out exactly which lenses are used in old-school film photo booths so he could recreate the exact look …<br><a href=\"https://petapixel.com/2026/01/16/uncovering-the-secret-lenses-inside-old-school-analog-photo-booths/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/uncovering-the-secret-lenses-inside-old-school-analog-photo-booths/",
    "topic": "photo",
    "date": "2026-01-16T21:47:37.000Z"
  },
  {
    "title": "Brightin Star Launches $270 MF 50mm f/1.05 Full-Frame Lens",
    "q": "brightin star launches $270 mf 50mm f/1.05 full-frame lens camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Brightin Star Launches $270 MF 50mm f/1.05 Full-Frame Lens</b><br>Brightin Star has announced the MF 50mm f/1.05, a full-frame manual-focus prime lens designed for mirrorless cameras across E, RF, Z, and L mounts. Featuring an ultra-fast maximum aperture and a classic 50mm focal length, the lens targets …<br><a href=\"https://petapixel.com/2026/01/16/brightin-star-launches-270-mf-50mm-f-1-05-full-frame-lens/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/brightin-star-launches-270-mf-50mm-f-1-05-full-frame-lens/",
    "topic": "photo",
    "date": "2026-01-16T20:53:20.000Z"
  },
  {
    "title": "No, the Fujifilm X-H2S Has Not Been Discontinued",
    "q": "no, the fujifilm x-h2s has not been discontinued camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>No, the Fujifilm X-H2S Has Not Been Discontinued</b><br>There has been speculation that the Fujifilm X-H2S might be on its last legs, but Fujifilm tells PetaPixel the camera remains an active product for the company. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/no-the-fujifilm-x-h2s-has-not-been-discontinued/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/no-the-fujifilm-x-h2s-has-not-been-discontinued/",
    "topic": "photo",
    "date": "2026-01-16T20:15:01.000Z"
  },
  {
    "title": "Honor Magic 8 Pro Review: A Camera Caught Between Instinct and Algorithm",
    "q": "honor magic 8 pro review: a camera caught between instinct and algorithm camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Honor Magic 8 Pro Review: A Camera Caught Between Instinct and Algorithm</b><br>The Honor Magic 8 Pro is part photography upstart and part AI canvas in how it approaches still photos, relying more and more on what machine learning can do along the way. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/honor-magic-8-pro-review-a-camera-caught-between-instinct-and-algorithm/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/honor-magic-8-pro-review-a-camera-caught-between-instinct-and-algorithm/",
    "topic": "photo",
    "date": "2026-01-16T17:41:53.000Z"
  },
  {
    "title": "Photographing Vietnam With Just Two Prime Lenses",
    "q": "photographing vietnam with just two prime lenses camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Vietnam With Just Two Prime Lenses</b><br>A few months ago, I traveled to Vietnam with my family, and I only had 11 days to experience as much of the country as I could. From the chaotic energy of Hanoi’s streets, to the preserved stillness of Hoi An, the calm waters of Ha Long Ba…<br><a href=\"https://petapixel.com/2026/01/16/photographing-vietnam-with-just-two-prime-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/photographing-vietnam-with-just-two-prime-lenses/",
    "topic": "photo",
    "date": "2026-01-16T16:35:06.000Z"
  },
  {
    "title": "The Story of ‘Grace,’ The Only Official State Photograph in the US",
    "q": "the story of ‘grace,’ the only official state photograph in the us camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Story of ‘Grace,’ The Only Official State Photograph in the US</b><br>When Eric Enstrom entered his photograph of Charles Wilden sitting at a table with his head bowed into a Minnesota photo contest, it lost because the judges thought it didn't make enough use of light. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/the-story-of-grace-the-only-official-state-photograph-in-the-us/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/the-story-of-grace-the-only-official-state-photograph-in-the-us/",
    "topic": "photo",
    "date": "2026-01-16T16:20:49.000Z"
  },
  {
    "title": "As Monkeys Escape Onto the Streets of St. Louis, AI Photos Add to the Chaos",
    "q": "as monkeys escape onto the streets of st. louis, ai photos add to the chaos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>As Monkeys Escape Onto the Streets of St. Louis, AI Photos Add to the Chaos</b><br>This week in Missouri, a band of vervet monkeys and a single goat were spotted roaming the streets of St. Louis. But while it made international headlines, it was further complicated by an avalanche of AI-generated photos. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/as-monkeys-escape-onto-the-streets-of-st-louis-ai-photos-add-to-the-chaos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/as-monkeys-escape-onto-the-streets-of-st-louis-ai-photos-add-to-the-chaos/",
    "topic": "photo",
    "date": "2026-01-16T16:13:55.000Z"
  },
  {
    "title": "Take Advantage of These Great Fujifilm Deals Before They’re Gone",
    "q": "take advantage of these great fujifilm deals before they’re gone camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Take Advantage of These Great Fujifilm Deals Before They’re Gone</b><br>As 2026 gets underway, Fujifilm photographers have a rare chance to upgrade their kits with deep discounts across X Series and GFX cameras and lenses. From long-reach wildlife glass and fast primes to medium format optics built for ultimat…<br><a href=\"https://petapixel.com/2026/01/16/ring-in-2026-with-major-deals-on-fujifilm-cameras-and-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/ring-in-2026-with-major-deals-on-fujifilm-cameras-and-lenses/",
    "topic": "photo",
    "date": "2026-01-16T16:04:08.000Z"
  },
  {
    "title": "Chart-Topping Sony a7 V Outsold the Next Four Cameras Combined at Map Camera",
    "q": "chart-topping sony a7 v outsold the next four cameras combined at map camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Chart-Topping Sony a7 V Outsold the Next Four Cameras Combined at Map Camera</b><br>At the risk of sounding like a broken record, the Sony a7 V topped Map Camera's monthly sales charts for December, the new mid-range full-frame mirrorless camera's debut month. [Read More]<br><a href=\"https://petapixel.com/2026/01/16/chart-topping-sony-a7-v-outsold-the-next-four-cameras-combined-at-map-camera/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/chart-topping-sony-a7-v-outsold-the-next-four-cameras-combined-at-map-camera/",
    "topic": "photo",
    "date": "2026-01-16T15:32:32.000Z"
  },
  {
    "title": "Humpback Whales Swimming in Sync Wins Underwater Photo Competition",
    "q": "humpback whales swimming in sync wins underwater photo competition camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Humpback Whales Swimming in Sync Wins Underwater Photo Competition</b><br>The winners of the Dive Photo Guide (DPG) Masters Underwater Imaging Competition 2025 have been announced. The contest invited submissions to nine image categories and one video category, and more than 2,000 entries were received from unde…<br><a href=\"https://petapixel.com/2026/01/16/humpback-whales-swimming-in-sync-wins-underwater-photo-competition/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/16/humpback-whales-swimming-in-sync-wins-underwater-photo-competition/",
    "topic": "photo",
    "date": "2026-01-16T14:00:42.000Z"
  },
  {
    "title": "From whales to coral reefs, this photo contest showcases underwater excellence",
    "q": "from whales to coral reefs, this photo contest showcases underwater excellence camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>From whales to coral reefs, this photo contest showcases underwater excellence</b><br>2025 DPG Masters Underwater Imaging Competition DivePhotoGuide (DPG) has announced the winners of its Masters Underwater Imaging Competition 2025. The contest consists of nine image categories, including wide angle, macro, over-under, comp…<br><a href=\"https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition",
    "topic": "photo",
    "date": "2026-01-16T15:16:00.000Z"
  },
  {
    "title": "Timed-to-perfection moments from the World Sports Photography Awards",
    "q": "timed-to-perfection moments from the world sports photography awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Timed-to-perfection moments from the World Sports Photography Awards</b><br>2026 World Sports Photography Awards The winners of the 2026 World Sports Photography Awards have been announced, highlighting impeccable timing, dramatic lighting and memorable moments. The contest showcases work from sports photographers…<br><a href=\"https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards",
    "topic": "photo",
    "date": "2026-01-15T18:55:00.000Z"
  },
  {
    "title": "Sony a7 V video studio scene: what do you really need?",
    "q": "sony a7 v video studio scene: what do you really need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony a7 V video studio scene: what do you really need?</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We've taken a look at how the Sony a7 V performs when it comes to stills, now it's time to turn our attention to video. The company's latest…<br><a href=\"https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene",
    "topic": "photo",
    "date": "2026-01-15T14:00:00.000Z"
  },
  {
    "title": "Breaking Leica's monopoly: Ricoh releases GR IV Mono",
    "q": "breaking leica's monopoly: ricoh releases gr iv mono camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Breaking Leica's monopoly: Ricoh releases GR IV Mono</b><br>When you use DPReview links to buy products, the site may earn a commission. Sample gallery This widget is not optimized for RSS feed readers. Please open this article's permalink in a browser to view this content. Product photos: Richard …<br><a href=\"https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch",
    "topic": "photo",
    "date": "2026-01-14T22:00:00.000Z"
  },
  {
    "title": "Question of the week: What projects are you undertaking to move your photography forward?",
    "q": "question of the week: what projects are you undertaking to move your photography forward? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What projects are you undertaking to move your photography forward?</b><br>All photographers inevitably deal with creative droughts or periods when they feel their skills have plateaued. At the end of last year, I wrote about part of why (and how) that's manifested for me over the past few years. For me, one comm…<br><a href=\"https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/",
    "topic": "photo",
    "date": "2026-01-14T15:50:00.000Z"
  },
  {
    "title": "Fujifilm fully raises the curtain on the cinematic Instax",
    "q": "fujifilm fully raises the curtain on the cinematic instax camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm fully raises the curtain on the cinematic Instax</b><br>Image: Fujifilm Last week, Fujifilm Japan launched a surprising and rather controversial new offering in its Instax lineup, the Instax Mini Evo Cinema. The company has now announced the global release of the hybrid camera, providing more d…<br><a href=\"https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0301464126/fujifilm-fully-raises-the-curtain-on-the-cinematic-instax",
    "topic": "photo",
    "date": "2026-01-14T02:00:00.000Z"
  },
  {
    "title": "Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor",
    "q": "eric fossum earns the prestigious draper prize for pioneering the cmos image sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor</b><br>Image: Draper Eric Fossum, the inventor of the modern CMOS image sensor and a longtime friend of DPReview, was recently awarded the 2026 Charles Stark Draper Prize for Engineering. The award, which is granted every two years by the Nationa…<br><a href=\"https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor",
    "topic": "photo",
    "date": "2026-01-13T20:10:00.000Z"
  },
  {
    "title": "Apple’s new Creative Cloud competitor lets you edit photos, music and video",
    "q": "apple’s new creative cloud competitor lets you edit photos, music and video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple’s new Creative Cloud competitor lets you edit photos, music and video</b><br>Image: Apple Apple has announced a new app bundle for creatives dubbed Apple Creator Studio. The subscription serves as somewhat of an alternative to Adobe's Creative Cloud, as it includes apps for photo, video and music editing, plus Appl…<br><a href=\"https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video",
    "topic": "photo",
    "date": "2026-01-13T18:31:00.000Z"
  },
  {
    "title": "Will SD cards remain forever stuck in the past?",
    "q": "will sd cards remain forever stuck in the past? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Will SD cards remain forever stuck in the past?</b><br>With no sign of faster SD cards, the CFexpress format is currently coming out on top. Photo: Richard Butler This year's CES trade show came and went with no apparent progress for the SD memory card format, despite higher speeds and capacit…<br><a href=\"https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past",
    "topic": "photo",
    "date": "2026-01-13T15:00:00.000Z"
  },
  {
    "title": "Portrait of Britain: Celebrating the faces that define a nation",
    "q": "portrait of britain: celebrating the faces that define a nation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Portrait of Britain: Celebrating the faces that define a nation</b><br>Portrait of Britain Vol. 8 Winners The British Journal of Photography has announced the winners of Portrait of Britain Vol. 8. The contest, which began in 2016, aims to celebrate the diverse mosaic of individuals who make up Great Britain …<br><a href=\"https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation",
    "topic": "photo",
    "date": "2026-01-12T21:48:00.000Z"
  },
  {
    "title": " This quantum camera captures 96% more light than standard sensors – and it's backed by US$4.2 million in funding  ",
    "q": " this quantum camera captures 96% more light than standard sensors – and it's backed by us$4.2 million in funding   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This quantum camera captures 96% more light than standard sensors – and it's backed by US$4.2 million in funding  </b><br>A quantum camera that captures far more than we thought possible – it counts individual photons and could redefine space imaging<br><a href=\"https://www.digitalcameraworld.com/cameras/this-quantum-camera-captures-96-percent-more-light-than-standard-sensors-and-its-backed-by-us-usd4-2-million-in-funding\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/this-quantum-camera-captures-96-percent-more-light-than-standard-sensors-and-its-backed-by-us-usd4-2-million-in-funding",
    "topic": "photo",
    "date": "2026-01-16T22:23:19.000Z"
  },
  {
    "title": " Film photography is making a comeback. As a photographer, these are the two types of film cameras that I think are the easiest to start with ",
    "q": " film photography is making a comeback. as a photographer, these are the two types of film cameras that i think are the easiest to start with  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Film photography is making a comeback. As a photographer, these are the two types of film cameras that I think are the easiest to start with </b><br>If you're nervous about trying film photography for the first time, I recommend getting a taste of analog with a disposable camera or instant film<br><a href=\"https://www.digitalcameraworld.com/cameras/film-cameras/film-photography-is-making-a-comeback-as-a-photographer-these-are-the-two-types-of-film-cameras-that-i-think-are-the-easiest-to-start-with\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/film-cameras/film-photography-is-making-a-comeback-as-a-photographer-these-are-the-two-types-of-film-cameras-that-i-think-are-the-easiest-to-start-with",
    "topic": "photo",
    "date": "2026-01-16T18:30:11.000Z"
  },
  {
    "title": " This cheap compact camera beat pro mirrorless. The most popular cameras of 2025 at this US retailer are a strange mix of cheap compacts and high-end mirrorless cameras ",
    "q": " this cheap compact camera beat pro mirrorless. the most popular cameras of 2025 at this us retailer are a strange mix of cheap compacts and high-end mirrorless cameras  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This cheap compact camera beat pro mirrorless. The most popular cameras of 2025 at this US retailer are a strange mix of cheap compacts and high-end mirrorless cameras </b><br>According to US retailer B&H, these are the most popular cameras of 2025, a list that ranges from $30 compact cameras to high-end mirrorless<br><a href=\"https://www.digitalcameraworld.com/cameras/this-cheap-compact-camera-beat-pro-mirrorless-the-most-popular-cameras-of-2025-at-this-us-retailer-are-a-strange-mix-of-cheap-compacts-and-high-end-mirrorless-cameras\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/this-cheap-compact-camera-beat-pro-mirrorless-the-most-popular-cameras-of-2025-at-this-us-retailer-are-a-strange-mix-of-cheap-compacts-and-high-end-mirrorless-cameras",
    "topic": "photo",
    "date": "2026-01-16T15:50:27.000Z"
  },
  {
    "title": " Watch out, Sony and Canon: Tamron has designed a 28-70mm f/2 lens to  rival your US$3,300+ optics ",
    "q": " watch out, sony and canon: tamron has designed a 28-70mm f/2 lens to  rival your us$3,300+ optics  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Watch out, Sony and Canon: Tamron has designed a 28-70mm f/2 lens to  rival your US$3,300+ optics </b><br>Tamron is exploring the ultra-fast standard zoom market, but with a design that promises prime-like brightness in a smaller, lighter and more affordable package<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/watch-out-sony-and-canon-tamron-has-designed-a-28-70mm-f-2-lens-to-rival-your-us-usd3-300-optics\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/watch-out-sony-and-canon-tamron-has-designed-a-28-70mm-f-2-lens-to-rival-your-us-usd3-300-optics",
    "topic": "photo",
    "date": "2026-01-16T14:40:19.000Z"
  },
  {
    "title": " Get \"one of the finest Nikon Z lenses\" for only £699 ",
    "q": " get \"one of the finest nikon z lenses\" for only £699  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Get \"one of the finest Nikon Z lenses\" for only £699 </b><br>Save £60 on the Nikkor Z MC 105mm f/2.8 VR S, which is perfect for capturing wildlife, portrait, landscape, and macro photography<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/get-one-of-the-finest-nikon-z-lenses-for-only-gbp699\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/get-one-of-the-finest-nikon-z-lenses-for-only-gbp699",
    "topic": "photo",
    "date": "2026-01-16T14:34:40.000Z"
  },
  {
    "title": " Save £950 on Sony's highest-resolution full-frame camera! ",
    "q": " save £950 on sony's highest-resolution full-frame camera!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Save £950 on Sony's highest-resolution full-frame camera! </b><br>The Sony A7R IVA comes with a 61MP full-frame sensor and rivals medium-format photography<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/save-gbp950-on-sonys-highest-resolution-full-frame-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/save-gbp950-on-sonys-highest-resolution-full-frame-camera",
    "topic": "photo",
    "date": "2026-01-16T14:20:52.000Z"
  },
  {
    "title": " Voigtlander announces new portrait prime for Canon RF and Nikon Z cameras ",
    "q": " voigtlander announces new portrait prime for canon rf and nikon z cameras  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Voigtlander announces new portrait prime for Canon RF and Nikon Z cameras </b><br>Complete with bokeh control!<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/voigtlander-announces-new-portrait-prime-for-canon-rf-and-nikon-z-cameras\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/voigtlander-announces-new-portrait-prime-for-canon-rf-and-nikon-z-cameras",
    "topic": "photo",
    "date": "2026-01-16T12:56:02.000Z"
  },
  {
    "title": " This cheap compact camera beat pro mirrorless. The most popular cameras of 2025 at this US retailer are a strange mix of cheap compacts and high-end mirrorless ",
    "q": " this cheap compact camera beat pro mirrorless. the most popular cameras of 2025 at this us retailer are a strange mix of cheap compacts and high-end mirrorless  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This cheap compact camera beat pro mirrorless. The most popular cameras of 2025 at this US retailer are a strange mix of cheap compacts and high-end mirrorless </b><br>According to US retailer B&H, these are the most popular cameras of 2025, a list that ranges from $30 compact cameras to high-end mirrorless<br><a href=\"https://www.digitalcameraworld.com/cameras/this-cheap-compact-camera-beat-pro-mirrorless-the-most-popular-cameras-of-2025-at-this-us-retailer-are-a-strange-mix-of-cheap-compacts-and-high-end-mirrorless\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/this-cheap-compact-camera-beat-pro-mirrorless-the-most-popular-cameras-of-2025-at-this-us-retailer-are-a-strange-mix-of-cheap-compacts-and-high-end-mirrorless",
    "topic": "photo",
    "date": "2026-01-16T12:18:39.000Z"
  },
  {
    "title": "Dynamic 3-Light Sports Portrait Setup",
    "q": "dynamic 3-light sports portrait setup camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Dynamic 3-Light Sports Portrait Setup</b><br>When it comes to taking sports photography portraits, capturing dynamic energy is the name of the game. Sports portraits often convey a sense of action and energy with dramatic poses and lighting, the latter of which often relies on using …<br><a href=\"https://www.slrlounge.com/dynamic-3-light-sports-portrait-setup/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dynamic-3-light-sports-portrait-setup/",
    "topic": "photo",
    "date": "2026-01-16T20:25:28.000Z"
  },
  {
    "title": "3 Ways To Photograph Family Group Photos With Flash",
    "q": "3 ways to photograph family group photos with flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>3 Ways To Photograph Family Group Photos With Flash</b><br>Setting up one directional off-camera flash with a shoot-through umbrella may be your go-to lighting setup for family formals, but what other ways can you light a group of people to create more drama or visual interest? Light alters the mo…<br><a href=\"https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/",
    "topic": "photo",
    "date": "2026-01-14T19:59:28.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Photographer Insurance Guide",
    "q": "photographer insurance guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Insurance Guide</b><br>Let’s face it, photography is not a cheap venture to get into. Regardless of whether you’re a professional or a hobbyist, buying and keeping your gear up-to-date can be very expensive. Because of this, it’s incredibly important to keep you…<br><a href=\"https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/",
    "topic": "photo",
    "date": "2026-01-09T06:37:32.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "The best deals on MacBooks right now",
    "q": "the best deals on macbooks right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best deals on MacBooks right now</b><br>The 15-inch MacBook Air offers better speakers than its 13-inch sibling, but is otherwise similar. Apple currently sells MacBooks equipped with its own M-series processors in a wide range of sizes and price points, all of which run the com…<br><a href=\"https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22399419/apple-macbook-air-pro-mac-mini-imac-deals",
    "topic": "it",
    "date": "2026-01-16T23:48:15.000Z"
  },
  {
    "title": "Ted Sarandos says Netflix will commit to 45-day theatrical releases",
    "q": "ted sarandos says netflix will commit to 45-day theatrical releases windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Ted Sarandos says Netflix will commit to 45-day theatrical releases</b><br>Though Netflix's plan to buy Warner Bros. Discovery has prompted concerns about how the deal might hurt the movie theater business, the streamer's co-CEO says that there is nothing to worry about. In a new interview with The New York Times…<br><a href=\"https://www.theverge.com/streaming/863511/ted-sarandos-netflix-theatrical-movie-release-windows\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/streaming/863511/ted-sarandos-netflix-theatrical-movie-release-windows",
    "topic": "it",
    "date": "2026-01-16T18:24:07.000Z"
  },
  {
    "title": " Microsoft, Meta, and Amazon are paying up for ‘enterprise’ access to Wikipedia ",
    "q": " microsoft, meta, and amazon are paying up for ‘enterprise’ access to wikipedia  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft, Meta, and Amazon are paying up for ‘enterprise’ access to Wikipedia </b><br>Wikipedia reminds us how important it is for AI training, which is why many tech firms pay for enterprise subscriptions.<br><a href=\"https://www.techradar.com/pro/microsoft-meta-and-amazon-are-paying-up-for-enterprise-access-to-wikipedia\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/microsoft-meta-and-amazon-are-paying-up-for-enterprise-access-to-wikipedia",
    "topic": "it",
    "date": "2026-01-16T20:25:00.000Z"
  },
  {
    "title": "Verizon's $20 Credit Is Available for You to Claim Following Major Outage (Live Updates)",
    "q": "verizon's $20 credit is available for you to claim following major outage (live updates) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Verizon's $20 Credit Is Available for You to Claim Following Major Outage (Live Updates)</b><br>After the hourslong outage affected 2 million customers, the wireless carrier is offering a $20 credit per account.<br><a href=\"https://www.cnet.com/news-live/verizon-outage-january-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/news-live/verizon-outage-january-2026/",
    "topic": "it",
    "date": "2026-01-16T19:59:00.000Z"
  },
  {
    "title": "Your Bluetooth Audio Devices Could Be at Risk of Hijacking, Researchers Say",
    "q": "your bluetooth audio devices could be at risk of hijacking, researchers say windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Your Bluetooth Audio Devices Could Be at Risk of Hijacking, Researchers Say</b><br>Google says it has addressed security vulnerabilities that could affect Bluetooth products, but researchers contend that issues persist.<br><a href=\"https://www.cnet.com/tech/mobile/your-bluetooth-audio-devices-could-be-at-risk-of-hijacking-researchers-say/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/mobile/your-bluetooth-audio-devices-could-be-at-risk-of-hijacking-researchers-say/",
    "topic": "it",
    "date": "2026-01-16T19:44:00.000Z"
  },
  {
    "title": " Microsoft built a ‘Community-First AI Infrastructure’ framework for its data center projects — new policy may be the blueprint for U.S hyperscalers to follow ",
    "q": " microsoft built a ‘community-first ai infrastructure’ framework for its data center projects — new policy may be the blueprint for u.s hyperscalers to follow  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft built a ‘Community-First AI Infrastructure’ framework for its data center projects — new policy may be the blueprint for U.S hyperscalers to follow </b><br>Microsoft argues against unchecked AI infrastructure expansion, noting that these buildouts must support the community surrounding it. The move may be a blueprint for other AI hyperscalers to follow.<br><a href=\"https://www.tomshardware.com/tech-industry/microsoft-built-a-community-first-ai-infrastructure-framework-for-its-data-center-projects-new-policy-may-be-the-blueprint-for-u-s-hyperscalers-to-follow\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/microsoft-built-a-community-first-ai-infrastructure-framework-for-its-data-center-projects-new-policy-may-be-the-blueprint-for-u-s-hyperscalers-to-follow",
    "topic": "it",
    "date": "2026-01-16T16:17:23.000Z"
  },
  {
    "title": "A new earbud security flaw may expose you to remote eavesdropping - here's how to fix it",
    "q": "a new earbud security flaw may expose you to remote eavesdropping - here's how to fix it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>A new earbud security flaw may expose you to remote eavesdropping - here's how to fix it</b><br>Google Fast Pair makes pairing easy, but a flawed implementation has created a serious security risk.<br><a href=\"https://www.zdnet.com/article/whisperpair-google-fast-pair-bluetooth-headphones-attack/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/whisperpair-google-fast-pair-bluetooth-headphones-attack/",
    "topic": "it",
    "date": "2026-01-17T01:15:45.000Z"
  },
  {
    "title": " You're not alone, X (Twitter) is down as major outage impacts service [UPDATE] ",
    "q": " you're not alone, x (twitter) is down as major outage impacts service [update]  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> You're not alone, X (Twitter) is down as major outage impacts service [UPDATE] </b><br>A major outage has taken X offline for millions of users, with people reporting they are unable to access the website or the app.<br><a href=\"https://www.windowscentral.com/accessories/networking/youre-not-alone-x-twitter-is-down-as-major-outage-impacts-service-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/accessories/networking/youre-not-alone-x-twitter-is-down-as-major-outage-impacts-service-2026",
    "topic": "it",
    "date": "2026-01-16T15:58:45.000Z"
  },
  {
    "title": " You thought the New Year's sale for the Surface Pro 12-inch was crazy? — Think again because one of the best Snapdragon laptops is now under $700 ",
    "q": " you thought the new year's sale for the surface pro 12-inch was crazy? — think again because one of the best snapdragon laptops is now under $700  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> You thought the New Year's sale for the Surface Pro 12-inch was crazy? — Think again because one of the best Snapdragon laptops is now under $700 </b><br>Just a couple of weeks after its 15% New Year's discount, Microsoft's top-rated Surface Pro 12-inch laptop just received an even greater deal. For a limited time, you can own this high-performing and feature-rich laptop for under $700.<br><a href=\"https://www.windowscentral.com/hardware/laptops/you-thought-the-new-years-sale-for-the-surface-pro-12-inch-was-crazy-think-again-because-one-of-the-best-snapdragon-laptops-is-now-under-usd700\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/laptops/you-thought-the-new-years-sale-for-the-surface-pro-12-inch-was-crazy-think-again-because-one-of-the-best-snapdragon-laptops-is-now-under-usd700",
    "topic": "it",
    "date": "2026-01-16T14:16:21.000Z"
  },
  {
    "title": " A genuinely useful Windows 11 feature remains half‑implemented, forcing users to install new mods just to get the experience they expect ",
    "q": " a genuinely useful windows 11 feature remains half‑implemented, forcing users to install new mods just to get the experience they expect  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> A genuinely useful Windows 11 feature remains half‑implemented, forcing users to install new mods just to get the experience they expect </b><br>Microsoft is slacking on taskbar productivity. A new Windhawk mod proves that per-app volume control should have supported scrolling on Windows 11 feature years ago.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/i-wish-this-windows-11-feature-didnt-require-a-mod-microsoft-is-slacking\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/i-wish-this-windows-11-feature-didnt-require-a-mod-microsoft-is-slacking",
    "topic": "it",
    "date": "2026-01-16T14:09:48.000Z"
  },
  {
    "title": " Microsoft stock continues downward trend, dropping 10% — ballooning infrastructure CAPEX, shrinking AI hype, and Google blamed ",
    "q": " microsoft stock continues downward trend, dropping 10% — ballooning infrastructure capex, shrinking ai hype, and google blamed  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft stock continues downward trend, dropping 10% — ballooning infrastructure CAPEX, shrinking AI hype, and Google blamed </b><br>Microsoft execs have offloaded millions of dollars worth of stock over the past quarter, as the firm's outlook (no pun intended) looks murky.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-shares-dip-10-percent-over-the-last-three-months-ballooning-infrastructure-capex-shrinking-ai-hype-and-googles-resurgence-blamed\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-shares-dip-10-percent-over-the-last-three-months-ballooning-infrastructure-capex-shrinking-ai-hype-and-googles-resurgence-blamed",
    "topic": "it",
    "date": "2026-01-16T12:23:13.000Z"
  },
  {
    "title": " Windows 11 users are still turning to third-party tools to bypass Microsoft's push for all-encompassing AI — and \"Winslop\" is the most categorical example to date ",
    "q": " windows 11 users are still turning to third-party tools to bypass microsoft's push for all-encompassing ai — and \"winslop\" is the most categorical example to date  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 users are still turning to third-party tools to bypass Microsoft's push for all-encompassing AI — and \"Winslop\" is the most categorical example to date </b><br>Winslop is a lightweight app that helps you remove the AI features Microsoft has been heavily integrating into Windows 11.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/winslop-users-still-turning-to-third-party-tools-to-bypass-ai\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/winslop-users-still-turning-to-third-party-tools-to-bypass-ai",
    "topic": "it",
    "date": "2026-01-16T12:00:00.000Z"
  },
  {
    "title": "Microsoft: Windows 11 update causes Outlook freezes for POP users",
    "q": "microsoft: windows 11 update causes outlook freezes for pop users windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows 11 update causes Outlook freezes for POP users</b><br>Microsoft confirmed that the KB5074109 January Windows 11 security update causes the classic Outlook desktop client to freeze and hang for users with POP email accounts. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-update-causes-outlook-freezes-for-pop-users/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-11-update-causes-outlook-freezes-for-pop-users/",
    "topic": "it",
    "date": "2026-01-16T12:12:41.000Z"
  },
  {
    "title": "Microsoft: Some Windows PCs fail to shut down after January update",
    "q": "microsoft: some windows pcs fail to shut down after january update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Some Windows PCs fail to shut down after January update</b><br>Microsoft has confirmed a new issue that prevents Windows 11 23H2 devices with System Guard Secure Launch enabled from shutting down. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/microsoft-some-windows-pcs-fail-to-shut-down-after-january-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-some-windows-pcs-fail-to-shut-down-after-january-update/",
    "topic": "it",
    "date": "2026-01-16T08:35:38.000Z"
  },
  {
    "title": "Storage is getting expensive—it's time to free up space on your Windows PC",
    "q": "storage is getting expensive—it's time to free up space on your windows pc windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Storage is getting expensive—it's time to free up space on your Windows PC</b><br>When storage upgrades aren't a feasible option, it's time to max out what you've got.<br><a href=\"https://www.howtogeek.com/storage-is-getting-expensiveits-time-to-free-up-space-on-your-windows-pc/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/storage-is-getting-expensiveits-time-to-free-up-space-on-your-windows-pc/",
    "topic": "it",
    "date": "2026-01-16T20:00:15.000Z"
  },
  {
    "title": "The latest Windows 11 update is causing PCs to refuse to shut down",
    "q": "the latest windows 11 update is causing pcs to refuse to shut down windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The latest Windows 11 update is causing PCs to refuse to shut down</b><br>It makes you wonder why 'Shutdown' isn't always an absolute command.<br><a href=\"https://www.howtogeek.com/the-latest-windows-11-update-is-causing-pcs-to-refuse-to-shut-down/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/the-latest-windows-11-update-is-causing-pcs-to-refuse-to-shut-down/",
    "topic": "it",
    "date": "2026-01-16T18:48:50.000Z"
  },
  {
    "title": "How to use the MAP function in Microsoft Excel",
    "q": "how to use the map function in microsoft excel windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How to use the MAP function in Microsoft Excel</b><br>Use MAP and LAMBDA to build centralized, error-proof, and auto-spilling Excel spreadsheet systems.<br><a href=\"https://www.howtogeek.com/microsoft-excel-map-function-stop-dragging-formulas-automate-data-tasks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-map-function-stop-dragging-formulas-automate-data-tasks/",
    "topic": "it",
    "date": "2026-01-16T18:30:15.000Z"
  },
  {
    "title": "I replaced every Microsoft app on Windows with open-source tools, and here's how it went",
    "q": "i replaced every microsoft app on windows with open-source tools, and here's how it went windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I replaced every Microsoft app on Windows with open-source tools, and here's how it went</b><br>My journey to an open-source Windows desktop<br><a href=\"https://www.xda-developers.com/replaced-every-microsoft-app-on-windows-with-open-source-tools/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/replaced-every-microsoft-app-on-windows-with-open-source-tools/",
    "topic": "it",
    "date": "2026-01-16T23:01:20.000Z"
  },
  {
    "title": "Universal Blue is the operating system framework that Windows should have adopted",
    "q": "universal blue is the operating system framework that windows should have adopted windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Universal Blue is the operating system framework that Windows should have adopted</b><br>Many of Windows' issues could be squashed with the main tenants of Universal Blue<br><a href=\"https://www.xda-developers.com/universal-blue-is-the-operating-system-architecture-that-windows-should-have-adopted/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/universal-blue-is-the-operating-system-architecture-that-windows-should-have-adopted/",
    "topic": "it",
    "date": "2026-01-16T21:00:20.000Z"
  }
]