[
  {
    "title": "58% of Photographers Have Lost Work to Generative AI: Survey",
    "q": "58% of photographers have lost work to generative ai: survey camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>58% of Photographers Have Lost Work to Generative AI: Survey</b><br>An Association of Photographers survey of its members has revealed an alarming statistic: 58% say they have lost work to generative AI. [Read More]<br><a href=\"https://petapixel.com/2026/01/30/58-of-photographers-have-lost-work-to-generative-ai-survey/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/30/58-of-photographers-have-lost-work-to-generative-ai-survey/",
    "topic": "photo",
    "date": "2026-01-30T11:53:06.000Z"
  },
  {
    "title": "Richard Avedon’s Striking Portraits of Everyday Folk From the American West",
    "q": "richard avedon’s striking portraits of everyday folk from the american west camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Richard Avedon’s Striking Portraits of Everyday Folk From the American West</b><br>From 1979 to 1984, famed fashion photographer Richard Avedon traveled to 21 states with an 8 x 10 large format Deardorff camera and a white backdrop to capture the portraits of working-class America. [Read More]<br><a href=\"https://petapixel.com/2026/01/30/richard-avedons-striking-portraits-of-everyday-folk-from-the-american-west/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/30/richard-avedons-striking-portraits-of-everyday-folk-from-the-american-west/",
    "topic": "photo",
    "date": "2026-01-30T09:07:00.000Z"
  },
  {
    "title": "Photographer Captures Beautiful Wildflowers Using a Camera He Built",
    "q": "photographer captures beautiful wildflowers using a camera he built camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Captures Beautiful Wildflowers Using a Camera He Built</b><br>Through hand-built cameras and room-sized camera obscuras, Brendan Barry slows photography down to its most elemental processes. His latest project, Flowers for Bea, reveals how that practice can hold memory, ritual, and transformation wit…<br><a href=\"https://petapixel.com/2026/01/29/photographer-captures-beautiful-wildflowers-using-a-camera-he-built/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/29/photographer-captures-beautiful-wildflowers-using-a-camera-he-built/",
    "topic": "photo",
    "date": "2026-01-29T21:13:04.000Z"
  },
  {
    "title": "Lomography Completes Petzval Art Series With 27mm and 135mm Primes",
    "q": "lomography completes petzval art series with 27mm and 135mm primes camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Lomography Completes Petzval Art Series With 27mm and 135mm Primes</b><br>Last July, Lomography unveiled a series of new Petzval lenses. At the time, the company launched 35mm f/2, 55mm f/1.7, and 80.5mm f/1.9 Art primes, promising to bring 27mm f/1.7 and 135mm f/2.5 lenses into the fold later. Later is now, and…<br><a href=\"https://petapixel.com/2026/01/29/lomography-completes-petzval-art-series-with-27mm-and-135mm-primes/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/29/lomography-completes-petzval-art-series-with-27mm-and-135mm-primes/",
    "topic": "photo",
    "date": "2026-01-29T20:02:53.000Z"
  },
  {
    "title": "Photography’s Truth Is Under Attack and Giving Up Is Not an Option",
    "q": "photography’s truth is under attack and giving up is not an option camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photography’s Truth Is Under Attack and Giving Up Is Not an Option</b><br>As generative AI technology proliferates, making it easier for people to manipulate real photos or create convincing fake ones from scratch, photography's ability to depict reality has come under increasing attack. A recent Washington Post…<br><a href=\"https://petapixel.com/2026/01/29/photographys-truth-is-under-attack-and-giving-up-is-not-an-option/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/29/photographys-truth-is-under-attack-and-giving-up-is-not-an-option/",
    "topic": "photo",
    "date": "2026-01-29T18:20:58.000Z"
  },
  {
    "title": "Fujifilm Says Superia Premium Is Still in Production Despite Its Unavailability",
    "q": "fujifilm says superia premium is still in production despite its unavailability camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm Says Superia Premium Is Still in Production Despite Its Unavailability</b><br>Fujifilm Superia Premium is so difficult to find that many have, for some time, believed it to be discontinued. Evidence of that stacked up this year when Yodobashi Camera, Bic Camera, and other Japanese camera stores listed it as disconti…<br><a href=\"https://petapixel.com/2026/01/29/fujifilm-says-superia-premium-is-still-in-production-despite-its-unavailability/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/29/fujifilm-says-superia-premium-is-still-in-production-despite-its-unavailability/",
    "topic": "photo",
    "date": "2026-01-29T17:35:51.000Z"
  },
  {
    "title": "VSCO Users Can Now Make Edits Via an AI Prompt",
    "q": "vsco users can now make edits via an ai prompt camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>VSCO Users Can Now Make Edits Via an AI Prompt</b><br>VSCO has added a new prompt-based image editing tool to its app, allowing photographers to simply describe the edits they want to see in natural language. [Read More]<br><a href=\"https://petapixel.com/2026/01/29/vsco-prompt-ai-lab/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/29/vsco-prompt-ai-lab/",
    "topic": "photo",
    "date": "2026-01-29T17:25:35.000Z"
  },
  {
    "title": "Photographer’s 12-Year-Long Fight Over ‘Blackbeard’s Law’ Might Be Over",
    "q": "photographer’s 12-year-long fight over ‘blackbeard’s law’ might be over camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer’s 12-Year-Long Fight Over ‘Blackbeard’s Law’ Might Be Over</b><br>After more than a decade in court, an underwater photographer’s legal battle over images of Blackbeard’s shipwreck -- and whether states can be held liable for copyright infringement -- may finally be over. [Read More]<br><a href=\"https://petapixel.com/2026/01/29/photographers-12-year-long-fight-over-blackbeards-law-might-be-over/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/29/photographers-12-year-long-fight-over-blackbeards-law-might-be-over/",
    "topic": "photo",
    "date": "2026-01-29T17:18:51.000Z"
  },
  {
    "title": "Compact by choice: A DPReview reader's light camera adventure kit",
    "q": "compact by choice: a dpreview reader's light camera adventure kit camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Compact by choice: A DPReview reader's light camera adventure kit</b><br>Me in the mountains in Argentinian Patagonia, 2017. Photo from my lovely wife Camila, my girlfriend back then. Sony DSC-RX10 IV | F6.3 | 1/250 sec | ISO 1250 Photo: Rodrigo Pasiani DPReview community member Rodrigo Pasiani is a lifelong ph…<br><a href=\"https://www.dpreview.com/articles/1171594085/compact-by-choice-a-dpreview-reader-s-light-camera-adventure-kit\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1171594085/compact-by-choice-a-dpreview-reader-s-light-camera-adventure-kit",
    "topic": "photo",
    "date": "2026-01-29T20:51:00.000Z"
  },
  {
    "title": "Leica's new, fast Noctilux goes a little wider",
    "q": "leica's new, fast noctilux goes a little wider camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Leica's new, fast Noctilux goes a little wider</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark Leica has announced the Noctilux M 35mm F1.2 Asph., the latest entry in its famed series of fast primes, and the first one to offer…<br><a href=\"https://www.dpreview.com/news/3838454457/leica-noctilux-35mm-f1p2-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3838454457/leica-noctilux-35mm-f1p2-lens-announcement",
    "topic": "photo",
    "date": "2026-01-29T14:00:00.000Z"
  },
  {
    "title": "Laowa has a new macro option for Micro Four Thirds users",
    "q": "laowa has a new macro option for micro four thirds users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Laowa has a new macro option for Micro Four Thirds users</b><br>Image: Laowa Laowa has announced that it will be bringing its 90mm F2.8 2X Ultra Macro APO lens to a new mount: Micro Four Thirds. The lens was originally made for full frame cameras, and it's been around for RF, Z, E and L mount systems f…<br><a href=\"https://www.dpreview.com/news/3454558406/laowa-90mm-f2p8-2x-macro-micro-four-thirds-release\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3454558406/laowa-90mm-f2p8-2x-macro-micro-four-thirds-release",
    "topic": "photo",
    "date": "2026-01-29T14:00:00.000Z"
  },
  {
    "title": "DJI's latest gimbal is a collection of subtle updates",
    "q": "dji's latest gimbal is a collection of subtle updates camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DJI's latest gimbal is a collection of subtle updates</b><br>Image: DJI DJI has announced the RS 5, the latest version of its gimbal designed for creators and video professionals using mirrorless cameras. The update is a relatively subtle one over last year's RS 4, but it brings improvements to the …<br><a href=\"https://www.dpreview.com/news/8956411286/dji-rs-5-gimbal-mirrorless\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/8956411286/dji-rs-5-gimbal-mirrorless",
    "topic": "photo",
    "date": "2026-01-29T12:00:00.000Z"
  },
  {
    "title": "Question of the week: What's the most dramatic accident your camera has been through?",
    "q": "question of the week: what's the most dramatic accident your camera has been through? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What's the most dramatic accident your camera has been through?</b><br>Image: Westend61 / Westend61 via Getty Images Welcome back to our Question of the Week series! This reader-focused series aims to get our photographic community to share thoughts on all sorts of photography-related topics in our forums. We…<br><a href=\"https://www.dpreview.com/forums/threads/whats-the-most-dramatic-accident-your-camera-has-been-through.4828183/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/whats-the-most-dramatic-accident-your-camera-has-been-through.4828183/",
    "topic": "photo",
    "date": "2026-01-28T15:44:00.000Z"
  },
  {
    "title": "How far we've come: can the latest mid-range cameras compete with recent pro-grade models?",
    "q": "how far we've come: can the latest mid-range cameras compete with recent pro-grade models? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How far we've come: can the latest mid-range cameras compete with recent pro-grade models?</b><br>When you use DPReview links to buy products, the site may earn a commission. Playing 'Top Trumps' with camera specs doesn't give the full picture, but it can still reveal something interesting. Composite image: Richard Butler It occurred t…<br><a href=\"https://www.dpreview.com/articles/6084430585/how-do-mid-range-mirrorless-compare-with-recent-pro-grade-models\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/6084430585/how-do-mid-range-mirrorless-compare-with-recent-pro-grade-models",
    "topic": "photo",
    "date": "2026-01-28T15:00:00.000Z"
  },
  {
    "title": "How I've used photography as an outlet when words aren't enough",
    "q": "how i've used photography as an outlet when words aren't enough camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How I've used photography as an outlet when words aren't enough</b><br>I created this image while I was working full-time, applying to far too many graduate schools and navigating a long-distance relationship. Photo: Abby Ferguson It's well established that photography is a superb tool for documentation purpo…<br><a href=\"https://www.dpreview.com/opinion/5588849061/how-i-ve-used-photography-as-an-outlet-when-words-aren-t-enough\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/opinion/5588849061/how-i-ve-used-photography-as-an-outlet-when-words-aren-t-enough",
    "topic": "photo",
    "date": "2026-01-27T16:30:00.000Z"
  },
  {
    "title": "Photoshop's latest update adds new adjustment layers and trials text tools",
    "q": "photoshop's latest update adds new adjustment layers and trials text tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photoshop's latest update adds new adjustment layers and trials text tools</b><br>Image: Adobe Adobe has announced an update to Photoshop that brings new types of adjustment layers and improves generative AI-powered fill tools. It's also adding a feature in beta that makes it easier to manipulate text into certain shape…<br><a href=\"https://www.dpreview.com/news/3036390848/adobe-photoshop-update-jan-26-adjustment-layers\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3036390848/adobe-photoshop-update-jan-26-adjustment-layers",
    "topic": "photo",
    "date": "2026-01-27T14:00:00.000Z"
  },
  {
    "title": "The Nikon ZR gets its first firmware update",
    "q": "the nikon zr gets its first firmware update camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Nikon ZR gets its first firmware update</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Nikon Nikon has announced firmware V1.10 for the ZR camera, heralding the first update for the video-focused camera. Given that it comes only a few months …<br><a href=\"https://www.dpreview.com/news/1800777439/nikon-zr-video-camera-firmware-update-v1p10\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/1800777439/nikon-zr-video-camera-firmware-update-v1p10",
    "topic": "photo",
    "date": "2026-01-27T04:01:00.000Z"
  },
  {
    "title": "Photographing Mongolia in winter: part 2",
    "q": "photographing mongolia in winter: part 2 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Mongolia in winter: part 2</b><br>DJI Mavic 3 Classic | 24mm F2.8 | ISO 100 | 1/320 sec | F5.6 Photo: Erez Marom In part one of my series about photographing Mongolia in winter, I wrote about my experience shooting the Khongor Sand Dunes and Lake Khuvsgul. This time, I'd l…<br><a href=\"https://www.dpreview.com/articles/1273132880/photographing-mongolia-in-winter-part-2\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1273132880/photographing-mongolia-in-winter-part-2",
    "topic": "photo",
    "date": "2026-01-26T14:00:00.000Z"
  },
  {
    "title": " The \"photography trailblazers of tomorrow\": Sony World Photo Awards 2026 reveals student and youth shortlists ",
    "q": " the \"photography trailblazers of tomorrow\": sony world photo awards 2026 reveals student and youth shortlists  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The \"photography trailblazers of tomorrow\": Sony World Photo Awards 2026 reveals student and youth shortlists </b><br>20 up-and-coming photographers have made the final cut for the prestigious awards, to be revealed on April 16<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/the-photography-trailblazers-of-tomorrow-sony-world-photo-awards-2026-reveals-student-and-youth-shortlists\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/the-photography-trailblazers-of-tomorrow-sony-world-photo-awards-2026-reveals-student-and-youth-shortlists",
    "topic": "photo",
    "date": "2026-01-30T09:11:52.000Z"
  },
  {
    "title": " Look miserable and keep the camera low – my quick guide to shooting urban portraits ",
    "q": " look miserable and keep the camera low – my quick guide to shooting urban portraits  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Look miserable and keep the camera low – my quick guide to shooting urban portraits </b><br>Here's four styles of portraits to shoot on the mean city streets<br><a href=\"https://www.digitalcameraworld.com/photography/portrait-photography/look-miserable-and-keep-the-camera-low-my-quick-guide-to-shooting-urban-portraits\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/portrait-photography/look-miserable-and-keep-the-camera-low-my-quick-guide-to-shooting-urban-portraits",
    "topic": "photo",
    "date": "2026-01-30T07:23:08.000Z"
  },
  {
    "title": " Got a Nikon Z9? This update fixes a fatal flaw in the autofocus system ",
    "q": " got a nikon z9? this update fixes a fatal flaw in the autofocus system  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Got a Nikon Z9? This update fixes a fatal flaw in the autofocus system </b><br>Nikon's new firmware fixes an issue where the Z loses subject focus for photos and videos<br><a href=\"https://www.digitalcameraworld.com/tech/firmware/got-a-nikon-z9-this-update-fixes-a-fatal-flaw-in-the-autofocus-system\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/firmware/got-a-nikon-z9-this-update-fixes-a-fatal-flaw-in-the-autofocus-system",
    "topic": "photo",
    "date": "2026-01-30T07:15:00.000Z"
  },
  {
    "title": " Generative AI could hollow out the photo industry within five years, pro organization warns as creators band together against “the greatest acts of theft in modern history” ",
    "q": " generative ai could hollow out the photo industry within five years, pro organization warns as creators band together against “the greatest acts of theft in modern history”  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Generative AI could hollow out the photo industry within five years, pro organization warns as creators band together against “the greatest acts of theft in modern history” </b><br>Five creative organizations are lobbying for GenAI reform in the UK alongside surveys that illustrate the tech's massive impact so far<br><a href=\"https://www.digitalcameraworld.com/tech/artificial-intelligence/generative-ai-could-hollow-out-the-photo-industry-within-five-years-pro-organization-warns-as-creators-band-together-against-the-greatest-acts-of-theft-in-modern-history\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/artificial-intelligence/generative-ai-could-hollow-out-the-photo-industry-within-five-years-pro-organization-warns-as-creators-band-together-against-the-greatest-acts-of-theft-in-modern-history",
    "topic": "photo",
    "date": "2026-01-30T00:01:00.000Z"
  },
  {
    "title": " Kit lenses used to be boring and basic. That’s no longer the case as brands bundle everything from pancake primes to bright aperture glass ",
    "q": " kit lenses used to be boring and basic. that’s no longer the case as brands bundle everything from pancake primes to bright aperture glass  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Kit lenses used to be boring and basic. That’s no longer the case as brands bundle everything from pancake primes to bright aperture glass </b><br>Kit lenses are no longer just boring budget zooms – and that's a great thing<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/kit-lenses-used-to-be-boring-and-basic-thats-no-longer-the-case-as-brands-bundle-everything-from-pancake-primes-to-bright-aperture-glass\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/kit-lenses-used-to-be-boring-and-basic-thats-no-longer-the-case-as-brands-bundle-everything-from-pancake-primes-to-bright-aperture-glass",
    "topic": "photo",
    "date": "2026-01-29T20:46:26.000Z"
  },
  {
    "title": " \"No photograph is worth more than the life it portrays or the landscape it inhabits\" – intimate arctic moment of mother and cub recognized in photo competition  ",
    "q": " \"no photograph is worth more than the life it portrays or the landscape it inhabits\" – intimate arctic moment of mother and cub recognized in photo competition   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> \"No photograph is worth more than the life it portrays or the landscape it inhabits\" – intimate arctic moment of mother and cub recognized in photo competition  </b><br>Shot using a professional telephoto setup, this powerful wildlife image was captured by a photographer guided by empathy and respect<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/no-photograph-is-worth-more-than-the-life-it-portrays-or-the-landscape-it-inhabits-intimate-arctic-moment-of-mother-and-cub-recognized-in-photo-competition\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/no-photograph-is-worth-more-than-the-life-it-portrays-or-the-landscape-it-inhabits-intimate-arctic-moment-of-mother-and-cub-recognized-in-photo-competition",
    "topic": "photo",
    "date": "2026-01-29T19:28:21.000Z"
  },
  {
    "title": " Demand for used cameras is skyrocketing as one retailer recirculates more than 500,000 cameras, lenses, and accessories in a single year ",
    "q": " demand for used cameras is skyrocketing as one retailer recirculates more than 500,000 cameras, lenses, and accessories in a single year  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Demand for used cameras is skyrocketing as one retailer recirculates more than 500,000 cameras, lenses, and accessories in a single year </b><br>Used photo retailer MPB is reporting significant growth over the last year, attributed to increased demand and market expansion<br><a href=\"https://www.digitalcameraworld.com/cameras/demand-for-used-cameras-is-skyrocketing-as-one-retailer-recirculates-more-than-500-000-cameras-lenses-and-accessories-in-a-single-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/demand-for-used-cameras-is-skyrocketing-as-one-retailer-recirculates-more-than-500-000-cameras-lenses-and-accessories-in-a-single-year",
    "topic": "photo",
    "date": "2026-01-29T17:27:20.000Z"
  },
  {
    "title": "Best iPhone Camera Accessories to Expand Your Creative Toolkit",
    "q": "best iphone camera accessories to expand your creative toolkit camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best iPhone Camera Accessories to Expand Your Creative Toolkit</b><br>The iPhone is not just a phone; it’s a highly portable device with some of the best camera technology you can have. With the iPhone’s camera, you can exercise your creativity and build your photography skills everywhere you go. Also, it’s …<br><a href=\"https://www.slrlounge.com/best-iphone-camera-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-iphone-camera-accessories/",
    "topic": "photo",
    "date": "2026-01-29T19:28:09.000Z"
  },
  {
    "title": "Ruko U11MINI 4K RC3 Review: A Sub-250g Drone That Actually Makes Sense for Beginners",
    "q": "ruko u11mini 4k rc3 review: a sub-250g drone that actually makes sense for beginners camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Ruko U11MINI 4K RC3 Review: A Sub-250g Drone That Actually Makes Sense for Beginners</b><br>The bottom line: The Ruko U11MINI 4K RC3 delivers usable 4K video, a 3-axis gimbal, and 96 minutes of flight time across three batteries, all under 249g and under $500. It’s not a DJI killer, but it’s a legitimately good first drone for ph…<br><a href=\"https://www.slrlounge.com/ruko-u11mini-4k-rc3-review-a-sub-250g-drone-that-actually-makes-sense-for-beginners/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/ruko-u11mini-4k-rc3-review-a-sub-250g-drone-that-actually-makes-sense-for-beginners/",
    "topic": "photo",
    "date": "2026-01-29T16:11:50.000Z"
  },
  {
    "title": "Best CRM for Photographers: Real Tools, Real Photographers, Real Results",
    "q": "best crm for photographers: real tools, real photographers, real results camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best CRM for Photographers: Real Tools, Real Photographers, Real Results</b><br>Photographers lose more potential bookings to a disorganized inbox than they care to admit. A bride emails on a Tuesday afternoon, they’re on a shoot, and by the time they circle back three days later, she’s already signed with someone els…<br><a href=\"https://www.slrlounge.com/best-crm-for-photographers-real-tools-real-photographers-real-results/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-crm-for-photographers-real-tools-real-photographers-real-results/",
    "topic": "photo",
    "date": "2026-01-28T19:35:26.000Z"
  },
  {
    "title": "Learn the Art of Visual Storytelling Through Photography",
    "q": "learn the art of visual storytelling through photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Learn the Art of Visual Storytelling Through Photography</b><br>Storytelling in photography is an invaluable tool that allows us to communicate beyond words and deliver a visual narrative that touches our hearts and minds alike. An image, or a set of images, that tell a story can have a profound impact…<br><a href=\"https://www.slrlounge.com/art-of-visual-storytelling-through-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/art-of-visual-storytelling-through-photography/",
    "topic": "photo",
    "date": "2026-01-28T19:21:53.000Z"
  },
  {
    "title": "Forest Photography Tips & Guide for Better Photos",
    "q": "forest photography tips & guide for better photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Forest Photography Tips & Guide for Better Photos</b><br>Forest photography offers a unique creative challenge: capturing the interplay of light filtering through canopies, the textures of ancient bark, and the mood that only woodlands can provide. Whether you’re drawn to misty morning scenes, d…<br><a href=\"https://www.slrlounge.com/forest-photography-tips-guide-for-better-photos/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/forest-photography-tips-guide-for-better-photos/",
    "topic": "photo",
    "date": "2026-01-28T00:33:30.000Z"
  },
  {
    "title": "PPI vs DPI: What’s the Difference and Why It Matters to Photographers",
    "q": "ppi vs dpi: what’s the difference and why it matters to photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PPI vs DPI: What’s the Difference and Why It Matters to Photographers</b><br>PPI and DPI are both very important terms for any photographer who wants to display their images as beautifully as possible.<br><a href=\"https://www.slrlounge.com/ppi-vs-dpi/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/ppi-vs-dpi/",
    "topic": "photo",
    "date": "2026-01-27T00:34:28.000Z"
  },
  {
    "title": "How to use Dodge & Burn in Luminar Neo",
    "q": "how to use dodge & burn in luminar neo camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to use Dodge & Burn in Luminar Neo</b><br>If you’ve ever wondered how photographers add depth, shape, and intention to their edits without overdoing contrast or exposure, this beginner-friendly tutorial on dodge and burn in Luminar Neo is for you. In this video, I’ll show you exac…<br><a href=\"https://photofocus.com/software/how-to-use-dodge-burn-in-luminar-neo/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/how-to-use-dodge-burn-in-luminar-neo/",
    "topic": "photo",
    "date": "2026-01-29T14:00:00.000Z"
  },
  {
    "title": "Adding Textures to Portraits Using Blend Modes in Photoshop",
    "q": "adding textures to portraits using blend modes in photoshop camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adding Textures to Portraits Using Blend Modes in Photoshop</b><br>In this Photoshop tutorial for photographers, I show you how to add textures to portraits using blend modes like Multiply, Screen, and Overlay, along with the powerful Blend If sliders for natural, believable results. This step-by-step edi…<br><a href=\"https://photofocus.com/photography/adding-textures-to-portraits-using-blend-modes-in-photoshop/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/adding-textures-to-portraits-using-blend-modes-in-photoshop/",
    "topic": "photo",
    "date": "2026-01-29T01:00:00.000Z"
  },
  {
    "title": "Clarity, Dehaze & Grain adjustment layers now in Photoshop",
    "q": "clarity, dehaze & grain adjustment layers now in photoshop camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Clarity, Dehaze & Grain adjustment layers now in Photoshop</b><br>Clarity, Dehaze and Grain effects in Lightroom and Camera Raw are my go-to tools. Now they are available as adjustment layers in Photoshop. New adjustment layers Clarity and Dehaze, and Grain bring powerful non-destructive, maskable, layer…<br><a href=\"https://photofocus.com/software/clarity-dehaze-grain-adjustment-layers-now-in-photoshop/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/clarity-dehaze-grain-adjustment-layers-now-in-photoshop/",
    "topic": "photo",
    "date": "2026-01-27T15:21:10.000Z"
  },
  {
    "title": "Godox announces new All-in-One AD800Pro Flash",
    "q": "godox announces new all-in-one ad800pro flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox announces new All-in-One AD800Pro Flash</b><br>Reliable 800Ws Power for Demanding Location Shoots Godox has announced the AD800Pro, a powerful 800Ws battery-powered monolight designed for photographers who need dependable main-light performance on location. Built to handle bright outdo…<br><a href=\"https://photofocus.com/news/godox-announces-new-all-in-one-ad800pro-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-announces-new-all-in-one-ad800pro-flash/",
    "topic": "photo",
    "date": "2026-01-23T03:20:28.000Z"
  },
  {
    "title": "SmallRig x Potato Jet TRIBEX SE Tripod Review",
    "q": "smallrig x potato jet tribex se tripod review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>SmallRig x Potato Jet TRIBEX SE Tripod Review</b><br>A fast, field-ready tripod built for landscape and hybrid shooters Let’s clear this up right from the start.The SmallRig x Potato Jet TRIBEX SE is not a studio portrait, product or still life tripod. It isn’t trying to be, and judging it b…<br><a href=\"https://photofocus.com/reviews/smallrig-x-potato-jet-tribex-se-tripod-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/smallrig-x-potato-jet-tribex-se-tripod-review/",
    "topic": "photo",
    "date": "2026-01-21T13:30:00.000Z"
  },
  {
    "title": "Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits ",
    "q": "creative color shifts | using nik collection’s color efex for dramatic portraits  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits </b><br>Explore creative colour shifts in still life photography using Nik Collection’s Color Efex Pro. In this video, I show how to use colour grading, film-inspired filters, and local contrast tools to create dramatic, moody still life images wi…<br><a href=\"https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/",
    "topic": "photo",
    "date": "2026-01-20T14:00:00.000Z"
  },
  {
    "title": "Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity",
    "q": "removing distractions in lightroom vs luminar, photolab and affinity camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity</b><br>In this beginner-friendly editing comparison, I walk photographers through one of the most common frustrations: removing unwanted people and distractions from photos, without needing to touch Photoshop. Using a real-world example from a bu…<br><a href=\"https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/",
    "topic": "photo",
    "date": "2026-01-19T14:00:00.000Z"
  },
  {
    "title": "A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light",
    "q": "a coastal wake-up call: variable nd filters vs real-world light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light</b><br>What I Loved in the Studio, and What Caught Me Out on the Coast After spending time with the K&F CONCEPT Ultra-Low Reflection Variable ND Filter in the studio, I was genuinely impressed. Long exposures behaved beautifully, reflections were…<br><a href=\"https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/",
    "topic": "photo",
    "date": "2026-01-18T14:00:00.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Microsoft is experimenting with a top menu bar for Windows 11",
    "q": "microsoft is experimenting with a top menu bar for windows 11 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft is experimenting with a top menu bar for Windows 11</b><br>Microsoft's PowerToys team is contemplating building a top menu bar for Windows 11, much like Linux, macOS, or older versions of Windows. The menu bar, or Command Palette Dock as Microsoft calls it, would be a new optional UI that provides…<br><a href=\"https://www.theverge.com/news/870663/microsoft-windows-11-top-menu-bar-powertoy-experiment\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/870663/microsoft-windows-11-top-menu-bar-powertoy-experiment",
    "topic": "it",
    "date": "2026-01-30T11:22:06.000Z"
  },
  {
    "title": "Apple just had a record-breaking iPhone quarter",
    "q": "apple just had a record-breaking iphone quarter windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple just had a record-breaking iPhone quarter</b><br>iPhone 17 Pro Apple says the iPhone had its \"best-ever\" quarter, with revenue hitting more than $85.3 billion over the past few months. The company announced the news as part of its Q1 2026 earnings report, which also revealed record-break…<br><a href=\"https://www.theverge.com/news/870319/apple-iphone-best-revenue-ai-q1-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/870319/apple-iphone-best-revenue-ai-q1-2026",
    "topic": "it",
    "date": "2026-01-29T21:54:56.000Z"
  },
  {
    "title": "The best foldable phone you can buy",
    "q": "the best foldable phone you can buy windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best foldable phone you can buy</b><br>A foldable phone isn’t for the faint of heart. They’re generally heavier, pricier, and have less capable cameras than a standard slab-style phone. They’re also still not as durable as regular smartphones, though they’re not nearly as fragi…<br><a href=\"https://www.theverge.com/tech/635839/best-foldable-phone\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/635839/best-foldable-phone",
    "topic": "it",
    "date": "2026-01-29T20:18:26.000Z"
  },
  {
    "title": "Apple’s second biggest acquisition ever is an AI company that listens to ‘silent speech’",
    "q": "apple’s second biggest acquisition ever is an ai company that listens to ‘silent speech’ windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple’s second biggest acquisition ever is an AI company that listens to ‘silent speech’</b><br>Apple's biggest acquisition ever is still its $3 billion Beats buy in 2014, but now the second biggest deal is bringing in Q.ai, a four-year-old AI audio startup. Apple did not disclose the terms, but Financial Times reports that Apple is …<br><a href=\"https://www.theverge.com/news/870353/apple-q-ai-acquisition-silent-speech\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/870353/apple-q-ai-acquisition-silent-speech",
    "topic": "it",
    "date": "2026-01-29T19:22:27.000Z"
  },
  {
    "title": " 'We need to improve Windows in ways that are meaningful for people': Microsoft promises to fix Windows 11 this year — and it's about time ",
    "q": " 'we need to improve windows in ways that are meaningful for people': microsoft promises to fix windows 11 this year — and it's about time  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> 'We need to improve Windows in ways that are meaningful for people': Microsoft promises to fix Windows 11 this year — and it's about time </b><br>There's a steep hill to climb here, but at least Microsoft is making it clear that it's serious about bringing an end to the painful bugs.<br><a href=\"https://www.techradar.com/computing/windows/we-need-to-improve-windows-in-ways-that-are-meaningful-for-people-microsoft-promises-to-fix-windows-11-this-year-and-its-about-time\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/we-need-to-improve-windows-in-ways-that-are-meaningful-for-people-microsoft-promises-to-fix-windows-11-this-year-and-its-about-time",
    "topic": "it",
    "date": "2026-01-30T11:43:27.000Z"
  },
  {
    "title": " Land an RTX 5080 gaming PC deal with 64GB of RAM for just $2,279 — this factory-reconditioned rig saves you hundreds of dollars, RAM and GPU alone worth $1,938 in today's market ",
    "q": " land an rtx 5080 gaming pc deal with 64gb of ram for just $2,279 — this factory-reconditioned rig saves you hundreds of dollars, ram and gpu alone worth $1,938 in today's market  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Land an RTX 5080 gaming PC deal with 64GB of RAM for just $2,279 — this factory-reconditioned rig saves you hundreds of dollars, RAM and GPU alone worth $1,938 in today's market </b><br>A beastly gaming machine that contains 64GB of fast DDR5 RAM and a powerful Nvidia RTX 5080 graphics card.<br><a href=\"https://www.tomshardware.com/desktops/gaming-pcs/land-an-rtx-5080-gaming-pc-deal-with-64gb-of-ram-for-just-usd2-279-this-factory-reconditioned-rig-saves-you-hundreds-of-dollars-ram-and-gpu-alone-worth-usd1-938-in-todays-market\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/desktops/gaming-pcs/land-an-rtx-5080-gaming-pc-deal-with-64gb-of-ram-for-just-usd2-279-this-factory-reconditioned-rig-saves-you-hundreds-of-dollars-ram-and-gpu-alone-worth-usd1-938-in-todays-market",
    "topic": "it",
    "date": "2026-01-30T11:51:00.000Z"
  },
  {
    "title": " Microsoft is reportedly working to fix Windows 11's most annoying flaws — wants to restore the operating system's reputation ",
    "q": " microsoft is reportedly working to fix windows 11's most annoying flaws — wants to restore the operating system's reputation  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is reportedly working to fix Windows 11's most annoying flaws — wants to restore the operating system's reputation </b><br>Complaints about Windows 11 bugs and glitches from the Windows community have apparently reached a tipping point. Microsoft is reportedly using all of 2026 to fix Windows 11's core issues.<br><a href=\"https://www.tomshardware.com/software/windows/microsoft-is-reportedly-working-to-fix-windows-11s-most-annoying-flaws-wants-to-rebuild-trust-in-the-os\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/software/windows/microsoft-is-reportedly-working-to-fix-windows-11s-most-annoying-flaws-wants-to-rebuild-trust-in-the-os",
    "topic": "it",
    "date": "2026-01-30T11:40:00.000Z"
  },
  {
    "title": " Microsoft's gaming division flounders while the firm makes more money than ever — Xbox consoles sales drop 32% ",
    "q": " microsoft's gaming division flounders while the firm makes more money than ever — xbox consoles sales drop 32%  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft's gaming division flounders while the firm makes more money than ever — Xbox consoles sales drop 32% </b><br>Xbox consoles sales drop 32% while Microsoft makes more money than ever<br><a href=\"https://www.tomshardware.com/video-games/xbox/microsofts-gaming-division-flounders-while-the-firm-makes-more-money-than-ever-xbox-consoles-sales-drop-32-percent\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/xbox/microsofts-gaming-division-flounders-while-the-firm-makes-more-money-than-ever-xbox-consoles-sales-drop-32-percent",
    "topic": "it",
    "date": "2026-01-30T11:20:00.000Z"
  },
  {
    "title": " GeForce Now launches on Linux with a Flatpak build — native app brings 5K and 360FPS support to Linux gamers ",
    "q": " geforce now launches on linux with a flatpak build — native app brings 5k and 360fps support to linux gamers  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> GeForce Now launches on Linux with a Flatpak build — native app brings 5K and 360FPS support to Linux gamers </b><br>GeForce Now has received an official Linux native app for Linux gamers, unlocking all the features that the native app offers over the web browser version, including 5K resolution, Reflex and 360 FPS support.<br><a href=\"https://www.tomshardware.com/video-games/cloud-gaming/geforce-now-launches-on-linux-with-a-flatpak-build-native-app-brings-5k-and-360fps-support-to-linux-gamers\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/cloud-gaming/geforce-now-launches-on-linux-with-a-flatpak-build-native-app-brings-5k-and-360fps-support-to-linux-gamers",
    "topic": "it",
    "date": "2026-01-30T11:00:00.000Z"
  },
  {
    "title": "Finally, I found a Windows laptop for business that's both powerful and stunning to look at",
    "q": "finally, i found a windows laptop for business that's both powerful and stunning to look at windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Finally, I found a Windows laptop for business that's both powerful and stunning to look at</b><br>Asus' ExpertBook Ultra B9 is as ultraportable as it is powerful, with Intel's latest Panther Lake and a vibrant OLED display.<br><a href=\"https://www.zdnet.com/article/asus-expertbook-ultra-b9-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/asus-expertbook-ultra-b9-review/",
    "topic": "it",
    "date": "2026-01-30T12:01:00.000Z"
  },
  {
    "title": "I used a dual-screen Windows laptop for work this week, and it's a power user's dream setup",
    "q": "i used a dual-screen windows laptop for work this week, and it's a power user's dream setup windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I used a dual-screen Windows laptop for work this week, and it's a power user's dream setup</b><br>Asus' 2026 Zenbook Duo gets more refined, merging notable design updates with Intel's Panther Lake CPU.<br><a href=\"https://www.zdnet.com/article/asus-zenbook-duo-2026-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/asus-zenbook-duo-2026-review/",
    "topic": "it",
    "date": "2026-01-30T11:50:00.000Z"
  },
  {
    "title": " These 10 Windows 11 features and changes will ship in February — let's hope it's not another Patch Tuesday disaster ",
    "q": " these 10 windows 11 features and changes will ship in february — let's hope it's not another patch tuesday disaster  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> These 10 Windows 11 features and changes will ship in February — let's hope it's not another Patch Tuesday disaster </b><br>After breaking PCs in January, Microsoft is rolling out 10 new Windows 11 changes for February, including the expansion of Cross-Device Resume.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/these-10-windows-11-features-and-changes-will-ship-in-february-lets-hope-its-not-another-patch-tuesday-disaster\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/these-10-windows-11-features-and-changes-will-ship-in-february-lets-hope-its-not-another-patch-tuesday-disaster",
    "topic": "it",
    "date": "2026-01-30T12:43:18.000Z"
  },
  {
    "title": " Satya Nadella says Microsoft's Copilot AI is seeing massive use, growing \"nearly 3x year-over-year\" — but investors aren't convinced ",
    "q": " satya nadella says microsoft's copilot ai is seeing massive use, growing \"nearly 3x year-over-year\" — but investors aren't convinced  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Satya Nadella says Microsoft's Copilot AI is seeing massive use, growing \"nearly 3x year-over-year\" — but investors aren't convinced </b><br>Satya Nadella says Microsoft’s Copilot AI is seeing strong adoption, even as investors question the growth of Azure and Microsoft 365.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsoft-copilot/satya-nadella-says-microsofts-copilot-ai-is-seeing-massive-use\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsoft-copilot/satya-nadella-says-microsofts-copilot-ai-is-seeing-massive-use",
    "topic": "it",
    "date": "2026-01-30T12:15:07.000Z"
  },
  {
    "title": " New Xbox achievement visuals appear in Xbox Cloud Gaming — but gamers shouldn't expect any system overhauls anytime soon ",
    "q": " new xbox achievement visuals appear in xbox cloud gaming — but gamers shouldn't expect any system overhauls anytime soon  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> New Xbox achievement visuals appear in Xbox Cloud Gaming — but gamers shouldn't expect any system overhauls anytime soon </b><br>Microsoft has refreshed Xbox achievement visuals in the new Cloud Gaming UI preview, offering a cleaner look while sources say no full achievement system overhaul is planned.<br><a href=\"https://www.windowscentral.com/gaming/xbox/new-xbox-achievement-visuals-appear-in-cloud-gaming\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/new-xbox-achievement-visuals-appear-in-cloud-gaming",
    "topic": "it",
    "date": "2026-01-30T12:00:00.000Z"
  },
  {
    "title": " Microsoft is reevaluating its AI efforts on Windows 11 — plans to reduce Copilot integrations and evolve Recall ",
    "q": " microsoft is reevaluating its ai efforts on windows 11 — plans to reduce copilot integrations and evolve recall  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is reevaluating its AI efforts on Windows 11 — plans to reduce Copilot integrations and evolve Recall </b><br>People familiar with Microsoft's plans say that the company is moving to streamline or remove certain Copilot integrations across in-box apps like Notepad and Paint in 2026, after pushback from users.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-is-reevaluating-its-ai-efforts-on-windows-11-plans-to-reduce-copilot-integrations-and-evolve-recall\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-is-reevaluating-its-ai-efforts-on-windows-11-plans-to-reduce-copilot-integrations-and-evolve-recall",
    "topic": "it",
    "date": "2026-01-30T11:47:21.000Z"
  },
  {
    "title": " Microsoft explores bringing Linux-like top menu bar to Windows 11 with new PowerToys feature ",
    "q": " microsoft explores bringing linux-like top menu bar to windows 11 with new powertoys feature  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft explores bringing Linux-like top menu bar to Windows 11 with new PowerToys feature </b><br>Microsoft's PowerToys team is exploring a new feature that would add a menu bar to the top of the Windows desktop, offering power user shortcuts similar to the menu bar on a Mac or Linux distro.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-explores-bringing-linux-like-top-menu-bar-to-windows-11-with-new-powertoys-feature\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-explores-bringing-linux-like-top-menu-bar-to-windows-11-with-new-powertoys-feature",
    "topic": "it",
    "date": "2026-01-30T00:22:04.000Z"
  },
  {
    "title": " 80% of game devs plan to target Windows PC in survey — with only 40% for PS5 and Nintendo Switch 2, and 20% for Xbox. It's lucky the next Xbox is a PC then, eh?  ",
    "q": " 80% of game devs plan to target windows pc in survey — with only 40% for ps5 and nintendo switch 2, and 20% for xbox. it's lucky the next xbox is a pc then, eh?   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> 80% of game devs plan to target Windows PC in survey — with only 40% for PS5 and Nintendo Switch 2, and 20% for Xbox. It's lucky the next Xbox is a PC then, eh?  </b><br>Steam and Windows stays winning, as console support no longer seems to be a priority for game devs.<br><a href=\"https://www.windowscentral.com/gaming/80-percent-of-game-devs-plan-to-target-windows-pc-in-survey-with-only-40-percent-for-ps5-and-nintendo-switch-2-and-20-percent-for-xbox-its-lucky-the-next-xbox-is-a-pc-then-eh\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/80-percent-of-game-devs-plan-to-target-windows-pc-in-survey-with-only-40-percent-for-ps5-and-nintendo-switch-2-and-20-percent-for-xbox-its-lucky-the-next-xbox-is-a-pc-then-eh",
    "topic": "it",
    "date": "2026-01-30T00:21:20.000Z"
  },
  {
    "title": " Microsoft loses a massive $440 billion in market cap as shares tank — investors get increasingly sceptical of its AI strategy ",
    "q": " microsoft loses a massive $440 billion in market cap as shares tank — investors get increasingly sceptical of its ai strategy  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft loses a massive $440 billion in market cap as shares tank — investors get increasingly sceptical of its AI strategy </b><br>Microsoft investors didn't enjoy the company's FY26 Q2 report, as fears of its AI strategy begin to unravel into despair.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-loses-a-massive-usd440-billion-in-market-cap-as-shares-tank-investors-get-increasingly-sceptical-of-its-ai-strategy\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-loses-a-massive-usd440-billion-in-market-cap-as-shares-tank-investors-get-increasingly-sceptical-of-its-ai-strategy",
    "topic": "it",
    "date": "2026-01-29T22:56:13.000Z"
  },
  {
    "title": "Windows 11 KB5074105 update fixes boot, sign-in, and activation issues",
    "q": "windows 11 kb5074105 update fixes boot, sign-in, and activation issues windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 KB5074105 update fixes boot, sign-in, and activation issues</b><br>Microsoft has released the KB5074105 preview cumulative update for Windows 11 systems, which includes 32 changes, including fixes for sign-in, boot, and activation issues. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5074105-update-fixes-boot-sign-in-and-activation-issues/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5074105-update-fixes-boot-sign-in-and-activation-issues/",
    "topic": "it",
    "date": "2026-01-30T12:02:09.000Z"
  },
  {
    "title": "Microsoft links Windows 11 boot failures to failed December 2025 update",
    "q": "microsoft links windows 11 boot failures to failed december 2025 update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft links Windows 11 boot failures to failed December 2025 update</b><br>Microsoft has linked recent reports of Windows 11 boot failures after installing the January 2026 updates to previously failed attempts to install the December 2025 security update, which left systems in an \"improper state.\" [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-links-windows-11-boot-failures-to-failed-december-2025-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-links-windows-11-boot-failures-to-failed-december-2025-update/",
    "topic": "it",
    "date": "2026-01-30T00:21:49.000Z"
  },
  {
    "title": "Match Group breach exposes data from Hinge, Tinder, OkCupid, and Match",
    "q": "match group breach exposes data from hinge, tinder, okcupid, and match windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Match Group breach exposes data from Hinge, Tinder, OkCupid, and Match</b><br>Match Group, the owner of multiple popular online dating services, Tinder, Match.com, Meetic, OkCupid, and Hinge, confirmed a cybersecurity incident that compromised user data. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/match-group-breach-exposes-data-from-hinge-tinder-okcupid-and-match/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/match-group-breach-exposes-data-from-hinge-tinder-okcupid-and-match/",
    "topic": "it",
    "date": "2026-01-29T18:09:40.000Z"
  },
  {
    "title": "Marquis blames ransomware breach on SonicWall cloud backup hack",
    "q": "marquis blames ransomware breach on sonicwall cloud backup hack windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Marquis blames ransomware breach on SonicWall cloud backup hack</b><br>Marquis Software Solutions, a Texas-based financial services provider, is blaming a ransomware attack that impacted its systems and affected dozens of U.S. banks and credit unions in August 2025 on a security breach reported by SonicWall a…<br><a href=\"https://www.bleepingcomputer.com/news/security/marquis-blames-ransomware-breach-on-sonicwall-cloud-backup-hack/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/marquis-blames-ransomware-breach-on-sonicwall-cloud-backup-hack/",
    "topic": "it",
    "date": "2026-01-29T17:57:58.000Z"
  },
  {
    "title": "New Microsoft Teams feature will let you report suspicious calls",
    "q": "new microsoft teams feature will let you report suspicious calls windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New Microsoft Teams feature will let you report suspicious calls</b><br>Microsoft plans to introduce a call reporting feature in Teams by mid-March, allowing users to flag suspicious or unwanted calls as potential scams or phishing attempts. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/new-microsoft-teams-feature-will-let-you-report-suspicious-calls/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/new-microsoft-teams-feature-will-let-you-report-suspicious-calls/",
    "topic": "it",
    "date": "2026-01-29T14:49:47.000Z"
  },
  {
    "title": "How to use Formula by Example in Excel to generate complex formulas",
    "q": "how to use formula by example in excel to generate complex formulas windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How to use Formula by Example in Excel to generate complex formulas</b><br>I traded the static results of Flash Fill for dynamic formulas that update automatically.<br><a href=\"https://www.howtogeek.com/microsoft-excel-formula-by-example/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-formula-by-example/",
    "topic": "it",
    "date": "2026-01-30T12:30:16.000Z"
  },
  {
    "title": "Microsoft admits Windows 11 needs work, so it'll focus on improving things over 2026",
    "q": "microsoft admits windows 11 needs work, so it'll focus on improving things over 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft admits Windows 11 needs work, so it'll focus on improving things over 2026</b><br>Here's hoping it works.<br><a href=\"https://www.xda-developers.com/microsoft-admits-windows-11-needs-work-so-itll-focus-on-improving-things-over-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/microsoft-admits-windows-11-needs-work-so-itll-focus-on-improving-things-over-2026/",
    "topic": "it",
    "date": "2026-01-30T07:42:43.000Z"
  },
  {
    "title": "This amazing Linux CPU scheduler uses the power of the stars to decide which processes to focus on",
    "q": "this amazing linux cpu scheduler uses the power of the stars to decide which processes to focus on windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This amazing Linux CPU scheduler uses the power of the stars to decide which processes to focus on</b><br>Astrology meets computer science.<br><a href=\"https://www.xda-developers.com/this-amazing-linux-cpu-scheduler-uses-the-power-of-the-stars-to-decide-which-processes-to-focus-on/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/this-amazing-linux-cpu-scheduler-uses-the-power-of-the-stars-to-decide-which-processes-to-focus-on/",
    "topic": "it",
    "date": "2026-01-30T06:11:42.000Z"
  },
  {
    "title": "Criminals are exploiting a 2025 WinRAR bug because nobody is updating their app",
    "q": "criminals are exploiting a 2025 winrar bug because nobody is updating their app windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Criminals are exploiting a 2025 WinRAR bug because nobody is updating their app</b><br>Or reading the warnings, apparently.<br><a href=\"https://www.xda-developers.com/criminals-exploiting-2025-winrar-bug-nobody-updating-app/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/criminals-exploiting-2025-winrar-bug-nobody-updating-app/",
    "topic": "it",
    "date": "2026-01-30T02:31:37.000Z"
  },
  {
    "title": "This Windows 11 tweak made my old laptop feel new again",
    "q": "this windows 11 tweak made my old laptop feel new again windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This Windows 11 tweak made my old laptop feel new again</b><br>Thankfully, I can put off upgrading for a few more years.<br><a href=\"https://www.xda-developers.com/windows-11-tweak-made-old-laptop-feel-new-again/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-11-tweak-made-old-laptop-feel-new-again/",
    "topic": "it",
    "date": "2026-01-30T00:00:21.000Z"
  }
]