[
  {
    "title": "The Limits of Tech and Why Smartphones Don’t Operate Under the Same Rules as ‘Real’ Cameras",
    "q": "The Limits of Tech and Why Smartphones Don’t Operate Under the Same Rules as ‘Real’ Cameras PetaPixel",
    "a": "<b>The Limits of Tech and Why Smartphones Don’t Operate Under the Same Rules as ‘Real’ Cameras</b><br>While smartphone cameras and standalone cameras (which are sometimes referred to as \"real\" cameras) are often marketed using the same terms, the way they each function is very different. In a video published to TED-Ed, …<br><a href=\"https://petapixel.com/2025/10/06/the-limits-of-tech-and-why-smartphones-dont-operate-under-the-same-rules-as-real-cameras/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "CIPA Shows Camera Sales’ Summer Slump Worse Than the Last Two Years",
    "q": "CIPA Shows Camera Sales’ Summer Slump Worse Than the Last Two Years PetaPixel",
    "a": "<b>CIPA Shows Camera Sales’ Summer Slump Worse Than the Last Two Years</b><br>CIPA released updated camera shipment data, adding camera and lens shipment data through August. Although camera shipments were relatively high for much of the year, there was a significant dip from July to August, whic…<br><a href=\"https://petapixel.com/2025/10/06/cipa-shows-camera-sales-summer-slump-worse-than-the-last-two-years/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Judge Permanently Dismisses Lawsuit Over Nirvana ‘Nevermind’ Cover Photo",
    "q": "Judge Permanently Dismisses Lawsuit Over Nirvana ‘Nevermind’ Cover Photo PetaPixel",
    "a": "<b>Judge Permanently Dismisses Lawsuit Over Nirvana ‘Nevermind’ Cover Photo</b><br>The man photographed as a baby on Nirvana’s Nevermind album cover has lost his latest lawsuit against the band for distributing child sexual abuse imagery. [Read More]<br><a href=\"https://petapixel.com/2025/10/06/judge-permanently-dismisses-lawsuit-over-nirvana-nevermind-cover-photo/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Amazon Prime Video Edits Gun Out of James Bond’s Hand in Promo Poster",
    "q": "Amazon Prime Video Edits Gun Out of James Bond’s Hand in Promo Poster PetaPixel",
    "a": "<b>Amazon Prime Video Edits Gun Out of James Bond’s Hand in Promo Poster</b><br>A series of promotional posters for James Bond movies on Amazon Prime Video were edited so that 007 was missing his gun. The pictures have since been taken down after fan backlash. [Read More]<br><a href=\"https://petapixel.com/2025/10/06/amazon-prime-video-edits-gun-out-of-james-bonds-hand-in-promo-poster/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Blackmagic RAW, ‘World’s Fastest RAW Format,’  Arrives Soon On Select Sony Cameras",
    "q": "Blackmagic RAW, ‘World’s Fastest RAW Format,’  Arrives Soon On Select Sony Cameras PetaPixel",
    "a": "<b>Blackmagic RAW, ‘World’s Fastest RAW Format,’  Arrives Soon On Select Sony Cameras</b><br>Last year, Sony promised a wide range of software improvements and feature updates for its Cinema Line cameras, including Blackmagic RAW (BRAW). These promises are being fulfilled a few cameras at a time, and BRAW is ar…<br><a href=\"https://petapixel.com/2025/10/06/blackmagic-raw-worlds-fastest-raw-format-arrives-soon-on-select-sony-cameras/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Questions swirl over Affinity's future as Canva teases an announcement",
    "q": "Questions swirl over Affinity's future as Canva teases an announcement Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Questions swirl over Affinity's future as Canva teases an announcement</b><br>Logo: Affinity Affinity, a platform of creative apps developed by UK-based Serif, is mixing things up ahead of \"big changes\" coming on October 30. The website no longer offers a way to purchase its software, and the com…<br><a href=\"https://www.dpreview.com/news/2744582289/affinity-photo-apps-pulled-from-sale-big-changes-announced-canva-purchase\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "How to use my camera's light meter",
    "q": "How to use my camera's light meter Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>How to use my camera's light meter</b><br>Dialing in your aperture, shutter speed and ISO doesn't have to be a game of guesswork when using manual mode. If you're consistently getting overly dark or light photos, you may just need to learn how to use your light…<br><a href=\"https://www.dpreview.com/learn/9894615855/how-to-use-my-camera-s-light-meter\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge",
    "q": "Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge</b><br>Fall colors are on full display in Canada's Northwest Territories. I captured this photo along the Ingraham Trail several km outside Yellowknife, NTW. Although the primary purpose of my trip was to photograph the aurora…<br><a href=\"https://www.dpreview.com/articles/9275549403/october-2025-editors-photo-challenge-announced\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography",
    "q": "Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography</b><br>Go Tokura, Executive Vice President, Head of Imaging Group, Chief Executive of Imaging Business Operations Photo: Richard Butler Full disclosure: I've just returned from a trip to Japan paid for by Canon. Our usual poli…<br><a href=\"https://www.dpreview.com/articles/5354325480/a-visit-to-canon-in-japan-and-why-it-wants-to-be-the-porsche-911-of-photography\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Pastel landscapes and monochrome portraits shine at the Film Photography Awards",
    "q": "Pastel landscapes and monochrome portraits shine at the Film Photography Awards Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Pastel landscapes and monochrome portraits shine at the Film Photography Awards</b><br>2025 Analog Sparks International Film Photography Awards This Film Friday, we are highlighting the Analog Sparks 2025 International Film Photography Awards, showcasing diverse analog work from around the globe. This mar…<br><a href=\"https://www.dpreview.com/articles/4903665536/pastel-landscapes-and-monochrome-portraits-shine-at-the-film-photography-awards\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Lego Prime Day deals are live – up to 40% off Minecraft, Star Wars, and Harry Potter Advent Calendars ",
    "q": " Lego Prime Day deals are live – up to 40% off Minecraft, Star Wars, and Harry Potter Advent Calendars   Latest from TechRadar ",
    "a": "<b> Lego Prime Day deals are live – up to 40% off Minecraft, Star Wars, and Harry Potter Advent Calendars </b><br>Ahead of Amazon Prime Big Deal Days, you can save on Lego's entire lineup of 2025 Advent Calendars including Star Wars, Harry Potter, and Minecraft.<br><a href=\"https://www.techradar.com/streaming/entertainment/lego-prime-day-deals-are-live-up-to-40-percent-off-minecraft-star-wars-and-harry-potter-advent-calendars\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Nostalgia bait is winning as I'm about to buy this discounted Lego Game Boy on Prime Day ",
    "q": " Nostalgia bait is winning as I'm about to buy this discounted Lego Game Boy on Prime Day   Latest from TechRadar ",
    "a": "<b> Nostalgia bait is winning as I'm about to buy this discounted Lego Game Boy on Prime Day </b><br>Amazon is offering a small saving on the nostalgia-baiting Lego Game Boy, and I'm this close to cracking and adding it to my basket.<br><a href=\"https://www.techradar.com/seasonal-sales/nostalgia-bait-is-winning-as-im-about-to-buy-this-discounted-lego-game-boy-on-prime-day\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " The 8BitDo Arcade Controller is a great introduction to leverless fighting game controllers ",
    "q": " The 8BitDo Arcade Controller is a great introduction to leverless fighting game controllers   Latest from TechRadar ",
    "a": "<b> The 8BitDo Arcade Controller is a great introduction to leverless fighting game controllers </b><br>Leverless controllers for fighting games can be intimidating, but the 8BitDo Arcade Controller is a solid newcomer option.<br><a href=\"https://www.techradar.com/gaming/8bitdo-arcade-controller-review\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " If Apple gives up making a cheaper Vision Pro, its $3,500 headset could be doomed ",
    "q": " If Apple gives up making a cheaper Vision Pro, its $3,500 headset could be doomed   Latest from TechRadar ",
    "a": "<b> If Apple gives up making a cheaper Vision Pro, its $3,500 headset could be doomed </b><br>Apple is reportedly ditching its cheaper Vision Pro to focus on AR glasses, and that could have worrying consequences.<br><a href=\"https://www.techradar.com/computing/virtual-reality-augmented-reality/if-apple-gives-up-making-a-cheaper-vision-pro-its-usd3-500-headset-could-be-doomed\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Microsoft finally gets its act together to make Windows 11's taskbar work fully across multiple monitors ",
    "q": " Microsoft finally gets its act together to make Windows 11's taskbar work fully across multiple monitors   Latest from TechRadar ",
    "a": "<b> Microsoft finally gets its act together to make Windows 11's taskbar work fully across multiple monitors </b><br>After four years, Microsoft's finally managed to give Windows 11's taskbar a simple ability that's been missing since launch.<br><a href=\"https://www.techradar.com/computing/windows/microsoft-finally-gets-its-act-together-to-make-windows-11s-taskbar-work-fully-across-multiple-monitors\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "US v. Google redux: all the news from the ad tech trial",
    "q": "US v. Google redux: all the news from the ad tech trial The Verge",
    "a": "<b>US v. Google redux: all the news from the ad tech trial</b><br>On April 17th, 2025, Judge Brinkema ruled that Google did act illegally to acquire and maintain monopoly power in online advertising. Now, DOJ and Google lawyers are returning to the courtroom to argue over whether this…<br><a href=\"https://www.theverge.com/24237832/google-monopoly-trial-ad-tech-antitrust-us-search\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "OpenAI will let developers build apps that work inside ChatGPT",
    "q": "OpenAI will let developers build apps that work inside ChatGPT The Verge",
    "a": "<b>OpenAI will let developers build apps that work inside ChatGPT</b><br>OpenAI is introducing a way to work with apps right inside ChatGPT. The idea is that, from within a conversation with the chatbot, you can essentially tag in apps to help you complete a task while ChatGPT offers context…<br><a href=\"https://www.theverge.com/news/793039/openai-chatgpt-apps-developers-sdk-canva-zillow-devday-2025\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Lexar’s new SSD sticks to your iPhone and can survive nearly a 10-foot drop",
    "q": "Lexar’s new SSD sticks to your iPhone and can survive nearly a 10-foot drop The Verge",
    "a": "<b>Lexar’s new SSD sticks to your iPhone and can survive nearly a 10-foot drop</b><br>The ES5 SSD is MagSafe compatible. | Image: Lexar First announced in July, Lexar’s ES5 Magnetic Portable SSD is now available in a 1TB capacity for $119.99 or 2TB for $199.99. A 4TB version is also planned, but availabi…<br><a href=\"https://www.theverge.com/news/793032/lexar-es5-magnetic-magsafe-portable-ssd-apple-prores-4k\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "The best Apple deals to shop ahead of Amazon’s fall Prime Day event",
    "q": "The best Apple deals to shop ahead of Amazon’s fall Prime Day event The Verge",
    "a": "<b>The best Apple deals to shop ahead of Amazon’s fall Prime Day event</b><br>The entry-level AirPods 4 are already on sale for $89.99, essentially matching their all-time low. If the past is any indication, Prime Big Deal Days — Amazon’s upcoming fall Prime Day event — should deliver a wave of d…<br><a href=\"https://www.theverge.com/tech/784180/amazon-october-prime-day-sale-best-early-apple-deals-2025\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "All of the updates from OpenAI DevDay 2025",
    "q": "All of the updates from OpenAI DevDay 2025 The Verge",
    "a": "<b>All of the updates from OpenAI DevDay 2025</b><br>Since OpenAI launched ChatGPT in 2022, controversies have swirled over everything: whether Sam Altman should be CEO, chatbot safety, the environmental and power grid impact of AI datacenters, an ongoing feud with Elon M…<br><a href=\"https://www.theverge.com/news/640086/openai-chat-gpt-news-updates\" target=\"_blank\">Read more</a>"
  }
]