[
  {
    "title": "Google’s Nano Banana Pro AI Model Further Erodes Trust in Photos",
    "q": "google’s nano banana pro ai model further erodes trust in photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Google’s Nano Banana Pro AI Model Further Erodes Trust in Photos</b><br>Google has released a more advanced version of its Nano Banana AI image model, and it is becoming increasingly difficult to spot the difference between real and AI-generated photos. [Read More]<br><a href=\"https://petapixel.com/2025/11/26/googles-nano-banana-pro-ai-model-further-erodes-trust-in-photos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/26/googles-nano-banana-pro-ai-model-further-erodes-trust-in-photos/",
    "topic": "photo",
    "date": "2025-11-26T12:21:23.000Z"
  },
  {
    "title": "‘The Stringer’ on Netflix Review: Nobody Is Going to Believe Nick Ut Took ‘Napalm Girl’ Now",
    "q": "‘the stringer’ on netflix review: nobody is going to believe nick ut took ‘napalm girl’ now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘The Stringer’ on Netflix Review: Nobody Is Going to Believe Nick Ut Took ‘Napalm Girl’ Now</b><br>The Stringer: The Man Who Took the Photo, which lands on Netflix this week, opens with a line implying Nick Ut is a liar: \"What you do know is what you didn’t take.\" But is that really true? I've always thought the inverse makes more sense…<br><a href=\"https://petapixel.com/2025/11/25/the-stringer-on-netflix-review-nobody-is-going-to-believe-nick-ut-took-napalm-girl-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/the-stringer-on-netflix-review-nobody-is-going-to-believe-nick-ut-took-napalm-girl-now/",
    "topic": "photo",
    "date": "2025-11-25T18:59:31.000Z"
  },
  {
    "title": "Sony Future Filmmaker Awards Showcase Up-and-Coming Talent",
    "q": "sony future filmmaker awards showcase up-and-coming talent camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony Future Filmmaker Awards Showcase Up-and-Coming Talent</b><br>Alongside the annual Sony World Photography Awards, Sony and Creo also have a competition dedicated to filmmaking, the Sony Future Filmmaker Awards. [Read More]<br><a href=\"https://petapixel.com/2025/11/25/sony-future-filmmaker-awards-showcase-up-and-coming-talent/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/sony-future-filmmaker-awards-showcase-up-and-coming-talent/",
    "topic": "photo",
    "date": "2025-11-25T18:41:14.000Z"
  },
  {
    "title": "Thypoch’s Striking Eureka 28mm f/2.8 Lens Is Inspired By the 1950s Ilford Advocate Camera",
    "q": "thypoch’s striking eureka 28mm f/2.8 lens is inspired by the 1950s ilford advocate camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Thypoch’s Striking Eureka 28mm f/2.8 Lens Is Inspired By the 1950s Ilford Advocate Camera</b><br>Thypoch is launching another new lens that blends modern imaging performance with old-school inspiration. The Thypoch Eureka 28mm f/2.8 ASPH. is extraordinarily compact and pays tribute to the gorgeous Ilford Advocate camera's built-in Dal…<br><a href=\"https://petapixel.com/2025/11/25/thypochs-striking-eureka-28mm-f-2-8-lens-is-inspired-by-the-1950s-ilford-advocate-camera/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/thypochs-striking-eureka-28mm-f-2-8-lens-is-inspired-by-the-1950s-ilford-advocate-camera/",
    "topic": "photo",
    "date": "2025-11-25T17:31:14.000Z"
  },
  {
    "title": "597-Foot Photo Elevator in Bali Torn Down After Outcry From Locals",
    "q": "597-foot photo elevator in bali torn down after outcry from locals camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>597-Foot Photo Elevator in Bali Torn Down After Outcry From Locals</b><br>A controversial glass elevator built as a photo attraction for tourists has been cancelled mid-way through construction and is set for demolition following widespread criticism. [Read More]<br><a href=\"https://petapixel.com/2025/11/25/597-foot-photo-elevator-in-bali-torn-down-after-outcry-from-locals/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/597-foot-photo-elevator-in-bali-torn-down-after-outcry-from-locals/",
    "topic": "photo",
    "date": "2025-11-25T16:38:19.000Z"
  },
  {
    "title": "Laowa 35mm f/2.8 Zero-D Tilt-Shift 0.5x Macro Lens Promises Unparalleled Versatility",
    "q": "laowa 35mm f/2.8 zero-d tilt-shift 0.5x macro lens promises unparalleled versatility camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Laowa 35mm f/2.8 Zero-D Tilt-Shift 0.5x Macro Lens Promises Unparalleled Versatility</b><br>Venus Optics has announced an unusual new lens that does a bit of everything. The Laowa 35mm f/2.8 Zero-D Tilt-Shift 0.5x Macro, as its name suggests, tilts, shifts, and focuses very close while promising no distortion. The versatile new l…<br><a href=\"https://petapixel.com/2025/11/25/laowa-35mm-f-2-8-zero-d-tilt-shift-0-5x-macro-lens-promises-unparalleled-versatility/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/laowa-35mm-f-2-8-zero-d-tilt-shift-0-5x-macro-lens-promises-unparalleled-versatility/",
    "topic": "photo",
    "date": "2025-11-25T15:30:21.000Z"
  },
  {
    "title": "Brightin Star’s 50mm f/0.95 II Lens for Full-Frame Cameras Is Fast and Affordable",
    "q": "brightin star’s 50mm f/0.95 ii lens for full-frame cameras is fast and affordable camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Brightin Star’s 50mm f/0.95 II Lens for Full-Frame Cameras Is Fast and Affordable</b><br>Chinese lens maker Brightin Star has announced an upgraded version of its ultra-fast 50mm f/0.95 prime lens for full-frame mirrorless cameras. [Read More]<br><a href=\"https://petapixel.com/2025/11/25/brightin-stars-50mm-f-0-95-ii-lens-for-full-frame-cameras-is-fast-and-affordable/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/25/brightin-stars-50mm-f-0-95-ii-lens-for-full-frame-cameras-is-fast-and-affordable/",
    "topic": "photo",
    "date": "2025-11-25T14:54:23.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": "2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation",
    "q": "2025 royal photographic society awards reveal groundbreaking winners in art, science and innovation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation</b><br>Photos from left to right: Omar Victor Diop, Susan Derges HonFRPS and Jaskirt Dhaliwal-Boora The Royal Photographic Society has announced the recipients of its 2025 Awards. The contest highlights significant contributions across both the a…<br><a href=\"https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation",
    "topic": "photo",
    "date": "2025-11-24T15:55:00.000Z"
  },
  {
    "title": "The answers you missed: What our staff revealed in the DPReview AMA",
    "q": "the answers you missed: what our staff revealed in the dpreview ama camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The answers you missed: What our staff revealed in the DPReview AMA</b><br>Last week, the DPReview Editorial team hosted its first Ask Me Anything (AMA) event in the new forums. These AMA sessions are a great way to engage directly with our staff and pose those burning questions you've always wanted to ask. We ad…<br><a href=\"https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama",
    "topic": "photo",
    "date": "2025-11-23T15:00:00.000Z"
  },
  {
    "title": "Leica Q3 Monochrome sample gallery: all spelled out in black and white",
    "q": "leica q3 monochrome sample gallery: all spelled out in black and white camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Leica Q3 Monochrome sample gallery: all spelled out in black and white</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Richard Butler Leica recently released the Q3 Monochrom, a black-and-white-only version of its full-frame, fixed-lens camera. Like the color model, it feat…<br><a href=\"https://www.dpreview.com/samples/6018179961/leica-q3-monochrom-sample-gallery\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/samples/6018179961/leica-q3-monochrom-sample-gallery",
    "topic": "photo",
    "date": "2025-11-23T14:00:00.000Z"
  },
  {
    "title": "Tis the Season: the DPReview team discusses giving and getting gifts",
    "q": "tis the season: the dpreview team discusses giving and getting gifts camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Tis the Season: the DPReview team discusses giving and getting gifts</b><br>Next week marks the start of the gift-giving season in many parts of the world, so the DPReview team sat down to discuss the things people should keep in mind when shopping for the photographers and creators in their lives. We also shared …<br><a href=\"https://www.dpreview.com/videos/7563624966/dpreview-team-discussion-gifts-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/videos/7563624966/dpreview-team-discussion-gifts-2025",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "An ocean of emulsion: Christopher Nolan shot more than two million feet of film for The Odyssey",
    "q": "an ocean of emulsion: christopher nolan shot more than two million feet of film for the odyssey camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An ocean of emulsion: Christopher Nolan shot more than two million feet of film for The Odyssey</b><br>A promotional image for The Odyssey, which will feature Matt Damon as the titular Odysseus. Image: Universal Director Christopher Nolan is no stranger to epic undertakings, and his latest project pushes the limits even more. In a recent in…<br><a href=\"https://www.dpreview.com/articles/5098622254/christopher-nolan-2-million-feet-of-film-odyssey\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5098622254/christopher-nolan-2-million-feet-of-film-odyssey",
    "topic": "photo",
    "date": "2025-11-21T16:17:00.000Z"
  },
  {
    "title": "What’s in a lens name? A guide to Sigma's acronyms and features",
    "q": "what’s in a lens name? a guide to sigma's acronyms and features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What’s in a lens name? A guide to Sigma's acronyms and features</b><br>Image: Sigma Lens names can be complicated things. Companies often try to fit every detail of the lens into the name, resulting in a string of abbreviations. While Sigma isn't the worst offender, it tends to stack quite a few terms into th…<br><a href=\"https://www.dpreview.com/articles/9681030718/whats-in-a-lens-name-a-guide-to-sigmas-acronyms-and-features\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9681030718/whats-in-a-lens-name-a-guide-to-sigmas-acronyms-and-features",
    "topic": "photo",
    "date": "2025-11-21T14:00:00.000Z"
  },
  {
    "title": " Poco brings top-tier cameras and Bose-powered audio to the brand’s most flagship phone yet ",
    "q": " poco brings top-tier cameras and bose-powered audio to the brand’s most flagship phone yet  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Poco brings top-tier cameras and Bose-powered audio to the brand’s most flagship phone yet </b><br>Xiaomi’s budget brand steps into more premium flagship devices with the Poco F8 Ultra and F8 Pro<br><a href=\"https://www.digitalcameraworld.com/tech/android-phones/poco-brings-top-tier-cameras-and-bose-powered-audio-to-the-brands-most-flagship-phone-yet\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/android-phones/poco-brings-top-tier-cameras-and-bose-powered-audio-to-the-brands-most-flagship-phone-yet",
    "topic": "photo",
    "date": "2025-11-26T11:51:59.000Z"
  },
  {
    "title": " £400 off! This Nikon Z fc twin lens kit is an absolute steal this Black Friday! ",
    "q": " £400 off! this nikon z fc twin lens kit is an absolute steal this black friday!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> £400 off! This Nikon Z fc twin lens kit is an absolute steal this Black Friday! </b><br>You can pick up a Z fc plus 16-50mm and 50-250mm twin-lens kit for less than the usual price of a Z fc on its own!<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/gbp400-off-this-nikon-z-fc-twin-lens-kit-is-an-absolute-steal-this-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/gbp400-off-this-nikon-z-fc-twin-lens-kit-is-an-absolute-steal-this-black-friday",
    "topic": "photo",
    "date": "2025-11-26T11:22:35.000Z"
  },
  {
    "title": " My smartphone camera can’t get close enough. These new smartphone macro lenses put microscopic photos (and bokeh!) in your pocket ",
    "q": " my smartphone camera can’t get close enough. these new smartphone macro lenses put microscopic photos (and bokeh!) in your pocket  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> My smartphone camera can’t get close enough. These new smartphone macro lenses put microscopic photos (and bokeh!) in your pocket </b><br>The new Moment 10x Macro II lenses have more glass for sharper close-ups from a smartphone<br><a href=\"https://www.digitalcameraworld.com/tech/phone-accessories/my-smartphone-camera-cant-get-close-enough-these-new-smartphone-macro-lenses-put-microscopic-photos-and-bokeh-in-your-pocket\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/phone-accessories/my-smartphone-camera-cant-get-close-enough-these-new-smartphone-macro-lenses-put-microscopic-photos-and-bokeh-in-your-pocket",
    "topic": "photo",
    "date": "2025-11-26T11:02:00.000Z"
  },
  {
    "title": " Shot with a Canon EOS R5 and custom lighting, this magical, otherworldly photo captures a moth's glowing eyes ",
    "q": " shot with a canon eos r5 and custom lighting, this magical, otherworldly photo captures a moth's glowing eyes  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Shot with a Canon EOS R5 and custom lighting, this magical, otherworldly photo captures a moth's glowing eyes </b><br>Ivo Niermann reveals how he built custom lighting to photograph the tapetum lucidum effect in nocturnal insects<br><a href=\"https://www.digitalcameraworld.com/photography/nature-and-wildlife-photography/shot-with-a-canon-eos-r5-and-custom-lighting-this-magical-otherworldly-photo-captures-a-moths-glowing-eyes\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/nature-and-wildlife-photography/shot-with-a-canon-eos-r5-and-custom-lighting-this-magical-otherworldly-photo-captures-a-moths-glowing-eyes",
    "topic": "photo",
    "date": "2025-11-26T10:24:57.000Z"
  },
  {
    "title": " These Canon Refurb deals are a great way to make Black Friday sales more affordable! ",
    "q": " these canon refurb deals are a great way to make black friday sales more affordable!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These Canon Refurb deals are a great way to make Black Friday sales more affordable! </b><br>Grab these amazing Canon-refurbished camera deals with up to $1,400 off that beat all other Black Friday deals!<br><a href=\"https://www.digitalcameraworld.com/news/these-canon-refurb-deals-are-a-great-way-to-make-black-friday-more-affordable\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/news/these-canon-refurb-deals-are-a-great-way-to-make-black-friday-more-affordable",
    "topic": "photo",
    "date": "2025-11-26T09:04:00.000Z"
  },
  {
    "title": " This new ultra-fast 50mm f/0.95 lens sells for under $400/ £400 – and is the ultimate budget portrait and bokeh booster ",
    "q": " this new ultra-fast 50mm f/0.95 lens sells for under $400/ £400 – and is the ultimate budget portrait and bokeh booster  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This new ultra-fast 50mm f/0.95 lens sells for under $400/ £400 – and is the ultimate budget portrait and bokeh booster </b><br>Brightin Star MF 50mm f/0.95 II lands for Sony E, Nikon Z, Canon RF, and L-mount – giving full-frame shooters a super-fast prime at a bargain price<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/this-new-ultra-fast-50mm-f-0-95-lens-sells-for-under-usd400-gbp400-and-is-the-ultimate-budget-portrait-and-bokeh-booster\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/this-new-ultra-fast-50mm-f-0-95-lens-sells-for-under-usd400-gbp400-and-is-the-ultimate-budget-portrait-and-bokeh-booster",
    "topic": "photo",
    "date": "2025-11-26T08:55:45.000Z"
  },
  {
    "title": " Charming photo of a ladybird on a sunflower among the winners of My Perspective 2025 ",
    "q": " charming photo of a ladybird on a sunflower among the winners of my perspective 2025  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Charming photo of a ladybird on a sunflower among the winners of My Perspective 2025 </b><br>Entrants from Australia, China, France and the UK take top billing in the 15th Down's Syndrome Association annual international photo awards<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/charming-photo-of-a-ladybird-on-a-sunflower-among-the-winners-of-my-perspective-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/charming-photo-of-a-ladybird-on-a-sunflower-among-the-winners-of-my-perspective-2025",
    "topic": "photo",
    "date": "2025-11-26T08:05:00.000Z"
  },
  {
    "title": " Michael Kenna's snow photography shows how 10-hour exposures can reveal what both our eyes and sensors miss ",
    "q": " michael kenna's snow photography shows how 10-hour exposures can reveal what both our eyes and sensors miss  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Michael Kenna's snow photography shows how 10-hour exposures can reveal what both our eyes and sensors miss </b><br>This beautiful snow photography is a breath of fresh air in an age of instant images<br><a href=\"https://www.digitalcameraworld.com/photography/landscape-photography/michael-kennas-snow-photography-shows-how-10-hour-exposures-can-reveal-what-both-our-eyes-and-sensors-miss\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/landscape-photography/michael-kennas-snow-photography-shows-how-10-hour-exposures-can-reveal-what-both-our-eyes-and-sensors-miss",
    "topic": "photo",
    "date": "2025-11-26T07:10:00.000Z"
  },
  {
    "title": " My favorite cheap instant film camera has just dropped to $65 – and it includes everything you need to get started ",
    "q": " my favorite cheap instant film camera has just dropped to $65 – and it includes everything you need to get started  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> My favorite cheap instant film camera has just dropped to $65 – and it includes everything you need to get started </b><br>The Fujifilm Instax Mini SE is just $65 bundled with film, a case, and an album at Walmart<br><a href=\"https://www.digitalcameraworld.com/cameras/instant-cameras/my-favorite-cheap-instant-film-camera-has-just-dropped-to-usd65-and-it-includes-everything-you-need-to-get-started\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/my-favorite-cheap-instant-film-camera-has-just-dropped-to-usd65-and-it-includes-everything-you-need-to-get-started",
    "topic": "photo",
    "date": "2025-11-25T20:10:55.000Z"
  },
  {
    "title": " Solar winds could bring a surprise Thanksgiving-week aurora to photographers in 14 states ",
    "q": " solar winds could bring a surprise thanksgiving-week aurora to photographers in 14 states  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Solar winds could bring a surprise Thanksgiving-week aurora to photographers in 14 states </b><br>Solar winds could bring a potential G1 minor solar storm to northern latitudes on November 25 and 26<br><a href=\"https://www.digitalcameraworld.com/photography/astrophotography/solar-winds-could-bring-a-surprise-thanksgiving-week-aurora-to-photographers-in-14-states\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/astrophotography/solar-winds-could-bring-a-surprise-thanksgiving-week-aurora-to-photographers-in-14-states",
    "topic": "photo",
    "date": "2025-11-25T19:57:46.000Z"
  },
  {
    "title": "Best Booking Apps for Photographers",
    "q": "best booking apps for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Booking Apps for Photographers</b><br>As a photographer, managing your bookings and scheduling is an important but time consuming task that can detract from your productivity and workflow. However, with the increasing availability of scheduling and booking software and apps, m…<br><a href=\"https://www.slrlounge.com/best-booking-apps-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-booking-apps-for-photographers/",
    "topic": "photo",
    "date": "2025-11-25T23:34:28.000Z"
  },
  {
    "title": "What Camera Should I get? | How Many Megapixels Do I Need?",
    "q": "what camera should i get? | how many megapixels do i need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What Camera Should I get? | How Many Megapixels Do I Need?</b><br>What camera should I get is one of those fundamental questions that, at some point, we all ask. In this article, we cover one of the key measurements we all use when deciding which camera to purchase. Megapixels<br><a href=\"https://www.slrlounge.com/what-camera-should-i-get-how-many-megapixels-do-i-need/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/what-camera-should-i-get-how-many-megapixels-do-i-need/",
    "topic": "photo",
    "date": "2025-11-24T22:33:00.000Z"
  },
  {
    "title": "Aiarty Image Enhancer 3.5: Faster Photo Upscaling with Sharper, Cleaner Results (49% OFF Black Friday)",
    "q": "aiarty image enhancer 3.5: faster photo upscaling with sharper, cleaner results (49% off black friday) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aiarty Image Enhancer 3.5: Faster Photo Upscaling with Sharper, Cleaner Results (49% OFF Black Friday)</b><br>Aiarty has announced version 3.5 of its AI-powered image enhancement tool for Windows and macOS, adding precise control over sharpening, integrated color correction, and native support for NVIDIA’s new RTX 50-series GPUs. The update target…<br><a href=\"https://www.slrlounge.com/new-aiarty-image-enhancer-v3-5-faster-processing-and-precision-controlled-ai-upscaling/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/new-aiarty-image-enhancer-v3-5-faster-processing-and-precision-controlled-ai-upscaling/",
    "topic": "photo",
    "date": "2025-11-23T20:00:00.000Z"
  },
  {
    "title": "How to Calibrate Your Monitor For Accurate Results",
    "q": "how to calibrate your monitor for accurate results camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Calibrate Your Monitor For Accurate Results</b><br>A properly calibrated monitor is an essential part of color management and achieving the perfect image. But as a photographer, do you know as much as you should?<br><a href=\"https://www.slrlounge.com/why-calibrating-your-screen-is-important-how-to-do-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/why-calibrating-your-screen-is-important-how-to-do-it/",
    "topic": "photo",
    "date": "2025-11-23T16:21:00.000Z"
  },
  {
    "title": "Types of Camera Lenses Explained",
    "q": "types of camera lenses explained camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Types of Camera Lenses Explained</b><br>Do you know the difference between a Zoom lens and a Telephoto Lens? If you have ever wondered what all the different types of camera lenses are, then here is the complete guide you must read! Below, we will cover all types of camera lense…<br><a href=\"https://www.slrlounge.com/types-of-camera-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/types-of-camera-lenses/",
    "topic": "photo",
    "date": "2025-11-21T19:56:27.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-20T16:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "Uber’s robotaxi service in UAE now includes fully driverless vehicles",
    "q": "uber’s robotaxi service in uae now includes fully driverless vehicles windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Uber’s robotaxi service in UAE now includes fully driverless vehicles</b><br>Uber and WeRide are now deploying fully driverless vehicles as part of its robotaxi service in the United Arab Emarites. Customers in Abu Dhabi who request an UberX or Uber Comfort may be matched with a fully autonomous WeRide vehicle if t…<br><a href=\"https://www.theverge.com/news/828685/uber-weride-robotaxi-fully-driverless-uae\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/828685/uber-weride-robotaxi-fully-driverless-uae",
    "topic": "it",
    "date": "2025-11-26T07:00:00.000Z"
  },
  {
    "title": "These are my favorite Switch 2 accessories",
    "q": "these are my favorite switch 2 accessories windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These are my favorite Switch 2 accessories</b><br>The Switch 2 can be enjoyed right out of the box, but it’s even better with the right accessories. Some of these add-ons are more crucial than others, especially if you’re deciding what to buy early on. For example, a case and a screen pro…<br><a href=\"https://www.theverge.com/buying-guides/720160/best-switch-2-accessories\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/buying-guides/720160/best-switch-2-accessories",
    "topic": "it",
    "date": "2025-11-25T19:30:00.000Z"
  },
  {
    "title": " NordVPN Prime vs Proton Unlimited – which is the best premium VPN deal this Black Friday? ",
    "q": " nordvpn prime vs proton unlimited – which is the best premium vpn deal this black friday?  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> NordVPN Prime vs Proton Unlimited – which is the best premium VPN deal this Black Friday? </b><br>If you want to spend big on your security, you must choose wisely<br><a href=\"https://www.techradar.com/vpn/vpn-services/nordvpn-prime-vs-proton-unlimited-which-is-the-best-premium-vpn-deal-this-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/vpn/vpn-services/nordvpn-prime-vs-proton-unlimited-which-is-the-best-premium-vpn-deal-this-black-friday",
    "topic": "it",
    "date": "2025-11-26T12:32:39.000Z"
  },
  {
    "title": " ChatGPT’s voice mode just got a major upgrade – here are 5 things you need to know ",
    "q": " chatgpt’s voice mode just got a major upgrade – here are 5 things you need to know  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> ChatGPT’s voice mode just got a major upgrade – here are 5 things you need to know </b><br>ChatGPT’s voice mode has been updated with some impressive new features – here's what's changed.<br><a href=\"https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-voice-mode-just-got-a-major-upgrade-here-are-5-things-you-need-to-know\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/ai-platforms-assistants/chatgpt/chatgpts-voice-mode-just-got-a-major-upgrade-here-are-5-things-you-need-to-know",
    "topic": "it",
    "date": "2025-11-26T12:31:32.000Z"
  },
  {
    "title": " Tired of Apple and Samsung phones? This Black Friday deal saves you £100 on a fantastic Android alternative ",
    "q": " tired of apple and samsung phones? this black friday deal saves you £100 on a fantastic android alternative  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Tired of Apple and Samsung phones? This Black Friday deal saves you £100 on a fantastic Android alternative </b><br>This fantastic iPhone alternative is barely a month old, but you can already save £100 this Black Friday.<br><a href=\"https://www.techradar.com/phones/oppo-phones/tired-of-apple-and-samsung-phones-this-black-friday-deal-saves-you-gbp100-on-a-fantastic-android-alternative\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/phones/oppo-phones/tired-of-apple-and-samsung-phones-this-black-friday-deal-saves-you-gbp100-on-a-fantastic-android-alternative",
    "topic": "it",
    "date": "2025-11-26T12:31:17.000Z"
  },
  {
    "title": " Skip the Black Friday sales and grab one of these refurbished Sage coffee makers instead ",
    "q": " skip the black friday sales and grab one of these refurbished sage coffee makers instead  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Skip the Black Friday sales and grab one of these refurbished Sage coffee makers instead </b><br>Who needs Black Friday when you can get a premium espresso machine in nearly-new condition for hundreds of pounds less?<br><a href=\"https://www.techradar.com/home/coffee-machines/skip-the-black-friday-sales-and-grab-one-of-these-refurbished-sage-coffee-makers-instead\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/home/coffee-machines/skip-the-black-friday-sales-and-grab-one-of-these-refurbished-sage-coffee-makers-instead",
    "topic": "it",
    "date": "2025-11-26T12:23:13.000Z"
  },
  {
    "title": " Windows 11's Notepad gets support for tables and bolstered AI powers – and not everyone's happy ",
    "q": " windows 11's notepad gets support for tables and bolstered ai powers – and not everyone's happy  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11's Notepad gets support for tables and bolstered AI powers – and not everyone's happy </b><br>Microsoft continues to turn Windows 11's Notepad into WordPad after scrapping the latter app last year.<br><a href=\"https://www.techradar.com/computing/windows/windows-11s-notepad-gets-support-for-tables-and-bolstered-ai-powers-and-not-everyones-happy\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/windows-11s-notepad-gets-support-for-tables-and-bolstered-ai-powers-and-not-everyones-happy",
    "topic": "it",
    "date": "2025-11-26T12:22:13.000Z"
  },
  {
    "title": " Best Black Friday iPhone deals 2025: I've hand-picked the biggest price cuts from Apple, Verizon, T-Mobile, and others ",
    "q": " best black friday iphone deals 2025: i've hand-picked the biggest price cuts from apple, verizon, t-mobile, and others  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Best Black Friday iPhone deals 2025: I've hand-picked the biggest price cuts from Apple, Verizon, T-Mobile, and others </b><br>Looking to upgrade? Here's everything you need to know<br><a href=\"https://www.techradar.com/phones/iphone/best-black-friday-iphone-deals-2025-ive-hand-picked-the-biggest-price-cuts-from-apple-verizon-t-mobile-and-others\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/phones/iphone/best-black-friday-iphone-deals-2025-ive-hand-picked-the-biggest-price-cuts-from-apple-verizon-t-mobile-and-others",
    "topic": "it",
    "date": "2025-11-26T12:07:06.000Z"
  },
  {
    "title": "15 Genius Places to Put an Apple AirTag (and Other Trackers)",
    "q": "15 genius places to put an apple airtag (and other trackers) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>15 Genius Places to Put an Apple AirTag (and Other Trackers)</b><br>If you're prone to losing things, AirTags and other tracking technologies can help you locate them.<br><a href=\"https://www.cnet.com/news/15-genius-places-to-put-an-apple-airtag-and-other-trackers/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/news/15-genius-places-to-put-an-apple-airtag-and-other-trackers/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-26T11:00:42.000Z"
  },
  {
    "title": "The 3 Best Espresso Machines You Can Buy in 2025",
    "q": "the 3 best espresso machines you can buy in 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The 3 Best Espresso Machines You Can Buy in 2025</b><br>Start your holiday mornings with a high-quality brew from one of the best home espresso machines. These are our top Black Friday and Cyber Monday picks.<br><a href=\"https://www.cnet.com/home/kitchen-and-household/best-espresso-machine/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/home/kitchen-and-household/best-espresso-machine/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-26T01:26:00.000Z"
  },
  {
    "title": "I found the best Black Friday deals: 85+ sales from Apple, HBO, LG, Roku, and more tracked live",
    "q": "i found the best black friday deals: 85+ sales from apple, hbo, lg, roku, and more tracked live windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Black Friday deals: 85+ sales from Apple, HBO, LG, Roku, and more tracked live</b><br>Black Friday is just days away, and nearly every major retailer is offering discounts, like Disney+ and Hulu for $4.99 a month.<br><a href=\"https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu/",
    "topic": "it",
    "date": "2025-11-26T12:13:00.000Z"
  },
  {
    "title": "T-Mobile will give you a free iPhone 17, iPad, and Apple Watch right now - how the deal works",
    "q": "t-mobile will give you a free iphone 17, ipad, and apple watch right now - how the deal works windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>T-Mobile will give you a free iPhone 17, iPad, and Apple Watch right now - how the deal works</b><br>T-Mobile's new Ultimate Apple Bundle is one of our favorite Black Friday deals of 2025. We break down the details.<br><a href=\"https://www.zdnet.com/article/t-mobile-will-give-you-a-free-iphone-17-ipad-and-apple-watch-right-now-how-the-deal-works/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/t-mobile-will-give-you-a-free-iphone-17-ipad-and-apple-watch-right-now-how-the-deal-works/",
    "topic": "it",
    "date": "2025-11-26T10:00:44.000Z"
  },
  {
    "title": "Upgrade your 'incompatible' Windows 10 PC to Windows 11 for free - here's how",
    "q": "upgrade your 'incompatible' windows 10 pc to windows 11 for free - here's how windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Upgrade your 'incompatible' Windows 10 PC to Windows 11 for free - here's how</b><br>Microsoft really doesn't want customers to upgrade older PCs to Windows 11, but there are workarounds for all but the oldest devices. Now that Windows 10 support has officially ended, here's everything you need to know.<br><a href=\"https://www.zdnet.com/article/upgrade-your-incompatible-windows-10-pc-to-windows-11-for-free-heres-how/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/upgrade-your-incompatible-windows-10-pc-to-windows-11-for-free-heres-how/",
    "topic": "it",
    "date": "2025-11-26T10:00:00.000Z"
  },
  {
    "title": "Your Windows 11 upgrade not working? Try my 5 favorite troubleshooting tricks",
    "q": "your windows 11 upgrade not working? try my 5 favorite troubleshooting tricks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Your Windows 11 upgrade not working? Try my 5 favorite troubleshooting tricks</b><br>If a Windows upgrade has ever gone sideways on you, you know how vague and unhelpful the error messages can be. Here are my go-to troubleshooting tricks when that happens.<br><a href=\"https://www.zdnet.com/article/your-windows-11-upgrade-not-working-try-my-4-favorite-troubleshooting-tricks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/your-windows-11-upgrade-not-working-try-my-4-favorite-troubleshooting-tricks/",
    "topic": "it",
    "date": "2025-11-26T10:00:00.000Z"
  },
  {
    "title": "I found the absolute best Black Friday streaming service and device deals",
    "q": "i found the absolute best black friday streaming service and device deals windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the absolute best Black Friday streaming service and device deals</b><br>Black Friday is only days away, but we've already found top streaming deals from HBO Max, Paramount+, Disney+ and Hulu, Apple TV, Peacock, and more.<br><a href=\"https://www.zdnet.com/article/black-friday-streaming-deals-hulu-youtube-tv-peacock/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-streaming-deals-hulu-youtube-tv-peacock/",
    "topic": "it",
    "date": "2025-11-26T03:20:01.000Z"
  },
  {
    "title": " Microsoft adds new \"app updates\" page to Windows 11's Settings app for updating certain apps using Windows Update ",
    "q": " microsoft adds new \"app updates\" page to windows 11's settings app for updating certain apps using windows update  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft adds new \"app updates\" page to Windows 11's Settings app for updating certain apps using Windows Update </b><br>A new \"app updates\" page has appeared in the Windows Settings app on Windows 11 in the latest preview builds, providing the ability to update apps using Windows Update.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-adds-new-app-updates-page-to-windows-11s-settings-app-for-updating-installed-apps-without-the-microsoft-store\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-adds-new-app-updates-page-to-windows-11s-settings-app-for-updating-installed-apps-without-the-microsoft-store",
    "topic": "it",
    "date": "2025-11-26T00:21:47.000Z"
  },
  {
    "title": " Uninstalling apps on Windows 11 is about to get much easier — and it’s long overdue ",
    "q": " uninstalling apps on windows 11 is about to get much easier — and it’s long overdue  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Uninstalling apps on Windows 11 is about to get much easier — and it’s long overdue </b><br>Microsoft is rolling out a handy uninstall option inside the Store library, giving Windows 11 users a faster way to remove apps without digging into Settings.<br><a href=\"https://www.windowscentral.com/software-apps/uninstalling-apps-on-windows-11-is-about-to-get-much-easier-and-its-long-overdue\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/uninstalling-apps-on-windows-11-is-about-to-get-much-easier-and-its-long-overdue",
    "topic": "it",
    "date": "2025-11-25T22:08:11.000Z"
  },
  {
    "title": " All‑day battery life in a premium Windows 11 laptop usually costs a fortune — but this Black Friday Dell Outlet deal drops the XPS 13 to just $589 ",
    "q": " all‑day battery life in a premium windows 11 laptop usually costs a fortune — but this black friday dell outlet deal drops the xps 13 to just $589  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> All‑day battery life in a premium Windows 11 laptop usually costs a fortune — but this Black Friday Dell Outlet deal drops the XPS 13 to just $589 </b><br>Dell's outlet is full of \"Like New\" refurbished PCs just begging to be given a second home, and right now, Black Friday pricing is cutting costs by several hundred dollars.<br><a href=\"https://www.windowscentral.com/hardware/dell/dell-outlet-sale-xps-13\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/dell/dell-outlet-sale-xps-13",
    "topic": "it",
    "date": "2025-11-25T21:48:12.000Z"
  },
  {
    "title": "ASUS warns of new critical auth bypass flaw in AiCloud routers",
    "q": "asus warns of new critical auth bypass flaw in aicloud routers windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>ASUS warns of new critical auth bypass flaw in AiCloud routers</b><br>ASUS has released new firmware to patch nine security vulnerabilities, including a critical authentication bypass flaw in routers with AiCloud enabled. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/asus-warns-of-new-critical-auth-bypass-flaw-in-aicloud-routers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/asus-warns-of-new-critical-auth-bypass-flaw-in-aicloud-routers/",
    "topic": "it",
    "date": "2025-11-26T11:41:00.000Z"
  },
  {
    "title": "The Black Friday 2025 Cybersecurity, IT, VPN, & Antivirus Deals",
    "q": "the black friday 2025 cybersecurity, it, vpn, & antivirus deals windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Black Friday 2025 Cybersecurity, IT, VPN, & Antivirus Deals</b><br>Black Friday 2025 is almost here, and early deals are already live across security software, online courses, system administration tools, antivirus products, and VPN services. These discounts are limited-time offers and vary by provider, s…<br><a href=\"https://www.bleepingcomputer.com/news/security/the-black-friday-2025-cybersecurity-it-vpn-and-antivirus-deals/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/the-black-friday-2025-cybersecurity-it-vpn-and-antivirus-deals/",
    "topic": "it",
    "date": "2025-11-25T19:14:06.000Z"
  },
  {
    "title": "Tor switches to new Counter Galois Onion relay encryption algorithm",
    "q": "tor switches to new counter galois onion relay encryption algorithm windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Tor switches to new Counter Galois Onion relay encryption algorithm</b><br>Tor has announced improved encryption and security for the circuit traffic by replacing the old tor1 relay encryption algorithm with a new design called Counter Galois Onion (CGO). [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/tor-switches-to-new-counter-galois-onion-relay-encryption-algorithm/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/tor-switches-to-new-counter-galois-onion-relay-encryption-algorithm/",
    "topic": "it",
    "date": "2025-11-25T17:09:19.000Z"
  },
  {
    "title": "Microsoft: Exchange Online outage blocks access to Outlook mailboxes",
    "q": "microsoft: exchange online outage blocks access to outlook mailboxes windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Exchange Online outage blocks access to Outlook mailboxes</b><br>Microsoft is investigating an Exchange Online service outage that is preventing customers from accessing their mailboxes using the classic Outlook desktop client. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-online-outage-blocks-access-to-outlook-mailboxes/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-exchange-online-outage-blocks-access-to-outlook-mailboxes/",
    "topic": "it",
    "date": "2025-11-25T16:18:12.000Z"
  },
  {
    "title": "Microsoft is speeding up the Teams desktop client for Windows",
    "q": "microsoft is speeding up the teams desktop client for windows windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft is speeding up the Teams desktop client for Windows</b><br>Microsoft says it will add a new Teams call handler beginning in January 2026 to reduce launch times and boost call performance for the Windows desktop client. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-to-boost-teams-performance-with-new-call-handler/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-boost-teams-performance-with-new-call-handler/",
    "topic": "it",
    "date": "2025-11-25T14:24:54.000Z"
  },
  {
    "title": "Year-end approaches: How to maximize your cyber spend",
    "q": "year-end approaches: how to maximize your cyber spend windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Year-end approaches: How to maximize your cyber spend</b><br>Year-end budgeting is the perfect time to close real security gaps by strengthening identity controls, reducing redundant tools, and investing in outcome-driven engagements. The article highlights how targeting credential risks and documen…<br><a href=\"https://www.bleepingcomputer.com/news/security/year-end-approaches-how-to-maximize-your-cyber-spend/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/year-end-approaches-how-to-maximize-your-cyber-spend/",
    "topic": "it",
    "date": "2025-11-25T14:03:20.000Z"
  },
  {
    "title": "LibreOffice-based Collabora Office gets a reboot on Linux, Windows, and Mac",
    "q": "libreoffice-based collabora office gets a reboot on linux, windows, and mac windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>LibreOffice-based Collabora Office gets a reboot on Linux, Windows, and Mac</b><br>A new simplified word processor, spreadsheet tool, and presentation editor for you to try.<br><a href=\"https://www.howtogeek.com/libreoffice-based-collabora-online-arrives-on-linux-windows-and-mac/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/libreoffice-based-collabora-online-arrives-on-linux-windows-and-mac/",
    "topic": "it",
    "date": "2025-11-26T12:00:14.000Z"
  },
  {
    "title": "Here are all the excellent features Microsoft added to Excel in November 2025",
    "q": "here are all the excellent features microsoft added to excel in november 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here are all the excellent features Microsoft added to Excel in November 2025</b><br>November brings several handy features for Excel users<br><a href=\"https://www.xda-developers.com/all-the-excellent-features-microsoft-added-to-excel-in-november-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/all-the-excellent-features-microsoft-added-to-excel-in-november-2025/",
    "topic": "it",
    "date": "2025-11-26T04:38:10.000Z"
  },
  {
    "title": "Microsoft may soon let you update all your apps directly from Windows 11's Settings",
    "q": "microsoft may soon let you update all your apps directly from windows 11's settings windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft may soon let you update all your apps directly from Windows 11's Settings</b><br>Finally.<br><a href=\"https://www.xda-developers.com/microsoft-may-soon-let-you-update-apps-directly-from-windows-11s-settings/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/microsoft-may-soon-let-you-update-apps-directly-from-windows-11s-settings/",
    "topic": "it",
    "date": "2025-11-26T02:48:44.000Z"
  }
]