[
  {
    "title": "Hear the Haunting Sounds of Two Rare Lynx Fighting on Trail Camera",
    "q": "hear the haunting sounds of two rare lynx fighting on trail camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Hear the Haunting Sounds of Two Rare Lynx Fighting on Trail Camera</b><br>A pair of rarely-seen Canada lynx were captured on a trail camera engaging in a dramatic standoff and exchanging loud, eerie calls. [Read More]<br><a href=\"https://petapixel.com/2025/12/02/hear-the-haunting-sound-of-two-rare-lynx-fighting-on-trail-camera-footage/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/02/hear-the-haunting-sound-of-two-rare-lynx-fighting-on-trail-camera-footage/",
    "topic": "photo",
    "date": "2025-12-02T11:54:09.000Z"
  },
  {
    "title": "The Best Gear for Winter Photography",
    "q": "the best gear for winter photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Best Gear for Winter Photography</b><br>There is a duality to shooting during winter. Cold, snowy days can be the catalyst for some amazing photos and adventures, but this can come at the expense of your gear. We’re going to cover some of the best gear from ProMaster to get you …<br><a href=\"https://petapixel.com/2025/12/01/the-best-gear-for-winter-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/the-best-gear-for-winter-photography/",
    "topic": "photo",
    "date": "2025-12-01T23:08:56.000Z"
  },
  {
    "title": "The Best Cyber Monday Deals for Photographers",
    "q": "the best cyber monday deals for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Best Cyber Monday Deals for Photographers</b><br>This year’s Cyber Monday roundup at B&H Photo Video is packed with gear that makes sense for photographers, from editing rigs to storage, tripods, printers, and more. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/the-best-cyber-monday-deals-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/the-best-cyber-monday-deals-for-photographers/",
    "topic": "photo",
    "date": "2025-12-01T19:50:31.000Z"
  },
  {
    "title": "Photographer Freezes Rapper Cam’ron’s Potential Earnings to Collect $51K Over Photo Infringement",
    "q": "photographer freezes rapper cam’ron’s potential earnings to collect $51k over photo infringement camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Freezes Rapper Cam’ron’s Potential Earnings to Collect $51K Over Photo Infringement</b><br>A photographer has taken a bold legal step to secure payment from rapper Cam’ron after winning a $51,000 copyright infringement judgment over her iconic photo of him. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/photographer-freezes-rapper-camrons-potential-earnings-to-collect-51k-over-photo-infringement/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/photographer-freezes-rapper-camrons-potential-earnings-to-collect-51k-over-photo-infringement/",
    "topic": "photo",
    "date": "2025-12-01T19:09:34.000Z"
  },
  {
    "title": "Pulitzer-Prize Winning Photographer Is Capturing Portraits Across America for US Semiquincentennial",
    "q": "pulitzer-prize winning photographer is capturing portraits across america for us semiquincentennial camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Pulitzer-Prize Winning Photographer Is Capturing Portraits Across America for US Semiquincentennial</b><br>The Carnegie Corporation named 26 Andrew Carnegie Fellows in 2025, providing scholarships up to $200,000. One of these 26 Fellows is a photographer/cinematographer: Pulitzer Prize winner Steven G. Smith, a professor at the University of Co…<br><a href=\"https://petapixel.com/2025/12/01/pulitzer-prize-winning-photographer-is-capturing-portraits-across-america-for-us-semiquincentennial/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/pulitzer-prize-winning-photographer-is-capturing-portraits-across-america-for-us-semiquincentennial/",
    "topic": "photo",
    "date": "2025-12-01T18:46:50.000Z"
  },
  {
    "title": "Oppo Find X9 Pro Review: This Phone Rocks for Photography",
    "q": "oppo find x9 pro review: this phone rocks for photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Oppo Find X9 Pro Review: This Phone Rocks for Photography</b><br>Come in for the camera but stick around for the battery life. That’s one way to sum up the Oppo Find X9 Pro, a flagship smartphone that makes a strong case for being one of the top three in the world. And with a global version available, t…<br><a href=\"https://petapixel.com/2025/12/01/oppo-find-x9-pro-review-this-phone-rocks-for-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/oppo-find-x9-pro-review-this-phone-rocks-for-photography/",
    "topic": "photo",
    "date": "2025-12-01T17:57:09.000Z"
  },
  {
    "title": "Pergear’s Fast New 50mm f/1.2 APS-C Lens Costs Under $100",
    "q": "pergear’s fast new 50mm f/1.2 aps-c lens costs under $100 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Pergear’s Fast New 50mm f/1.2 APS-C Lens Costs Under $100</b><br>Fast prime lenses don't need to break the bank. Pergear has announced a new 50mm f/1.2 manual-focus prime lens for APS-C mirrorless cameras, priced under $100. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/pergears-fast-new-50mm-f-1-2-aps-c-lens-costs-under-100/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/pergears-fast-new-50mm-f-1-2-aps-c-lens-costs-under-100/",
    "topic": "photo",
    "date": "2025-12-01T17:32:15.000Z"
  },
  {
    "title": "San Francisco Names Yet Another Street After a Legendary Photographer",
    "q": "san francisco names yet another street after a legendary photographer camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>San Francisco Names Yet Another Street After a Legendary Photographer</b><br>Legendary rock 'n' roll photographer Jim Marshall is to have a street named after him in San Francisco, close to his apartment where musicians would frequently mingle. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/san-francisco-names-street-after-photographer-jim-marshall/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/san-francisco-names-street-after-photographer-jim-marshall/",
    "topic": "photo",
    "date": "2025-12-01T16:18:16.000Z"
  },
  {
    "title": "Secret WWII Resistance Photo Album Found Beneath Apartment Floorboards",
    "q": "secret wwii resistance photo album found beneath apartment floorboards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Secret WWII Resistance Photo Album Found Beneath Apartment Floorboards</b><br>A secret cache of World War II photographs of the resistance has been found beneath the floorboards of an apartment, where the album had been concealed in Nazi-occupied Poland. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/secret-wwii-resistance-photo-album-found-beneath-apartment-floorboards/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/secret-wwii-resistance-photo-album-found-beneath-apartment-floorboards/",
    "topic": "photo",
    "date": "2025-12-01T15:18:46.000Z"
  },
  {
    "title": "DPReview Annual Awards: The best photography gear of 2025",
    "q": "dpreview annual awards: the best photography gear of 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Annual Awards: The best photography gear of 2025</b><br>The 2025 DPReview Annual Awards After careful consideration, healthy debate and a few heated arguments, we're proud to announce the winners of the 2025 DPReview Annual Awards. While innovation in the camera industry is often a gradual proc…<br><a href=\"https://www.dpreview.com/articles/4997046801/dpreview-annual-awards-the-best-photography-gear-of-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4997046801/dpreview-annual-awards-the-best-photography-gear-of-2025",
    "topic": "photo",
    "date": "2025-12-01T14:00:00.000Z"
  },
  {
    "title": "Reader photos of the year: Show us your best shot from 2025",
    "q": "reader photos of the year: show us your best shot from 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Reader photos of the year: Show us your best shot from 2025</b><br>Mt. Jefferson, a volcano in the Cascade Mountains, is illuminated at sunset near Sisters, Oregon, on November 18, 2025. I had my Olympus OM-1 with me when the sunset suddenly became very intense, and I managed to snap this photo in the bri…<br><a href=\"https://www.dpreview.com/articles/3951182772/reader-photos-of-the-year-2025-announced\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3951182772/reader-photos-of-the-year-2025-announced",
    "topic": "photo",
    "date": "2025-12-01T14:00:00.000Z"
  },
  {
    "title": "Compact camera bonanza: 20 standout shots from our November Editors' photo challenge",
    "q": "compact camera bonanza: 20 standout shots from our november editors' photo challenge camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Compact camera bonanza: 20 standout shots from our November Editors' photo challenge</b><br>The October Editors' photo challenge The theme for our November Editor's photo challenge was \"Compact Camera Bonanza.\" For this challenge, we asked you to share photos taken with compact, or fixed-lens, cameras, and wow, did you deliver! W…<br><a href=\"https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge",
    "topic": "photo",
    "date": "2025-11-30T14:00:00.000Z"
  },
  {
    "title": "Do you need to learn Manual mode right away?",
    "q": "do you need to learn manual mode right away? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do you need to learn Manual mode right away?</b><br>Photo: Abby Ferguson If you're a beginner photographer who spends any time on the internet, chances are you've been bombarded with content saying that you need to learn Manual mode immediately. It's a frequent refrain that \"real\" photograp…<br><a href=\"https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": " I haven’t picked up my camera in months, and I've found it's the best way to improve your photography! ",
    "q": " i haven’t picked up my camera in months, and i've found it's the best way to improve your photography!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I haven’t picked up my camera in months, and I've found it's the best way to improve your photography! </b><br>Why not shooting might be the best thing for your photography<br><a href=\"https://www.digitalcameraworld.com/photography/street-photography/i-havent-picked-up-my-camera-in-months-and-ive-found-its-the-best-way-to-improve-your-photography\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/street-photography/i-havent-picked-up-my-camera-in-months-and-ive-found-its-the-best-way-to-improve-your-photography",
    "topic": "photo",
    "date": "2025-12-02T11:58:24.000Z"
  },
  {
    "title": " Showcase your work and win awards: 10 photography competitions open for entries this December to May ",
    "q": " showcase your work and win awards: 10 photography competitions open for entries this december to may  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Showcase your work and win awards: 10 photography competitions open for entries this December to May </b><br>From landscapes and street to architecture, portraits, and beyond – these international photography contests want to see your images, open to photographers of all levels<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/showcase-your-work-and-win-awards-10-photography-competitions-open-for-entries-this-december-to-may\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/showcase-your-work-and-win-awards-10-photography-competitions-open-for-entries-this-december-to-may",
    "topic": "photo",
    "date": "2025-12-02T08:26:51.000Z"
  },
  {
    "title": " Astrophotography in December 2025: what to shoot in the night sky this coming month ",
    "q": " astrophotography in december 2025: what to shoot in the night sky this coming month  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Astrophotography in December 2025: what to shoot in the night sky this coming month </b><br>Everything you need to know about what’s happening in the night sky this month.<br><a href=\"https://www.digitalcameraworld.com/photography/astrophotography/astrophotography-in-december-2025-what-to-shoot-in-the-night-sky-this-coming-month\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/astrophotography/astrophotography-in-december-2025-what-to-shoot-in-the-night-sky-this-coming-month",
    "topic": "photo",
    "date": "2025-12-02T08:23:03.000Z"
  },
  {
    "title": " This compact camera is a pocket powerhouse! Panasonic's Lumix ZS99 / TZ99 is still reduced for Cyber Monday ",
    "q": " this compact camera is a pocket powerhouse! panasonic's lumix zs99 / tz99 is still reduced for cyber monday  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This compact camera is a pocket powerhouse! Panasonic's Lumix ZS99 / TZ99 is still reduced for Cyber Monday </b><br>Looking for a great deal on a compact camera? This palm-sized Panasonic has a 24-720mm lens, 20.3MP sensor and up to $55 saving<br><a href=\"https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/this-compact-camera-is-a-pocket-powerhouse-panasonics-lumix-zs99-tz99-is-still-reduced-for-cyber-monday\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/this-compact-camera-is-a-pocket-powerhouse-panasonics-lumix-zs99-tz99-is-still-reduced-for-cyber-monday",
    "topic": "photo",
    "date": "2025-12-02T03:08:00.000Z"
  },
  {
    "title": " Grab the Canon EOS R50 with a huge discount! Perfect for beginners, creators, travel and street photographers ",
    "q": " grab the canon eos r50 with a huge discount! perfect for beginners, creators, travel and street photographers  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Grab the Canon EOS R50 with a huge discount! Perfect for beginners, creators, travel and street photographers </b><br>Canon's ultra-compact creator, travel and beginner camera is slashed by up to $100 / £200!<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/grab-the-canon-eos-r50-with-a-huge-discount-perfect-for-beginners-creators-travel-and-street-photographers\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/grab-the-canon-eos-r50-with-a-huge-discount-perfect-for-beginners-creators-travel-and-street-photographers",
    "topic": "photo",
    "date": "2025-12-01T23:33:17.000Z"
  },
  {
    "title": " This new lens screams retro. The Pergear 50mm f/1.2 was inspired by lenses of the 1980s – and it's available in multiple mounts for a surprising price ",
    "q": " this new lens screams retro. the pergear 50mm f/1.2 was inspired by lenses of the 1980s – and it's available in multiple mounts for a surprising price  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This new lens screams retro. The Pergear 50mm f/1.2 was inspired by lenses of the 1980s – and it's available in multiple mounts for a surprising price </b><br>The Pergear 50mm f/1.2 is a new budget lens inspired by a lens from 1981 – and it has glow-in-the-dark markings<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/this-new-lens-screams-retro-the-pergear-50mm-f-1-2-was-inspired-by-lenses-of-the-1980s-and-its-available-in-multiple-mounts-for-a-surprising-price\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/this-new-lens-screams-retro-the-pergear-50mm-f-1-2-was-inspired-by-lenses-of-the-1980s-and-its-available-in-multiple-mounts-for-a-surprising-price",
    "topic": "photo",
    "date": "2025-12-01T21:26:16.000Z"
  },
  {
    "title": " I’m a pro photographer and a mom of three. These are the only kid camera deals that I’d consider adding to my cart ",
    "q": " i’m a pro photographer and a mom of three. these are the only kid camera deals that i’d consider adding to my cart  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I’m a pro photographer and a mom of three. These are the only kid camera deals that I’d consider adding to my cart </b><br>As both a photographer and a parent, these are the only kids' camera deals I'd consider for gifting this holiday season<br><a href=\"https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/im-a-pro-photographer-and-a-mom-of-three-these-are-the-only-kid-camera-deals-that-id-consider-adding-to-my-cart\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/im-a-pro-photographer-and-a-mom-of-three-these-are-the-only-kid-camera-deals-that-id-consider-adding-to-my-cart",
    "topic": "photo",
    "date": "2025-12-01T18:08:42.000Z"
  },
  {
    "title": " I've found the best Nikon Z6 III and kit lens deal, and it isn't the one you think ",
    "q": " i've found the best nikon z6 iii and kit lens deal, and it isn't the one you think  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I've found the best Nikon Z6 III and kit lens deal, and it isn't the one you think </b><br>If you're looking to get a Nikon Z6 III, you'll save money with a kit lens, but I reckon the Z 24-120mm f/4 S is the best choice, especially at this price…<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/ive-found-the-best-nikon-z6-iii-and-kit-lens-deal-and-it-isnt-the-one-you-think\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/ive-found-the-best-nikon-z6-iii-and-kit-lens-deal-and-it-isnt-the-one-you-think",
    "topic": "photo",
    "date": "2025-12-01T17:21:15.000Z"
  },
  {
    "title": "Filmora V15’s AI Extend: A New Tool for Smoothing Clips and Stretching Moments",
    "q": "filmora v15’s ai extend: a new tool for smoothing clips and stretching moments camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Filmora V15’s AI Extend: A New Tool for Smoothing Clips and Stretching Moments</b><br>What happens when a moment ends too soon on camera? For editors, that often means jumping through hoops—reshooting, looping footage, or faking slow motion—to create a smoother transition or preserve the emotional beat. Wondershare introduc…<br><a href=\"https://www.slrlounge.com/filmora-v15s-ai-extend-a-new-tool-for-smoothing-clips-and-stretching-moments/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/filmora-v15s-ai-extend-a-new-tool-for-smoothing-clips-and-stretching-moments/",
    "topic": "photo",
    "date": "2025-12-01T18:34:32.000Z"
  },
  {
    "title": "7 Winter Photography Tips, Ideas, and Examples",
    "q": "7 winter photography tips, ideas, and examples camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>7 Winter Photography Tips, Ideas, and Examples</b><br>If you think wintertime is an excuse to put your camera away and stay warm indoors, then you need to read this article! Winter photography can be one of the most rewarding challenges in photography, whether you are interested in landscapes…<br><a href=\"https://www.slrlounge.com/winter-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/winter-photography/",
    "topic": "photo",
    "date": "2025-12-01T18:14:14.000Z"
  },
  {
    "title": "Fitness Photography Tips: How to Images with Interest and Impact",
    "q": "fitness photography tips: how to images with interest and impact camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fitness Photography Tips: How to Images with Interest and Impact</b><br>Here a few simple tips to help you chisel out the human body using dramatic highlights and shadows, perfect for athletic and fitness portraiture.<br><a href=\"https://www.slrlounge.com/3-tips-for-dramatic-fitness-and-athletic-portraiture/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-tips-for-dramatic-fitness-and-athletic-portraiture/",
    "topic": "photo",
    "date": "2025-12-01T18:11:58.000Z"
  },
  {
    "title": "Newborn Photography Props and Ideas",
    "q": "newborn photography props and ideas camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Newborn Photography Props and Ideas</b><br>When it comes to producing great newborn photography images, creative newborn photography props and ideas can be the difference between an amateur photo and a high-quality, professional photo. Afterall, you could have all of the best camer…<br><a href=\"https://www.slrlounge.com/newborn-photography-props-ideas/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/newborn-photography-props-ideas/",
    "topic": "photo",
    "date": "2025-12-01T02:04:26.000Z"
  },
  {
    "title": "Fall Children’s Portrait Photography Tutorial",
    "q": "fall children’s portrait photography tutorial camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fall Children’s Portrait Photography Tutorial</b><br>We're going to create a rich, Autumn-toned portrait, from start to finish.<br><a href=\"https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/",
    "topic": "photo",
    "date": "2025-11-30T06:06:28.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "DRAM it! Raspberry Pi raises prices",
    "q": "dram it! raspberry pi raises prices windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>DRAM it! Raspberry Pi raises prices</b><br>The 16GB version of the Raspberry Pi 5 (pictured) has jumped from $120 to $145. Raspberry Pi is increasing the price of several single-board computers in an attempt to offset soaring memory costs. The updates are being applied immediately …<br><a href=\"https://www.theverge.com/news/836221/raspberry-pi-price-increases-ram-costs\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/836221/raspberry-pi-price-increases-ram-costs",
    "topic": "it",
    "date": "2025-12-02T12:16:51.000Z"
  },
  {
    "title": "Microsoft&#8217;s latest Windows 11 update improves and breaks dark mode",
    "q": "microsoft&#8217;s latest windows 11 update improves and breaks dark mode windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft&#8217;s latest Windows 11 update improves and breaks dark mode</b><br>You can’t make this up. Microsoft shipped a Windows 11 update yesterday that is supposed to make dark mode more consistent, with dialogs in File Explorer finally getting a dark mode for actions like copying, moving, or deleting files and f…<br><a href=\"https://www.theverge.com/news/836199/microsoft-windows-11-file-explorer-white-screen-flash-bug\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/836199/microsoft-windows-11-file-explorer-white-screen-flash-bug",
    "topic": "it",
    "date": "2025-12-02T11:34:44.000Z"
  },
  {
    "title": "These last-minute Cyber Monday deals will likely be gone tomorrow",
    "q": "these last-minute cyber monday deals will likely be gone tomorrow windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These last-minute Cyber Monday deals will likely be gone tomorrow</b><br>Editor’s note: Cyber Monday 2025 is officially in the books — at least for us. We’ll no longer be updating this post; however, if you want to dig further into what Cyber Monday still has to offer, be sure to check out our comprehensive gui…<br><a href=\"https://www.theverge.com/gadgets/834422/cyber-monday-2025-best-deals-tech-gadgets-gift-ideas\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834422/cyber-monday-2025-best-deals-tech-gadgets-gift-ideas",
    "topic": "it",
    "date": "2025-12-02T06:18:11.000Z"
  },
  {
    "title": "The best Apple deals you can still shop in Cyber Monday’s final hours",
    "q": "the best apple deals you can still shop in cyber monday’s final hours windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Apple deals you can still shop in Cyber Monday’s final hours</b><br>Apple’s latest MacBook Pro is up to $250 off for Cyber Monday. If you’re planning to gift an Apple device this holiday season — or treat yourself — time is now running out to take advantage of the latest Cyber Monday promos. The annual sho…<br><a href=\"https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025",
    "topic": "it",
    "date": "2025-12-02T04:20:52.000Z"
  },
  {
    "title": "These Verge-approved gifts are still available for up to 60 percent off for Cyber Monday",
    "q": "these verge-approved gifts are still available for up to 60 percent off for cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These Verge-approved gifts are still available for up to 60 percent off for Cyber Monday</b><br>The Aura Aspen is one of many gift-worthy items you can still pick up for Cyber Monday. If you’re hoping to whittle down your wish list before the holiday panic truly sets in, Cyber Monday presents a prime opportunity. Many of the tech-y g…<br><a href=\"https://www.theverge.com/gadgets/833050/cyber-monday-2025-gift-ideas-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833050/cyber-monday-2025-gift-ideas-deal-sale",
    "topic": "it",
    "date": "2025-12-02T04:04:59.000Z"
  },
  {
    "title": "Here are 50+ Cyber Monday deals you can still get for $100 or less",
    "q": "here are 50+ cyber monday deals you can still get for $100 or less windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here are 50+ Cyber Monday deals you can still get for $100 or less</b><br>Amazon’s latest entry-level Kindle is still available for less than $100 — that is, if you act fast enough. When the deals are flying fast and furious, it can be easy to overspend, especially when OLED TVs, laptops, and other great pieces …<br><a href=\"https://www.theverge.com/gadgets/833655/cyber-monday-best-cheap-tech-deals-under-100-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833655/cyber-monday-best-cheap-tech-deals-under-100-2025",
    "topic": "it",
    "date": "2025-12-02T03:35:11.000Z"
  },
  {
    "title": "We found 45 of the best last-minute Cyber Monday deals under $30",
    "q": "we found 45 of the best last-minute cyber monday deals under $30 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>We found 45 of the best last-minute Cyber Monday deals under $30</b><br>Nomad’s tracking card can help you keep tabs on your wallet if it goes missing. | Image: Nomad One of the pitfalls of Cyber Monday is getting overwhelmed by deep discounts on premium gadgets. After all, who wouldn’t want to save hundreds, …<br><a href=\"https://www.theverge.com/gadgets/835702/cyber-monday-best-cheap-tech-deals-under-30-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/835702/cyber-monday-best-cheap-tech-deals-under-30-2025",
    "topic": "it",
    "date": "2025-12-02T03:30:00.000Z"
  },
  {
    "title": "Samsung’s Z TriFold is official and it looks like a tablet with a phone attached",
    "q": "samsung’s z trifold is official and it looks like a tablet with a phone attached windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Samsung’s Z TriFold is official and it looks like a tablet with a phone attached</b><br>I kind of wish they’d called it the Z Fold Fold. Samsung is officially announcing the Z TriFold, its much-anticipated foldable with not one, but two hinges. It’ll launch first in South Korea on December 12th, with a US launch planned for t…<br><a href=\"https://www.theverge.com/news/835525/samsung-z-trifold-announcement-us-availability\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/835525/samsung-z-trifold-announcement-us-availability",
    "topic": "it",
    "date": "2025-12-02T01:00:00.000Z"
  },
  {
    "title": " Cyber Monday's best coffee maker deal is still running – save £600 on this premium Siemens espresso machine ",
    "q": " cyber monday's best coffee maker deal is still running – save £600 on this premium siemens espresso machine  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Cyber Monday's best coffee maker deal is still running – save £600 on this premium Siemens espresso machine </b><br>Marks Electrical knocked 40% off this feature-packed coffee machine for Cyber Monday, but the price could go back up at any time.<br><a href=\"https://www.techradar.com/home/coffee-machines/cyber-mondays-best-coffee-maker-deal-is-still-running-save-gbp600-on-this-premium-siemens-espresso-machine\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/home/coffee-machines/cyber-mondays-best-coffee-maker-deal-is-still-running-save-gbp600-on-this-premium-siemens-espresso-machine",
    "topic": "it",
    "date": "2025-12-02T12:14:11.000Z"
  },
  {
    "title": " Swiss government urges people to ditch Microsoft 365 and others due to lack of proper encryption ",
    "q": " swiss government urges people to ditch microsoft 365 and others due to lack of proper encryption  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Swiss government urges people to ditch Microsoft 365 and others due to lack of proper encryption </b><br>A lack of E2EE and sufficient transparency has Switzerland worried about American hyperscalers.<br><a href=\"https://www.techradar.com/pro/security/swiss-government-urges-people-to-ditch-microsoft-365-and-others-due-to-lack-of-proper-encryption\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/swiss-government-urges-people-to-ditch-microsoft-365-and-others-due-to-lack-of-proper-encryption",
    "topic": "it",
    "date": "2025-12-02T10:20:00.000Z"
  },
  {
    "title": " Cyber Monday isn’t over yet: the M1 MacBook Air is just $499 ",
    "q": " cyber monday isn’t over yet: the m1 macbook air is just $499  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Cyber Monday isn’t over yet: the M1 MacBook Air is just $499 </b><br>Not the most powerful, but a wild deal for the price<br><a href=\"https://www.techradar.com/seasonal-sales/cyber-monday-isnt-over-yet-the-m1-macbook-air-is-just-usd499\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/seasonal-sales/cyber-monday-isnt-over-yet-the-m1-macbook-air-is-just-usd499",
    "topic": "it",
    "date": "2025-12-02T04:56:56.000Z"
  },
  {
    "title": "Best Apple Watch for 2025",
    "q": "best apple watch for 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Best Apple Watch for 2025</b><br>A breakdown of the best Apple Watches of the year, based on budget, health features, and battery life.<br><a href=\"https://www.cnet.com/tech/mobile/best-apple-watch/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/mobile/best-apple-watch/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-12-02T01:17:00.000Z"
  },
  {
    "title": "I found the best Cyber Monday Apple Watch deals, but they're over soon",
    "q": "i found the best cyber monday apple watch deals, but they're over soon windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Cyber Monday Apple Watch deals, but they're over soon</b><br>Shop these Cyber Monday deals still available on Apple Watches, including the new Series 11, Ultra 3, and SE 3, before they're gone.<br><a href=\"https://www.zdnet.com/article/cyber-monday-apple-watch-deals-amazon-best-buy-walmart-12-1/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-apple-watch-deals-amazon-best-buy-walmart-12-1/",
    "topic": "it",
    "date": "2025-12-02T03:54:59.000Z"
  },
  {
    "title": "You can still save during Cyber Monday 2025: Shop my favorite deals from Amazon, Best Buy, Lowe's & more",
    "q": "you can still save during cyber monday 2025: shop my favorite deals from amazon, best buy, lowe's & more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>You can still save during Cyber Monday 2025: Shop my favorite deals from Amazon, Best Buy, Lowe's & more</b><br>Black Friday is over, and Cyber Monday has arrived. Every major retailer is offering big sales on items from Apple, Samsung, LG, Roku, and more.<br><a href=\"https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-12-1/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-12-1/",
    "topic": "it",
    "date": "2025-12-02T03:52:15.000Z"
  },
  {
    "title": "Amazon's 2025 Cyber Monday deals are live: Shop my favorite sales on Apple, Oura, and Bose before they're gone",
    "q": "amazon's 2025 cyber monday deals are live: shop my favorite sales on apple, oura, and bose before they're gone windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Amazon's 2025 Cyber Monday deals are live: Shop my favorite sales on Apple, Oura, and Bose before they're gone</b><br>Don't miss your last chance to shop Amazon's Cyber Monday deals, like the Hisense Canvas TV for $350 off.<br><a href=\"https://www.zdnet.com/article/cyber-monday-amazon-deals-ps5-earbuds-tvs-12-1/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-amazon-deals-ps5-earbuds-tvs-12-1/",
    "topic": "it",
    "date": "2025-12-02T03:20:19.000Z"
  },
  {
    "title": " How to stop internet results in Search for Windows 11 — get rid of Bing suggestions for a clean, simplified experience ",
    "q": " how to stop internet results in search for windows 11 — get rid of bing suggestions for a clean, simplified experience  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> How to stop internet results in Search for Windows 11 — get rid of Bing suggestions for a clean, simplified experience </b><br>On Windows 11, you can disable web search results in the Windows Search home page using the Registry and Group Policy, and in this guide, I'll show you how.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/how-to-stop-internet-results-in-search-for-windows-11\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/how-to-stop-internet-results-in-search-for-windows-11",
    "topic": "it",
    "date": "2025-12-02T12:14:00.000Z"
  },
  {
    "title": " Microsoft's advantages in artificial intelligence evaporate — Google Gemini surges ahead, and OpenAI declares \"code red\" situation ",
    "q": " microsoft's advantages in artificial intelligence evaporate — google gemini surges ahead, and openai declares \"code red\" situation  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft's advantages in artificial intelligence evaporate — Google Gemini surges ahead, and OpenAI declares \"code red\" situation </b><br>Microsoft's advantages in artificial intelligence look shaky as Google rapidly catches up. Google Gemini and Nano Banana image generation tools take the world by storm, as OpenAI declares \"code red.\"<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsofts-advantages-in-artificial-intelligence-evaporate-google-gemini-surges-ahead-and-openai-declares-code-red-situation\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsofts-advantages-in-artificial-intelligence-evaporate-google-gemini-surges-ahead-and-openai-declares-code-red-situation",
    "topic": "it",
    "date": "2025-12-02T10:05:52.000Z"
  },
  {
    "title": " Microsoft confirms Windows 11 KB5071142 issues: File Explorer white flash and invisible login icons ",
    "q": " microsoft confirms windows 11 kb5071142 issues: file explorer white flash and invisible login icons  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft confirms Windows 11 KB5071142 issues: File Explorer white flash and invisible login icons </b><br>Microsoft's latest December 2025 non-security preview update for Windows 11 comes with two confirmed known issues that will likely impact your time using your PC.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-confirms-windows-11-kb5071142-issues-file-explorer-white-flash-and-invisible-login-icons\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-confirms-windows-11-kb5071142-issues-file-explorer-white-flash-and-invisible-login-icons",
    "topic": "it",
    "date": "2025-12-02T09:26:35.000Z"
  },
  {
    "title": "Windows 11 KB5070311 update fixes File Explorer freezes, search issues",
    "q": "windows 11 kb5070311 update fixes file explorer freezes, search issues windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 KB5070311 update fixes File Explorer freezes, search issues</b><br>​​Microsoft has released the KB5070311 preview cumulative update for Windows 11 systems, which includes 49 changes, including fixes for File Explorer freezes and search issues. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5070311-update-fixes-file-explorer-freezes-search-issues/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5070311-update-fixes-file-explorer-freezes-search-issues/",
    "topic": "it",
    "date": "2025-12-02T11:19:31.000Z"
  },
  {
    "title": "Glassworm malware returns in third wave of malicious VS Code packages",
    "q": "glassworm malware returns in third wave of malicious vs code packages windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Glassworm malware returns in third wave of malicious VS Code packages</b><br>The Glassworm campaign, which first emerged on the OpenVSX and Microsoft Visual Studio marketplaces in October, is now in its third wave, with 24 new packages added on the two platforms. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/glassworm-malware-returns-in-third-wave-of-malicious-vs-code-packages/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/glassworm-malware-returns-in-third-wave-of-malicious-vs-code-packages/",
    "topic": "it",
    "date": "2025-12-01T21:08:15.000Z"
  },
  {
    "title": "SmartTube YouTube app for Android TV breached to push malicious update",
    "q": "smarttube youtube app for android tv breached to push malicious update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>SmartTube YouTube app for Android TV breached to push malicious update</b><br>The popular open-source SmartTube YouTube client for Android TV was compromised after an attacker gained access to the developer's signing keys, leading to a malicious update being pushed to users. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/smarttube-youtube-app-for-android-tv-breached-to-push-malicious-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/smarttube-youtube-app-for-android-tv-breached-to-push-malicious-update/",
    "topic": "it",
    "date": "2025-12-01T18:56:18.000Z"
  },
  {
    "title": "Microsoft says new Outlook can't open some Excel attachments",
    "q": "microsoft says new outlook can't open some excel attachments windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft says new Outlook can't open some Excel attachments</b><br>​Microsoft is working to resolve a known issue that prevents some users from opening Excel email attachments in the new Outlook client. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-says-new-outlook-cant-open-some-excel-attachments/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-new-outlook-cant-open-some-excel-attachments/",
    "topic": "it",
    "date": "2025-12-01T17:42:51.000Z"
  },
  {
    "title": "Tor Browser is revamping its release schedule",
    "q": "tor browser is revamping its release schedule windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Tor Browser is revamping its release schedule</b><br>Faster updates are coming to Tor Browser Alpha.<br><a href=\"https://www.howtogeek.com/tor-browser-is-revamping-its-release-schedule/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/tor-browser-is-revamping-its-release-schedule/",
    "topic": "it",
    "date": "2025-12-01T22:37:32.000Z"
  },
  {
    "title": "Sorry, the new Outlook app can't open some Excel attachments, says Microsoft",
    "q": "sorry, the new outlook app can't open some excel attachments, says microsoft windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Sorry, the new Outlook app can't open some Excel attachments, says Microsoft</b><br>There is a workaround, though.<br><a href=\"https://www.xda-developers.com/sorry-the-new-outlook-app-cant-open-some-excel-attachments-says-microsoft/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/sorry-the-new-outlook-app-cant-open-some-excel-attachments-says-microsoft/",
    "topic": "it",
    "date": "2025-12-02T06:50:48.000Z"
  },
  {
    "title": "Installing Arch Linux just got a whole lot less intimidating",
    "q": "installing arch linux just got a whole lot less intimidating windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Installing Arch Linux just got a whole lot less intimidating</b><br>Go on, give it a go.<br><a href=\"https://www.xda-developers.com/installing-arch-linux-just-got-a-whole-lot-less-intimidating/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/installing-arch-linux-just-got-a-whole-lot-less-intimidating/",
    "topic": "it",
    "date": "2025-12-02T05:52:22.000Z"
  }
]