[
  {
    "title": "Fast action / sports shutter",
    "q": "best shutter for sports freeze motion football basketball",
    "a": "Use 1/1000s as a safe starting point (1/2000s for very fast plays). Shoot Shutter Priority, Auto ISO, continuous AF (AI‑Servo/AF‑C)."
  },
  {
    "title": "Portrait lighting basics",
    "q": "portrait lighting soft light window reflector 45 degrees rembrandt",
    "a": "Place a soft light 45° to the subject and slightly above eyes. Use a reflector to fill. Aim f/2–f/4 and ~1/125s; raise ISO before dropping shutter."
  },
  {
    "title": "Golden hour tip",
    "q": "golden hour best time outdoor photos color temperature warm",
    "a": "Golden hour = first hour after sunrise, last hour before sunset. White balance 5200–6000K for natural look; lower for warmer vibes."
  },
  {
    "title": "Windows high CPU",
    "q": "windows high cpu usage fix task manager background apps startup",
    "a": "Ctrl+Shift+Esc → sort by CPU. Disable heavy startup apps: Settings → Apps → Startup. Update drivers & Windows; scan for malware; Balanced power plan."
  },
  {
    "title": "Linux disk space",
    "q": "linux check disk usage which folders big du df clean apt",
    "a": "Run: <code>sudo du -h --max-depth=1 / | sort -hr | head</code>. Quick overview: <code>df -h</code>. Clean caches: <code>sudo apt autoremove && sudo apt clean</code>."
  },
  {
    "title": "Exposure triangle",
    "q": "aperture shutter iso triangle explain",
    "a": "Aperture controls depth, shutter controls motion, ISO adds brightness/noise. For sharp portraits in low light: f/2–f/2.8, 1/125s, Auto ISO."
  }
  ,
  {
    "title": "Camera Settings for Portraits",
    "q": "best camera settings for portraits, portrait photos, blurry background, aperture for portraits",
    "a": "For portraits, use a wide aperture (like f/1.8–f/2.8) to blur the background. Keep ISO low for sharpness, and use natural light when possible."
  },
  {
    "title": "Difference Between SSD and HDD",
    "q": "ssd vs hdd, difference between ssd and hdd, faster storage drive",
    "a": "SSD drives are much faster and more reliable than HDDs since they use flash memory instead of spinning disks. HDDs are cheaper but slower and noisier."
  },
  {
    "title": "Lighting Tips for Indoor Photography",
    "q": "indoor lighting tips, photo lighting, how to take good photos inside",
    "a": "Use soft, diffused light — bounce your flash off the ceiling or use a ring light. Avoid harsh direct lighting to reduce shadows."
  },
  {
    "title": "Fix Wi-Fi Not Working on PC",
    "q": "wifi not working windows, fix wifi connection, laptop no internet",
    "a": "Try restarting your network adapter: open Command Prompt and run `netsh winsock reset`, then restart your PC. Also ensure airplane mode is off."
  },
{
  "title": "Greeting",
  "q": "hi, hello, hey, good morning, good evening, what's up, how are you, greetings",
  "a": "Hey there 👋 I'm H3samBot — your Photo & Tech assistant! I can help you with photography tips, camera settings, IT tricks, or even tech troubleshooting. What would you like to learn today?"
},


]
