[
  {
    "title": "This New Astrophotography Camera Has a 44MP Full-Frame Sensor",
    "q": "this new astrophotography camera has a 44mp full-frame sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This New Astrophotography Camera Has a 44MP Full-Frame Sensor</b><br>ZWO has announced a new 44-megapixel full-frame camera designed specifically for astrophotography, and its specs are impressive. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/",
    "topic": "photo",
    "date": "2025-11-28T22:03:46.000Z"
  },
  {
    "title": "The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’",
    "q": "the five most shocking claims made by netflix’s ‘the stringer’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’</b><br>Finally the day has come: The Stringer: The Man Who Took the Photo, a film about who really took the famous Napalm Girl photo during the Vietnam War, has dropped on Netflix meaning anyone with a subscription can now see what the fuss is al…<br><a href=\"https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/",
    "topic": "photo",
    "date": "2025-11-28T22:00:20.000Z"
  },
  {
    "title": "Sony Releases Major Firmware Updates for a7R V and a7 IV",
    "q": "sony releases major firmware updates for a7r v and a7 iv camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony Releases Major Firmware Updates for a7R V and a7 IV</b><br>Sony has issued significant new firmware updates for two of its most widely used full-frame mirrorless cameras, bringing the a7R V to Version 4.00 and the a7 IV to Version 6.00. The updates expand focus control options, add new video workf…<br><a href=\"https://petapixel.com/2025/11/28/sony-releases-major-firmware-updates-for-a7r-v-and-a7-iv/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/sony-releases-major-firmware-updates-for-a7r-v-and-a7-iv/",
    "topic": "photo",
    "date": "2025-11-28T19:03:25.000Z"
  },
  {
    "title": "This Free Calculator Figures Out Your Anamorphic Aspect Ratios",
    "q": "this free calculator figures out your anamorphic aspect ratios camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Free Calculator Figures Out Your Anamorphic Aspect Ratios</b><br>Anamorphic lenses are a regular part of many cinematographers' kits, especially as new anamorphic lenses become more affordable and more cameras include more video recording features that help anamorphic optics shine. However, it can be ch…<br><a href=\"https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/",
    "topic": "photo",
    "date": "2025-11-28T18:22:43.000Z"
  },
  {
    "title": "The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now",
    "q": "the 10 best deals on full-frame mirrorless cameras right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now</b><br>We already have a deep-dive article about all the best deals on cameras for Black Friday and Cyber Monday, but some of the deals are so good that they warrant a bit more attention. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/",
    "topic": "photo",
    "date": "2025-11-28T17:31:02.000Z"
  },
  {
    "title": "Excire’s Incredible AI Photo-Management Tools Are 30% Off Through December 7th",
    "q": "excire’s incredible ai photo-management tools are 30% off through december 7th camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Excire’s Incredible AI Photo-Management Tools Are 30% Off Through December 7th</b><br>Excire’s AI-powered photo-management software has developed a devoted following among photographers who want faster culling, smarter search tools, and a well-organized image library—and this Black Friday, the company is offering a rare cha…<br><a href=\"https://petapixel.com/2025/11/28/excires-incredible-ai-photo-management-tools-are-30-off-through-december-7th/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/excires-incredible-ai-photo-management-tools-are-30-off-through-december-7th/",
    "topic": "photo",
    "date": "2025-11-28T16:06:11.000Z"
  },
  {
    "title": "The Best Deals on Lenses for Mirrorless and DSLR Cameras",
    "q": "the best deals on lenses for mirrorless and dslr cameras camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Best Deals on Lenses for Mirrorless and DSLR Cameras</b><br>Holiday savings are here at B&H, with huge deals on top prime and zoom lenses from all the major brands. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/the-best-deals-on-lenses-for-mirrorless-and-dslr-cameras/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-best-deals-on-lenses-for-mirrorless-and-dslr-cameras/",
    "topic": "photo",
    "date": "2025-11-28T14:52:10.000Z"
  },
  {
    "title": "‘Adolescence’ Cinematographer Signals Plans for Another One-Take Series",
    "q": "‘adolescence’ cinematographer signals plans for another one-take series camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘Adolescence’ Cinematographer Signals Plans for Another One-Take Series</b><br>The cinematographer and camera operator behind the hit Netflix drama Adolescence revealed their plans to film another one-take series. [Read More]<br><a href=\"https://petapixel.com/2025/11/27/netflix-adolescence-cinematographer-reveals-plans-for-another-one-shot-series/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/27/netflix-adolescence-cinematographer-reveals-plans-for-another-one-shot-series/",
    "topic": "photo",
    "date": "2025-11-27T17:17:18.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": "2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation",
    "q": "2025 royal photographic society awards reveal groundbreaking winners in art, science and innovation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation</b><br>Photos from left to right: Omar Victor Diop, Susan Derges HonFRPS and Jaskirt Dhaliwal-Boora The Royal Photographic Society has announced the recipients of its 2025 Awards. The contest highlights significant contributions across both the a…<br><a href=\"https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation",
    "topic": "photo",
    "date": "2025-11-24T15:55:00.000Z"
  },
  {
    "title": "The answers you missed: What our staff revealed in the DPReview AMA",
    "q": "the answers you missed: what our staff revealed in the dpreview ama camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The answers you missed: What our staff revealed in the DPReview AMA</b><br>Last week, the DPReview Editorial team hosted its first Ask Me Anything (AMA) event in the new forums. These AMA sessions are a great way to engage directly with our staff and pose those burning questions you've always wanted to ask. We ad…<br><a href=\"https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama",
    "topic": "photo",
    "date": "2025-11-23T15:00:00.000Z"
  },
  {
    "title": " Trendy cameras rarely go on sale. But the DJI Osmo Pocket 3 is the definition of trendy, and it just dropped by $270 ",
    "q": " trendy cameras rarely go on sale. but the dji osmo pocket 3 is the definition of trendy, and it just dropped by $270  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Trendy cameras rarely go on sale. But the DJI Osmo Pocket 3 is the definition of trendy, and it just dropped by $270 </b><br>The DJI Osmo Pocket 3 is at its lowest price in months, with a $270 discount on the popular video camera for Black Friday<br><a href=\"https://www.digitalcameraworld.com/cameras/video-cameras/trendy-cameras-rarely-go-on-sale-but-the-dji-osmo-pocket-3-is-the-definition-of-trendy-and-it-just-dropped-by-usd270\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/video-cameras/trendy-cameras-rarely-go-on-sale-but-the-dji-osmo-pocket-3-is-the-definition-of-trendy-and-it-just-dropped-by-usd270",
    "topic": "photo",
    "date": "2025-11-29T11:10:25.000Z"
  },
  {
    "title": " Save 40% on Photography & Video Show tickets – for Black Friday weekend only! ",
    "q": " save 40% on photography & video show tickets – for black friday weekend only!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Save 40% on Photography & Video Show tickets – for Black Friday weekend only! </b><br>The UK's biggest and best show on all things photography and videography is just around the corner – and you can save a packet on the entry price with this deal<br><a href=\"https://www.digitalcameraworld.com/photography/trade-shows/save-40-percent-on-photography-and-video-show-tickets-for-black-friday-weekend-only\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/trade-shows/save-40-percent-on-photography-and-video-show-tickets-for-black-friday-weekend-only",
    "topic": "photo",
    "date": "2025-11-29T10:30:00.000Z"
  },
  {
    "title": " Street Photography: A History in 100 Iconic Photographs by David Gibson review  ",
    "q": " street photography: a history in 100 iconic photographs by david gibson review   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Street Photography: A History in 100 Iconic Photographs by David Gibson review  </b><br>An inspiring overview of the evolution of street photography, David Gibson’s book is both a visual history and a practical prompt for photographers looking to deepen their craft.<br><a href=\"https://www.digitalcameraworld.com/photography/books/street-photography-a-history-in-100-iconic-photographs-by-david-gibson-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/books/street-photography-a-history-in-100-iconic-photographs-by-david-gibson-review",
    "topic": "photo",
    "date": "2025-11-29T10:00:00.000Z"
  },
  {
    "title": " I hate traveling with heavy camera gear. This is my favorite compact camera for travel (and it is now at lowest price ever) ",
    "q": " i hate traveling with heavy camera gear. this is my favorite compact camera for travel (and it is now at lowest price ever)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I hate traveling with heavy camera gear. This is my favorite compact camera for travel (and it is now at lowest price ever) </b><br>The OM System Tough TG-7 is my go-to compact for travel – if I didn't already have it, I'd be snapping up this deal<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/i-hate-traveling-with-heavy-camera-gear-this-is-my-favorite-compact-camera-for-travel-and-it-is-now-at-lowest-price-ever\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/i-hate-traveling-with-heavy-camera-gear-this-is-my-favorite-compact-camera-for-travel-and-it-is-now-at-lowest-price-ever",
    "topic": "photo",
    "date": "2025-11-29T09:18:06.000Z"
  },
  {
    "title": " Using Canon's 800mm f/11 supertele lens is out of this world…but I've found limitations that bring me back to Earth ",
    "q": " using canon's 800mm f/11 supertele lens is out of this world…but i've found limitations that bring me back to earth  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Using Canon's 800mm f/11 supertele lens is out of this world…but I've found limitations that bring me back to Earth </b><br>Canon’s RF 800mm f/11 mega-telephoto lens is a unique proposition – but as I discovered, it’s not without limitations<br><a href=\"https://www.digitalcameraworld.com/features/using-canons-800mm-f11-supertele-lens-is-out-of-this-world-but-ive-found-limitations-that-bring-me-back-to-earth\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/features/using-canons-800mm-f11-supertele-lens-is-out-of-this-world-but-ive-found-limitations-that-bring-me-back-to-earth",
    "topic": "photo",
    "date": "2025-11-29T07:18:00.000Z"
  },
  {
    "title": " Do you wish your mirrorless was as small as a compact camera? With this super-slim pancake lens, it can fit in your pocket! ",
    "q": " do you wish your mirrorless was as small as a compact camera? with this super-slim pancake lens, it can fit in your pocket!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Do you wish your mirrorless was as small as a compact camera? With this super-slim pancake lens, it can fit in your pocket! </b><br>This $47 pancake lens made my mirrorless camera the same size as my compact –now it easily slips in my pocket<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/do-you-wish-your-mirrorless-was-as-small-as-a-compact-camera-with-this-super-slim-pancake-lens-it-can-fit-in-your-pocket\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/do-you-wish-your-mirrorless-was-as-small-as-a-compact-camera-with-this-super-slim-pancake-lens-it-can-fit-in-your-pocket",
    "topic": "photo",
    "date": "2025-11-29T01:59:33.000Z"
  },
  {
    "title": " Unheard-of discount as Hasselblad X2D 100C bundle is now $7,369 in the Black Friday Sale ",
    "q": " unheard-of discount as hasselblad x2d 100c bundle is now $7,369 in the black friday sale  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Unheard-of discount as Hasselblad X2D 100C bundle is now $7,369 in the Black Friday Sale </b><br>A Rare Hasselblad Price Cut: Save $1,730 on the X2D 100C + 75mm Lens<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/unheard-of-discount-as-hasselblad-x2d-100c-bundle-is-now-usd7-369-in-the-black-friday-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/unheard-of-discount-as-hasselblad-x2d-100c-bundle-is-now-usd7-369-in-the-black-friday-sale",
    "topic": "photo",
    "date": "2025-11-28T20:36:54.000Z"
  },
  {
    "title": " As this legendary DSLR hits amazingly low price – I can't help but feel this might be my last chance to grab the Canon EOS 5D Mark IV  ",
    "q": " as this legendary dslr hits amazingly low price – i can't help but feel this might be my last chance to grab the canon eos 5d mark iv   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> As this legendary DSLR hits amazingly low price – I can't help but feel this might be my last chance to grab the Canon EOS 5D Mark IV  </b><br>I've hardly seen the Canon EOS 5D Mark IV this cheap from a trusted retailer: just $1,799– save $700 on a full-frame DSLR powerhouse that still does it all<br><a href=\"https://www.digitalcameraworld.com/cameras/dslr-cameras/as-this-legendary-dslr-hits-amazingly-low-price-i-cant-help-but-feel-this-might-be-my-last-chance-to-grab-the-canon-eos-5d-mark-iv\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/dslr-cameras/as-this-legendary-dslr-hits-amazingly-low-price-i-cant-help-but-feel-this-might-be-my-last-chance-to-grab-the-canon-eos-5d-mark-iv",
    "topic": "photo",
    "date": "2025-11-28T20:04:00.000Z"
  },
  {
    "title": " Under $10 photo accessories that aren’t garbage don’t exist…actually, never mind, these deals are fantastic ",
    "q": " under $10 photo accessories that aren’t garbage don’t exist…actually, never mind, these deals are fantastic  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Under $10 photo accessories that aren’t garbage don’t exist…actually, never mind, these deals are fantastic </b><br>I set out on a mission to find photo accessories under $10 that aren't total garbage, and I found a surprising number of deals<br><a href=\"https://www.digitalcameraworld.com/cameras/camera-accessories/under-usd10-photo-accessories-that-arent-garbage-dont-exist-actually-never-mind-these-deals-are-fantastic\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/camera-accessories/under-usd10-photo-accessories-that-arent-garbage-dont-exist-actually-never-mind-these-deals-are-fantastic",
    "topic": "photo",
    "date": "2025-11-28T19:55:10.000Z"
  },
  {
    "title": " Every driver should have a dash cam and mine is now at its lowest-ever price! ",
    "q": " every driver should have a dash cam and mine is now at its lowest-ever price!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Every driver should have a dash cam and mine is now at its lowest-ever price! </b><br>I can personally vouch for the quality and reliability of this dash cam - if you're going to buy a dashboard camera this Black Friday, this should be it<br><a href=\"https://www.digitalcameraworld.com/cameras/dash-cams/every-driver-should-have-a-dash-cam-and-mine-is-now-at-its-lowest-ever-price\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/dash-cams/every-driver-should-have-a-dash-cam-and-mine-is-now-at-its-lowest-ever-price",
    "topic": "photo",
    "date": "2025-11-28T19:31:36.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Best Memory Cards for Photographers",
    "q": "best memory cards for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Cards for Photographers</b><br>People tend to focus more on cameras and lenses when discussing camera gear. Those are exciting, fun purchases! However, once a new photographer find themselves out taking photos, the next piece of gear takes center stage, and becomes infi…<br><a href=\"https://www.slrlounge.com/best-memory-cards-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-cards-for-photographers/",
    "topic": "photo",
    "date": "2025-11-26T23:41:26.000Z"
  },
  {
    "title": "TourBox Elite Plus Review | A Versatile New Creative Controller",
    "q": "tourbox elite plus review | a versatile new creative controller camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>TourBox Elite Plus Review | A Versatile New Creative Controller</b><br>Over the last few years, we’ve seen an explosion of various innovations that streamline creative workflows. From photographers and illustrators to video editors and animators, everyone is looking for this combination: speed and precision. …<br><a href=\"https://www.slrlounge.com/tourbox-elite-plus-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tourbox-elite-plus-review/",
    "topic": "photo",
    "date": "2025-11-26T16:00:00.000Z"
  },
  {
    "title": "DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools",
    "q": "dxo’s black friday deals take up to 50% off flagship photo editing tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools</b><br>DxO is rolling out its annual Black Friday sale with significant discounts across its full software lineup, offering up to 50% off both new licenses and upgrades. The promotion runs from November 18 through December 2, 2025. The sale spans…<br><a href=\"https://www.slrlounge.com/dxo-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-26T13:00:26.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "The 194 best Black Friday deals you can still shop — a ton of tech is over half off",
    "q": "the 194 best black friday deals you can still shop — a ton of tech is over half off windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The 194 best Black Friday deals you can still shop — a ton of tech is over half off</b><br>Now that the Thanksgiving dishes are put away and the last slice of pie is hidden in the back of the fridge, it’s time to turn your attention to the next major holiday: Black Friday. The biggest shopping day of the year has started, and as…<br><a href=\"https://www.theverge.com/gadgets/824521/black-friday-2025-best-deals-tech-gadgets-gift-ideas\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/824521/black-friday-2025-best-deals-tech-gadgets-gift-ideas",
    "topic": "it",
    "date": "2025-11-29T07:25:42.000Z"
  },
  {
    "title": "The best Black Friday deals you can still get on AirTags, iPad, and other Apple gear",
    "q": "the best black friday deals you can still get on airtags, ipad, and other apple gear windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Black Friday deals you can still get on AirTags, iPad, and other Apple gear</b><br>Apple’s latest AirPods Pro are down to their best price to date. If you’re planning to gift an Apple device this holiday season — or treat yourself — now’s the time to start shopping. Black Friday has officially arrived, bringing with it t…<br><a href=\"https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025",
    "topic": "it",
    "date": "2025-11-29T06:59:12.000Z"
  },
  {
    "title": "Philips Hue’s Festavia string lights are nearly $60 off (and still available) for Black Friday",
    "q": "philips hue’s festavia string lights are nearly $60 off (and still available) for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Philips Hue’s Festavia string lights are nearly $60 off (and still available) for Black Friday</b><br>If you want your house to be the one everyone slows down to look at this holiday season, Philips Hue’s Festavia lights can make that happen. They aren’t cheap, but thanks to an ongoing Black Friday sale at Amazon, you can still grab a 65-f…<br><a href=\"https://www.theverge.com/gadgets/826881/philips-hue-festavia-govee-christmas-lights-black-friday-deal-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/826881/philips-hue-festavia-govee-christmas-lights-black-friday-deal-2025",
    "topic": "it",
    "date": "2025-11-29T06:32:56.000Z"
  },
  {
    "title": "The Verge’s guide to Black Friday 2025",
    "q": "the verge’s guide to black friday 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Verge’s guide to Black Friday 2025</b><br>Now that we’ve already gathered with friends and family to dine on our favorite foods, the real feast has begun. I’m talking, of course, about Black Friday and the full weekend of shopping that leads into Cyber Monday on December 1st. Many…<br><a href=\"https://www.theverge.com/tech/808624/black-friday-cyber-monday-guide-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/808624/black-friday-cyber-monday-guide-2025",
    "topic": "it",
    "date": "2025-11-29T05:30:59.000Z"
  },
  {
    "title": "The M4 MacBook Air is one of the best Apple deals you can get for Black Friday",
    "q": "the m4 macbook air is one of the best apple deals you can get for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The M4 MacBook Air is one of the best Apple deals you can get for Black Friday</b><br>Black Friday is packed with plenty of great Apple deals, but one of the most notable is the current discount on the latest MacBook Air. Right now, you can buy the 13-inch MacBook Air M4 with 256GB of storage at Amazon, Best Buy, and Costco…<br><a href=\"https://www.theverge.com/gadgets/832969/black-friday-macbook-air-m4-13-15-inch-deal-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/832969/black-friday-macbook-air-m4-13-15-inch-deal-sale-2025",
    "topic": "it",
    "date": "2025-11-29T04:35:39.000Z"
  },
  {
    "title": "These 50 handpicked Black Friday deals are still available for $50 or less",
    "q": "these 50 handpicked black friday deals are still available for $50 or less windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These 50 handpicked Black Friday deals are still available for $50 or less</b><br>If you’re traveling for the holidays, Twelve South’s AirFly Pro 2 adapter is a great buy for just $41.99. | Image: Twelve South Black Friday is a great time to save on big-ticket items like 4K TVs, laptops, and headphones. But if you’re on…<br><a href=\"https://www.theverge.com/gadgets/829553/black-friday-best-cheap-tech-deals-under-50-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/829553/black-friday-best-cheap-tech-deals-under-50-2025",
    "topic": "it",
    "date": "2025-11-29T04:18:20.000Z"
  },
  {
    "title": "You can pick up 32GB of DDR5 RAM with a whole PC for $999 for Black Friday",
    "q": "you can pick up 32gb of ddr5 ram with a whole pc for $999 for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>You can pick up 32GB of DDR5 RAM with a whole PC for $999 for Black Friday</b><br>It’s nowhere close to the fastest pre-built, but it’s a good deal during a time when components aren’t as cheap as they usually are. | Image: iBuyPower If you were hoping for a huge deal on RAM during Black Friday, well, stop being silly. …<br><a href=\"https://www.theverge.com/gadgets/830678/black-friday-ibuypower-gaming-pc-5060ti-prebuilt-ddr5-ram-deal-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/830678/black-friday-ibuypower-gaming-pc-5060ti-prebuilt-ddr5-ram-deal-sale-2025",
    "topic": "it",
    "date": "2025-11-29T02:30:00.000Z"
  },
  {
    "title": "These laptops are still steeply discounted for Black Friday — many are over $400 off",
    "q": "these laptops are still steeply discounted for black friday — many are over $400 off windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These laptops are still steeply discounted for Black Friday — many are over $400 off</b><br>Several great models are on sale right now, including the entry-level Surface Laptop. Aside from TVs, Black Friday is the best opportunity to save on one of the biggest tech purchases we’re all likely to make: a new laptop. A new generatio…<br><a href=\"https://www.theverge.com/gadgets/828617/best-black-friday-laptop-deals-macbook-surface-gaming-notebooks-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/828617/best-black-friday-laptop-deals-macbook-surface-gaming-notebooks-2025",
    "topic": "it",
    "date": "2025-11-29T02:08:31.000Z"
  },
  {
    "title": " The new AirDrop feature on the Google Pixel 10 is proving buggy for some users ",
    "q": " the new airdrop feature on the google pixel 10 is proving buggy for some users  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The new AirDrop feature on the Google Pixel 10 is proving buggy for some users </b><br>Android and AirDrop have only been connected for a little over a week, and we're already seeing issues.<br><a href=\"https://www.techradar.com/phones/google-pixel-phones/the-new-airdrop-feature-on-the-google-pixel-10-is-proving-buggy-for-some-users\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/phones/google-pixel-phones/the-new-airdrop-feature-on-the-google-pixel-10-is-proving-buggy-for-some-users",
    "topic": "it",
    "date": "2025-11-29T12:30:00.000Z"
  },
  {
    "title": " “There's no such as 100% - we just try and raise the bar” - we hear what it takes to help secure the world’s largest PC maker from the man in charge of Lenovo’s AI and security ",
    "q": " “there's no such as 100% - we just try and raise the bar” - we hear what it takes to help secure the world’s largest pc maker from the man in charge of lenovo’s ai and security  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> “There's no such as 100% - we just try and raise the bar” - we hear what it takes to help secure the world’s largest PC maker from the man in charge of Lenovo’s AI and security </b><br>How do you go about helping secure the world’s largest PC maker? We speak to Lenovo Chief Security and AI Officer Doug Fisher to find out.<br><a href=\"https://www.techradar.com/pro/security/theres-no-such-as-100-percent-we-just-try-and-raise-the-bar-we-hear-what-it-takes-to-help-secure-the-worlds-largest-pc-maker-from-the-man-in-charge-of-lenovos-ai-and-security\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/theres-no-such-as-100-percent-we-just-try-and-raise-the-bar-we-hear-what-it-takes-to-help-secure-the-worlds-largest-pc-maker-from-the-man-in-charge-of-lenovos-ai-and-security",
    "topic": "it",
    "date": "2025-11-29T11:28:00.000Z"
  },
  {
    "title": " Pong debuted on this day in 1972 — Atari's pioneering CPU-less video arcade game’s creation was the result of an engineer training exercise ",
    "q": " pong debuted on this day in 1972 — atari's pioneering cpu-less video arcade game’s creation was the result of an engineer training exercise  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Pong debuted on this day in 1972 — Atari's pioneering CPU-less video arcade game’s creation was the result of an engineer training exercise </b><br>The Atari Pong arcade machine made its debut on this day in 1972.<br><a href=\"https://www.tomshardware.com/video-games/retro-gaming/pong-debuted-on-this-day-in-1972-ataris-pioneering-cpu-less-video-arcade-games-creation-was-the-result-of-an-engineer-training-exercise\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/retro-gaming/pong-debuted-on-this-day-in-1972-ataris-pioneering-cpu-less-video-arcade-games-creation-was-the-result-of-an-engineer-training-exercise",
    "topic": "it",
    "date": "2025-11-29T11:00:00.000Z"
  },
  {
    "title": "I found the best Black Friday iPad deals 2025: Shop Apple discounts up to 25%",
    "q": "i found the best black friday ipad deals 2025: shop apple discounts up to 25% windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Black Friday iPad deals 2025: Shop Apple discounts up to 25%</b><br>Don't miss a chance to score Black Friday iPad deals in real time, so you can find the best price on an iPad, iPad Air, iPad Pro, and more.<br><a href=\"https://www.zdnet.com/article/black-friday-ipad-deals-amazon-walmart-best-buy-11-28/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-ipad-deals-amazon-walmart-best-buy-11-28/",
    "topic": "it",
    "date": "2025-11-29T12:23:00.000Z"
  },
  {
    "title": "Live updates: We found the 100+ best Black Friday deals up to 75% off from Amazon, Walmart, Target & more",
    "q": "live updates: we found the 100+ best black friday deals up to 75% off from amazon, walmart, target & more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Live updates: We found the 100+ best Black Friday deals up to 75% off from Amazon, Walmart, Target & more</b><br>Black Friday sales have arrived, and nearly every major retailer is offering big discounts on items from LG, Apple, Garmin, Samsung, and far more.<br><a href=\"https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-28/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-28/",
    "topic": "it",
    "date": "2025-11-29T12:06:00.000Z"
  },
  {
    "title": "Best Black Friday laptop deals 2025: Grab 26 sales on MacBooks, Lenovo, HP, more before they disappear",
    "q": "best black friday laptop deals 2025: grab 26 sales on macbooks, lenovo, hp, more before they disappear windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Best Black Friday laptop deals 2025: Grab 26 sales on MacBooks, Lenovo, HP, more before they disappear</b><br>I'm tracking 26 of the best Black Friday deals on laptops I've seen that are still live tonight, including the new MacBook Air M4 for 25% off.<br><a href=\"https://www.zdnet.com/article/black-friday-laptop-deals-amazon-best-buy-walmart-11-28/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-laptop-deals-amazon-best-buy-walmart-11-28/",
    "topic": "it",
    "date": "2025-11-29T03:41:06.000Z"
  },
  {
    "title": " ID@Xbox chief Chris Charla talks to us about Microsoft's indie game dev program — \"We don't want bringing games to Xbox to be a lengthy, painful process.\" ",
    "q": " id@xbox chief chris charla talks to us about microsoft's indie game dev program — \"we don't want bringing games to xbox to be a lengthy, painful process.\"  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> ID@Xbox chief Chris Charla talks to us about Microsoft's indie game dev program — \"We don't want bringing games to Xbox to be a lengthy, painful process.\" </b><br>We spoke to ID@Xbox chief Chris Charla to learn about the future of Microsoft's indie publishing label, and where it sits in a Steam-dominated world.<br><a href=\"https://www.windowscentral.com/gaming/xbox/id-xbox-chief-chris-charla-talks-to-us-about-microsofts-indie-game-dev-program-we-dont-want-bringing-games-to-xbox-to-be-a-lengthy-painful-process\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/id-xbox-chief-chris-charla-talks-to-us-about-microsofts-indie-game-dev-program-we-dont-want-bringing-games-to-xbox-to-be-a-lengthy-painful-process",
    "topic": "it",
    "date": "2025-11-29T11:55:36.000Z"
  },
  {
    "title": " You can now grab your very own 27-inch 5K monitor for just $535 this Black Friday weekend — text and images have never looked so good ",
    "q": " you can now grab your very own 27-inch 5k monitor for just $535 this black friday weekend — text and images have never looked so good  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> You can now grab your very own 27-inch 5K monitor for just $535 this Black Friday weekend — text and images have never looked so good </b><br>The KTC 27 5K monitor gives Apple's $1,400 Studio Display a run for its money, with the same pixels and screen size but at a much more affordable price.<br><a href=\"https://www.windowscentral.com/accessories/monitors/you-can-now-grab-your-very-own-27-inch-5k-monitor-for-just-usd535-this-black-friday-weekend-text-and-images-have-never-looked-so-good\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/accessories/monitors/you-can-now-grab-your-very-own-27-inch-5k-monitor-for-just-usd535-this-black-friday-weekend-text-and-images-have-never-looked-so-good",
    "topic": "it",
    "date": "2025-11-29T11:20:29.000Z"
  },
  {
    "title": " Analysis: OpenAI is a loss-making machine, with estimates that it has no road to profitability by 2030 — and will need a further $207 billion in funding even if it gets there ",
    "q": " analysis: openai is a loss-making machine, with estimates that it has no road to profitability by 2030 — and will need a further $207 billion in funding even if it gets there  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Analysis: OpenAI is a loss-making machine, with estimates that it has no road to profitability by 2030 — and will need a further $207 billion in funding even if it gets there </b><br>A recent analysis by major bank HSBC suggests that OpenAI's future revolves around debt accumulation, as companies increasingly turn to speculation to fuel the AI company's compute hunger.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/openai-chatgpt/analysis-openai-is-a-loss-making-machine\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/openai-chatgpt/analysis-openai-is-a-loss-making-machine",
    "topic": "it",
    "date": "2025-11-29T09:17:42.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "Public GitLab repositories exposed more than 17,000 secrets",
    "q": "public gitlab repositories exposed more than 17,000 secrets windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Public GitLab repositories exposed more than 17,000 secrets</b><br>After scanning all 5.6 million public repositories on GitLab Cloud, a security engineer discovered more than 17,000 exposed secrets across over 2,800 unique domains. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/",
    "topic": "it",
    "date": "2025-11-28T17:43:02.000Z"
  },
  {
    "title": "NordVPN Black Friday Deal: Unlock 77% off VPN plans in 2025",
    "q": "nordvpn black friday deal: unlock 77% off vpn plans in 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>NordVPN Black Friday Deal: Unlock 77% off VPN plans in 2025</b><br>The NordVPN Black Friday Deal is now live, and you can get the best discount available: 77% off that applies automatically when you follow our link. If you've been waiting for the right moment to upgrade your online security, privacy, and …<br><a href=\"https://www.bleepingcomputer.com/news/security/nordvpn-black-friday-deal-unlock-77-percent-off-vpn-plans-in-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/nordvpn-black-friday-deal-unlock-77-percent-off-vpn-plans-in-2025/",
    "topic": "it",
    "date": "2025-11-26T20:00:37.000Z"
  },
  {
    "title": "I made my Mac more secure by changing these 5 settings",
    "q": "i made my mac more secure by changing these 5 settings windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I made my Mac more secure by changing these 5 settings</b><br>It's easy too.<br><a href=\"https://www.howtogeek.com/i-made-my-mac-more-secure-by-changing-these-5-settings/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/i-made-my-mac-more-secure-by-changing-these-5-settings/",
    "topic": "it",
    "date": "2025-11-28T22:00:14.000Z"
  },
  {
    "title": "Valve's Steam Machine has a Half-Life 3 clue that everyone else missed",
    "q": "valve's steam machine has a half-life 3 clue that everyone else missed windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Valve's Steam Machine has a Half-Life 3 clue that everyone else missed</b><br>The codename of the Steam Machine could potentially be a Half-Life 3 tease<br><a href=\"https://www.xda-developers.com/steam-machine-hint-half-life-3/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/steam-machine-hint-half-life-3/",
    "topic": "it",
    "date": "2025-11-29T12:30:18.000Z"
  },
  {
    "title": "This stunning Raspberry Pi project combines a retro console and a chiptune synth in one",
    "q": "this stunning raspberry pi project combines a retro console and a chiptune synth in one windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This stunning Raspberry Pi project combines a retro console and a chiptune synth in one</b><br>Why make two retro machines when you can make one that does both jobs?<br><a href=\"https://www.xda-developers.com/this-stunning-raspberry-pi-project-combines-retro-console-chiptune-synth/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/this-stunning-raspberry-pi-project-combines-retro-console-chiptune-synth/",
    "topic": "it",
    "date": "2025-11-29T05:01:30.000Z"
  }
]