[
  {
    "title": "ProGrade Digital Is Going to the Moon With NASA",
    "q": "prograde digital is going to the moon with nasa camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>ProGrade Digital Is Going to the Moon With NASA</b><br>ProGrade Digital, maker of memory cards, storage, and workflow solutions for photographers and other creatives, has entered into a Space Act agreement with the National Aeronautics and Space Administration (NASA) to support the agency's Ar…<br><a href=\"https://petapixel.com/2026/01/20/prograde-digital-is-going-to-the-moon-with-nasa/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/20/prograde-digital-is-going-to-the-moon-with-nasa/",
    "topic": "photo",
    "date": "2026-01-20T18:00:51.000Z"
  },
  {
    "title": "This Adorable Japanese Photographer Hands Out Disposable Cameras to Total Strangers",
    "q": "this adorable japanese photographer hands out disposable cameras to total strangers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Adorable Japanese Photographer Hands Out Disposable Cameras to Total Strangers</b><br>A photographer in Japan has found viral success by handing out disposable cameras to strangers and making videos out of the photos they take. [Read More]<br><a href=\"https://petapixel.com/2026/01/20/this-adorable-japanese-photographer-hands-out-disposable-cameras-to-total-strangers/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/20/this-adorable-japanese-photographer-hands-out-disposable-cameras-to-total-strangers/",
    "topic": "photo",
    "date": "2026-01-20T17:17:50.000Z"
  },
  {
    "title": "Brides Say Photographer Collected Over $160K,  Failed to Deliver Images",
    "q": "brides say photographer collected over $160k,  failed to deliver images camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Brides Say Photographer Collected Over $160K,  Failed to Deliver Images</b><br>More than 50 brides say they paid thousands of dollars to a local wedding photographer who they claim failed to deliver photos or stopped communicating with them. [Read More]<br><a href=\"https://petapixel.com/2026/01/20/brides-say-photographer-collected-over-160k-failed-to-deliver-images/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/20/brides-say-photographer-collected-over-160k-failed-to-deliver-images/",
    "topic": "photo",
    "date": "2026-01-20T15:43:51.000Z"
  },
  {
    "title": "Sally Mann Says ‘Film is So Expensive’ and Has Started Shooting Digital",
    "q": "sally mann says ‘film is so expensive’ and has started shooting digital camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sally Mann Says ‘Film is So Expensive’ and Has Started Shooting Digital</b><br>While film has experienced a renaissance in recent years -- largely driven by younger photographers who appreciate its retro charm -- it is an expensive endeavor. [Read More]<br><a href=\"https://petapixel.com/2026/01/20/sally-mann-says-film-is-so-expensive-and-has-started-shooting-digital/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/20/sally-mann-says-film-is-so-expensive-and-has-started-shooting-digital/",
    "topic": "photo",
    "date": "2026-01-20T14:35:43.000Z"
  },
  {
    "title": "The Fujifilm GFX Eterna 55 Is Now IMAX-Certified",
    "q": "the fujifilm gfx eterna 55 is now imax-certified camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Fujifilm GFX Eterna 55 Is Now IMAX-Certified</b><br>The Fujifilm GFX Eterna 55, Fujifilm's first digital camera built explicitly for professional filmmaking, is now IMAX-certified. [Read More]<br><a href=\"https://petapixel.com/2026/01/20/the-fujifilm-gfx-eterna-55-is-now-imax-certified/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/20/the-fujifilm-gfx-eterna-55-is-now-imax-certified/",
    "topic": "photo",
    "date": "2026-01-20T14:06:00.000Z"
  },
  {
    "title": "Photographer Tosses His Leica Away From ICE as He’s Tackled to the Ground",
    "q": "photographer tosses his leica away from ice as he’s tackled to the ground camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Tosses His Leica Away From ICE as He’s Tackled to the Ground</b><br>Photojournalist John Abernathy was tackled by ICE agents in Minneapolis last week and his last-ditch effort to save his camera was successful thanks to fellow photographer Pierre Lavie, who captured Abernathy's camera-saving toss in a now-…<br><a href=\"https://petapixel.com/2026/01/20/photographer-tosses-his-leica-away-from-ice-as-hes-tackled-to-the-ground/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/20/photographer-tosses-his-leica-away-from-ice-as-hes-tackled-to-the-ground/",
    "topic": "photo",
    "date": "2026-01-20T11:30:37.000Z"
  },
  {
    "title": "Sony, Kodak, and DJI Were the Big Camera Market Share Winners of 2025",
    "q": "sony, kodak, and dji were the big camera market share winners of 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony, Kodak, and DJI Were the Big Camera Market Share Winners of 2025</b><br>Japanese retail analyst BCN+R has published its annual BCN Awards, detailing the best-selling photography brands across the majority of Japanese electronics and camera stores. There are some surprising results this year, although the major…<br><a href=\"https://petapixel.com/2026/01/19/sony-kodak-and-dji-were-the-big-camera-market-share-winners-of-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/19/sony-kodak-and-dji-were-the-big-camera-market-share-winners-of-2025/",
    "topic": "photo",
    "date": "2026-01-19T20:45:06.000Z"
  },
  {
    "title": "WhiteWall Partners With Irys, the Social Media Platform for Real Photography",
    "q": "whitewall partners with irys, the social media platform for real photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>WhiteWall Partners With Irys, the Social Media Platform for Real Photography</b><br>WhiteWall is now a founding partner for the photography app, Irys, that celebrated photographer Alan Schaller launched last year. The app celebrates the art of photography over algorithms and prioritizes personal connection over virality. …<br><a href=\"https://petapixel.com/2026/01/19/whitewall-partners-with-irys-the-social-media-platform-for-real-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/19/whitewall-partners-with-irys-the-social-media-platform-for-real-photography/",
    "topic": "photo",
    "date": "2026-01-19T20:06:59.000Z"
  },
  {
    "title": "Adobe Premiere gets a cleaner name and some new tricks",
    "q": "adobe premiere gets a cleaner name and some new tricks camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe Premiere gets a cleaner name and some new tricks</b><br>Image: Adobe Adobe has announced Premiere 26, the latest version of its video editing software that brings a useful feature out of beta, adds support for the R3D NE Raw files that Nikon introduced with the video-focused ZR and comes with a…<br><a href=\"https://www.dpreview.com/news/7068552137/adobe-premiere-26-object-selection-launch-rebrand-r3d-ne\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7068552137/adobe-premiere-26-object-selection-launch-rebrand-r3d-ne",
    "topic": "photo",
    "date": "2026-01-20T14:00:00.000Z"
  },
  {
    "title": "Tamron 70-180mm F2.8 Di III VC VXD G2 sample gallery and impressions",
    "q": "tamron 70-180mm f2.8 di iii vc vxd g2 sample gallery and impressions camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Tamron 70-180mm F2.8 Di III VC VXD G2 sample gallery and impressions</b><br>When you use DPReview links to buy products, the site may earn a commission. Nikon Z8 | Tamron 70-180mm F2.8 | 180mm | F4 | 1/200 sec | ISO 125 Photos: Mitchell Clark Late last year, Tamron announced that it was bringing its venerable 70-1…<br><a href=\"https://www.dpreview.com/samples/0257901751/tamron-70-180mm-f2-8-di-iii-vc-vxd-g2-sample-gallery\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/samples/0257901751/tamron-70-180mm-f2-8-di-iii-vc-vxd-g2-sample-gallery",
    "topic": "photo",
    "date": "2026-01-19T14:00:00.000Z"
  },
  {
    "title": "Our \"Silly Signs\" photo challenge is now open for submissions",
    "q": "our \"silly signs\" photo challenge is now open for submissions camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Our \"Silly Signs\" photo challenge is now open for submissions</b><br>I took this photo while touring Astoria, Oregon, solely to explore the sites featured in the 1985 movie The Goonies. The photo depicts the driveway sign leading up to the house where some of the Goonies kids lived. Photo: Mathew Anderson O…<br><a href=\"https://www.dpreview.com/articles/5396766660/january-2026-photo-challenge-is-open-for-submissions\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5396766660/january-2026-photo-challenge-is-open-for-submissions",
    "topic": "photo",
    "date": "2026-01-18T14:27:00.000Z"
  },
  {
    "title": "Important settings to change on any new camera",
    "q": "important settings to change on any new camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Important settings to change on any new camera</b><br>Photo: Abby Ferguson Getting a new camera is always exciting, even if it's only new to you. So much so that it can be tempting to jump right into using it without much, if any, setup. However, despite the urge to get started right away, it…<br><a href=\"https://www.dpreview.com/articles/2640531041/important-settings-to-change-on-any-new-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2640531041/important-settings-to-change-on-any-new-camera",
    "topic": "photo",
    "date": "2026-01-18T14:00:00.000Z"
  },
  {
    "title": "Do photographers need the fastest external SSD? We tested three to find out",
    "q": "do photographers need the fastest external ssd? we tested three to find out camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do photographers need the fastest external SSD? We tested three to find out</b><br>We put the USB 3.2 Gen 2 Samsung T7 Shield, USB4 SanDisk Extreme Pro and Thunderbolt 5 OWC Envoy Ultra head-to-head. Photo: Mitchell Clark These days, there are an overwhelming number of options when it comes to buying an external SSD to e…<br><a href=\"https://www.dpreview.com/reviews/usb-4-thunderbolt-5-ssd-owc-sandisk-speeds-roundup\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/usb-4-thunderbolt-5-ssd-owc-sandisk-speeds-roundup",
    "topic": "photo",
    "date": "2026-01-17T14:00:00.000Z"
  },
  {
    "title": "From whales to coral reefs, this photo contest showcases underwater excellence",
    "q": "from whales to coral reefs, this photo contest showcases underwater excellence camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>From whales to coral reefs, this photo contest showcases underwater excellence</b><br>2025 DPG Masters Underwater Imaging Competition DivePhotoGuide (DPG) has announced the winners of its Masters Underwater Imaging Competition 2025. The contest consists of nine image categories, including wide angle, macro, over-under, comp…<br><a href=\"https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition",
    "topic": "photo",
    "date": "2026-01-16T15:16:00.000Z"
  },
  {
    "title": "Timed-to-perfection moments from the World Sports Photography Awards",
    "q": "timed-to-perfection moments from the world sports photography awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Timed-to-perfection moments from the World Sports Photography Awards</b><br>2026 World Sports Photography Awards The winners of the 2026 World Sports Photography Awards have been announced, highlighting impeccable timing, dramatic lighting and memorable moments. The contest showcases work from sports photographers…<br><a href=\"https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards",
    "topic": "photo",
    "date": "2026-01-15T18:55:00.000Z"
  },
  {
    "title": "Sony a7 V video studio scene: what do you really need?",
    "q": "sony a7 v video studio scene: what do you really need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony a7 V video studio scene: what do you really need?</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We've taken a look at how the Sony a7 V performs when it comes to stills, now it's time to turn our attention to video. The company's latest…<br><a href=\"https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene",
    "topic": "photo",
    "date": "2026-01-15T14:00:00.000Z"
  },
  {
    "title": "Breaking Leica's monopoly: Ricoh releases GR IV Mono",
    "q": "breaking leica's monopoly: ricoh releases gr iv mono camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Breaking Leica's monopoly: Ricoh releases GR IV Mono</b><br>When you use DPReview links to buy products, the site may earn a commission. Sample gallery This widget is not optimized for RSS feed readers. Please open this article's permalink in a browser to view this content. Product photos: Richard …<br><a href=\"https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4824152875/ricoh-gr-iv-monochrome-launch",
    "topic": "photo",
    "date": "2026-01-14T22:00:00.000Z"
  },
  {
    "title": "Question of the week: What projects are you undertaking to move your photography forward?",
    "q": "question of the week: what projects are you undertaking to move your photography forward? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Question of the week: What projects are you undertaking to move your photography forward?</b><br>All photographers inevitably deal with creative droughts or periods when they feel their skills have plateaued. At the end of last year, I wrote about part of why (and how) that's manifested for me over the past few years. For me, one comm…<br><a href=\"https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/forums/threads/what-projects-are-you-tackling-or-have-tackled-to-move-your-photography-forward.4827146/",
    "topic": "photo",
    "date": "2026-01-14T15:50:00.000Z"
  },
  {
    "title": " I’m a sports photographer, these are my five favorite match-winning shots from the World Sports Photography Awards 2026 ",
    "q": " i’m a sports photographer, these are my five favorite match-winning shots from the world sports photography awards 2026  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I’m a sports photographer, these are my five favorite match-winning shots from the World Sports Photography Awards 2026 </b><br>The caliber of World Sports Photography Awards entries couldn’t have been higher – but beyond the gold medal, this selection of category winners really stood out to me<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/im-a-sports-photographer-these-are-my-five-favorite-match-winning-shots-from-the-world-sports-photography-awards-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/im-a-sports-photographer-these-are-my-five-favorite-match-winning-shots-from-the-world-sports-photography-awards-2026",
    "topic": "photo",
    "date": "2026-01-20T17:26:21.000Z"
  },
  {
    "title": " A major solar storm brought the aurora farther south than normal. But are we in for an encore for photographers tonight? ",
    "q": " a major solar storm brought the aurora farther south than normal. but are we in for an encore for photographers tonight?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> A major solar storm brought the aurora farther south than normal. But are we in for an encore for photographers tonight? </b><br>Chances of spotting the northern lights linger into Tuesday night after a major solar storm<br><a href=\"https://www.digitalcameraworld.com/photography/astrophotography/a-major-solar-storm-brought-the-aurora-farther-south-than-normal-but-are-we-in-for-an-encore-tonight\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/astrophotography/a-major-solar-storm-brought-the-aurora-farther-south-than-normal-but-are-we-in-for-an-encore-tonight",
    "topic": "photo",
    "date": "2026-01-20T16:23:50.000Z"
  },
  {
    "title": " Honor Magic 8 Lite review: The phone with the unkillable battery ",
    "q": " honor magic 8 lite review: the phone with the unkillable battery  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Honor Magic 8 Lite review: The phone with the unkillable battery </b><br>The Honor Magic 8 Lite's cameras aren't flagship — but its battery is<br><a href=\"https://www.digitalcameraworld.com/tech/android-phones/honor-magic-8-lite-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/android-phones/honor-magic-8-lite-review",
    "topic": "photo",
    "date": "2026-01-20T15:00:00.000Z"
  },
  {
    "title": " Only weeks on the market, this full-frame powerhouse tops Japan’s best-selling camera charts – Again!  ",
    "q": " only weeks on the market, this full-frame powerhouse tops japan’s best-selling camera charts – again!   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Only weeks on the market, this full-frame powerhouse tops Japan’s best-selling camera charts – Again!  </b><br>A record-breaking sales star: This new camera outsold all four Fujifilm models ranked from second to fifth combined...<br><a href=\"https://www.digitalcameraworld.com/cameras/only-weeks-on-the-market-this-full-frame-powerhouse-tops-japans-best-selling-camera-charts-again\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/only-weeks-on-the-market-this-full-frame-powerhouse-tops-japans-best-selling-camera-charts-again",
    "topic": "photo",
    "date": "2026-01-20T13:15:00.000Z"
  },
  {
    "title": " The OM System OM-5 is now a seriously good $749 deal ",
    "q": " the om system om-5 is now a seriously good $749 deal  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The OM System OM-5 is now a seriously good $749 deal </b><br>This rugged mirrorless camera just dropped $250<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-om-system-om-5-is-now-a-seriously-good-usd749-deal\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-om-system-om-5-is-now-a-seriously-good-usd749-deal",
    "topic": "photo",
    "date": "2026-01-20T12:15:00.000Z"
  },
  {
    "title": " Birdfy Feeder 2 Duo review: two cameras, three angles ",
    "q": " birdfy feeder 2 duo review: two cameras, three angles  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Birdfy Feeder 2 Duo review: two cameras, three angles </b><br>Does the multi-angle Birdfy Feeder 2 Duo, described as its ‘smartest’ bird feeder camera yet, deserve pole position for observing feathered friends?<br><a href=\"https://www.digitalcameraworld.com/cameras/bird-feeder-cameras/birdfy-feeder-2-duo-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/bird-feeder-cameras/birdfy-feeder-2-duo-review",
    "topic": "photo",
    "date": "2026-01-20T11:45:00.000Z"
  },
  {
    "title": " I recently did a photo talk at Winchester Photographic Society – these were your most asked questions ",
    "q": " i recently did a photo talk at winchester photographic society – these were your most asked questions  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I recently did a photo talk at Winchester Photographic Society – these were your most asked questions </b><br>It's always fascinating to meet camera club members in the real world and here were your most commonly asked questions about copyright and weddings<br><a href=\"https://www.digitalcameraworld.com/photography/portrait-photography/i-recently-did-a-photo-talk-at-winchester-photographic-society-these-were-your-most-asked-questions\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/portrait-photography/i-recently-did-a-photo-talk-at-winchester-photographic-society-these-were-your-most-asked-questions",
    "topic": "photo",
    "date": "2026-01-20T11:38:34.000Z"
  },
  {
    "title": "High Angle Photography – Ideas to Try Some “From Above” Photos",
    "q": "high angle photography – ideas to try some “from above” photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>High Angle Photography – Ideas to Try Some “From Above” Photos</b><br>High angle photography is a technique used by photographers to capture stunning aerial shots that reveal scenes from perspectives impossible to achieve at eye level. This approach involves taking photographs from an elevated vantage point,…<br><a href=\"https://www.slrlounge.com/high-angle-photography-ideas-to-try-some-from-above-photos-from-cooph/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/high-angle-photography-ideas-to-try-some-from-above-photos-from-cooph/",
    "topic": "photo",
    "date": "2026-01-19T20:51:31.000Z"
  },
  {
    "title": "Black and White Landscape Photos and Tips to Inspire Your Adventures",
    "q": "black and white landscape photos and tips to inspire your adventures camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Black and White Landscape Photos and Tips to Inspire Your Adventures</b><br>Looking for inspiration for photographing your next road trip (or walk around the block)? Check out our curated list of black and white landscape photos!<br><a href=\"https://www.slrlounge.com/10-black-and-white-landscape-photos-to-inspire-your-adventures/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/10-black-and-white-landscape-photos-to-inspire-your-adventures/",
    "topic": "photo",
    "date": "2026-01-19T20:45:29.000Z"
  },
  {
    "title": "Sitting Pose Tips, Ideas and Common Mistakes",
    "q": "sitting pose tips, ideas and common mistakes camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sitting Pose Tips, Ideas and Common Mistakes</b><br>You can have the best, most perfectly prepared subject with phenomenal hair, makeup and styling and have gorgeous light at your disposal, but bad or mediocre posing will make it all moot. Even an experienced model who knows how to work the…<br><a href=\"https://www.slrlounge.com/how-to-fix-sitting-posing-mistakes/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-fix-sitting-posing-mistakes/",
    "topic": "photo",
    "date": "2026-01-18T20:38:58.000Z"
  },
  {
    "title": "Dynamic 3-Light Sports Portrait Setup",
    "q": "dynamic 3-light sports portrait setup camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Dynamic 3-Light Sports Portrait Setup</b><br>When it comes to taking sports photography portraits, capturing dynamic energy is the name of the game. Sports portraits often convey a sense of action and energy with dramatic poses and lighting, the latter of which often relies on using …<br><a href=\"https://www.slrlounge.com/dynamic-3-light-sports-portrait-setup/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dynamic-3-light-sports-portrait-setup/",
    "topic": "photo",
    "date": "2026-01-16T20:25:28.000Z"
  },
  {
    "title": "3 Ways To Photograph Family Group Photos With Flash",
    "q": "3 ways to photograph family group photos with flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>3 Ways To Photograph Family Group Photos With Flash</b><br>Setting up one directional off-camera flash with a shoot-through umbrella may be your go-to lighting setup for family formals, but what other ways can you light a group of people to create more drama or visual interest? Light alters the mo…<br><a href=\"https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-ways-to-photograph-family-group-photos-with-flash/",
    "topic": "photo",
    "date": "2026-01-14T19:59:28.000Z"
  },
  {
    "title": "Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits ",
    "q": "creative color shifts | using nik collection’s color efex for dramatic portraits  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits </b><br>Explore creative colour shifts in still life photography using Nik Collection’s Color Efex Pro. In this video, I show how to use colour grading, film-inspired filters, and local contrast tools to create dramatic, moody still life images wi…<br><a href=\"https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/",
    "topic": "photo",
    "date": "2026-01-20T14:00:00.000Z"
  },
  {
    "title": "Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity",
    "q": "removing distractions in lightroom vs luminar, photolab and affinity camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity</b><br>In this beginner-friendly editing comparison, I walk photographers through one of the most common frustrations: removing unwanted people and distractions from photos, without needing to touch Photoshop. Using a real-world example from a bu…<br><a href=\"https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/",
    "topic": "photo",
    "date": "2026-01-19T14:00:00.000Z"
  },
  {
    "title": "A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light",
    "q": "a coastal wake-up call: variable nd filters vs real-world light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light</b><br>What I Loved in the Studio, and What Caught Me Out on the Coast After spending time with the K&F CONCEPT Ultra-Low Reflection Variable ND Filter in the studio, I was genuinely impressed. Long exposures behaved beautifully, reflections were…<br><a href=\"https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/",
    "topic": "photo",
    "date": "2026-01-18T14:00:00.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "The best iPad deals you can get right now",
    "q": "the best ipad deals you can get right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best iPad deals you can get right now</b><br>The 13-inch Pro is getting dangerously close to laptop territory. | Photo: Amelia Holowaty Krales / The Verge While the best iPad deals usually land during major sale events like Black Friday, many great iPad deals are available outside of…<br><a href=\"https://www.theverge.com/21280354/best-ipad-deals-apple\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21280354/best-ipad-deals-apple",
    "topic": "it",
    "date": "2026-01-20T17:57:00.000Z"
  },
  {
    "title": "Corsair’s wired Hall effect gaming keyboard is cheaper than ever",
    "q": "corsair’s wired hall effect gaming keyboard is cheaper than ever windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Corsair’s wired Hall effect gaming keyboard is cheaper than ever</b><br>Hall effect switches are the most customizable and fastest you can currently get in a gaming keyboard. As such, they don’t usually come cheap. However, they’re fairly affordable to upgrade to today thanks to a deal on Corsair’s Vanguard Pr…<br><a href=\"https://www.theverge.com/gadgets/864339/corsair-hall-effect-gaming-keyboard-resident-evil-requiem-surface-laptop-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/864339/corsair-hall-effect-gaming-keyboard-resident-evil-requiem-surface-laptop-deal-sale",
    "topic": "it",
    "date": "2026-01-20T15:35:00.000Z"
  },
  {
    "title": "How BYD beat Tesla",
    "q": "how byd beat tesla windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How BYD beat Tesla</b><br>The Model S. The Mach-E. The Ioniq. The… Dolphin Surf? That's right, friends: There's a new biggest name in EVs, and it means you might soon be cruising down the highway in the Dolphin Surf. And you might love it. After years of Tesla domi…<br><a href=\"https://www.theverge.com/podcast/864314/byd-tesla-china-evs-vergecast\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/podcast/864314/byd-tesla-china-evs-vergecast",
    "topic": "it",
    "date": "2026-01-20T13:40:00.000Z"
  },
  {
    "title": "Netflix revises Warner Bros. bid to an all-cash offer",
    "q": "netflix revises warner bros. bid to an all-cash offer windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Netflix revises Warner Bros. bid to an all-cash offer</b><br>Netflix has updated the acquisition terms for its Warner Bros. Discovery offer to an all-cash deal, replacing its initial $82.7 billion cash and stock agreement. The changes are designed to expedite the sale of WBD studios and streaming bu…<br><a href=\"https://www.theverge.com/news/863318/netflix-warner-bros-discovery-merger-revision-cash-deal\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/863318/netflix-warner-bros-discovery-merger-revision-cash-deal",
    "topic": "it",
    "date": "2026-01-20T12:26:10.000Z"
  },
  {
    "title": "Microsoft’s free Xbox Cloud Gaming is coming soon with ads",
    "q": "microsoft’s free xbox cloud gaming is coming soon with ads windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft’s free Xbox Cloud Gaming is coming soon with ads</b><br>Microsoft has been testing its ad-supported Xbox Cloud Gaming service over the past few months, as I exclusively revealed in October. Now, the software giant is getting close to testing the free streaming option with Xbox Insiders. Over th…<br><a href=\"https://www.theverge.com/news/864261/xbox-cloud-gaming-free-ads-testing\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/864261/xbox-cloud-gaming-free-ads-testing",
    "topic": "it",
    "date": "2026-01-20T10:38:34.000Z"
  },
  {
    "title": " Grab $420 off this prebuilt gaming PC with an RTX 5070, 32GB of DDR5 RAM and 2TB storage — Ryzen-equipped MSI machine costs $1,549 and is perfect for 1440p gaming ",
    "q": " grab $420 off this prebuilt gaming pc with an rtx 5070, 32gb of ddr5 ram and 2tb storage — ryzen-equipped msi machine costs $1,549 and is perfect for 1440p gaming  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Grab $420 off this prebuilt gaming PC with an RTX 5070, 32GB of DDR5 RAM and 2TB storage — Ryzen-equipped MSI machine costs $1,549 and is perfect for 1440p gaming </b><br>Save 21% on the list price for this MSI Codex Z2 gaming PC, fitted with an Nvidia GeForce RTX 5070, AMD Ryzen 7 8700F, 32GB of DDR5 RAM, and a 2TB SSD, all for just $1,579.<br><a href=\"https://www.tomshardware.com/pc-components/grab-usd420-off-this-prebuilt-gaming-pc-with-an-rtx-5070-32gb-of-ddr5-ram-and-2tb-storage-ryzen-equipped-msi-machine-costs-usd1-549-and-is-perfect-for-1440p-gaming\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/pc-components/grab-usd420-off-this-prebuilt-gaming-pc-with-an-rtx-5070-32gb-of-ddr5-ram-and-2tb-storage-ryzen-equipped-msi-machine-costs-usd1-549-and-is-perfect-for-1440p-gaming",
    "topic": "it",
    "date": "2026-01-20T12:54:00.000Z"
  },
  {
    "title": " Nvidia's Arm-based N1X-equipped gaming laptops are reportedly set to debut this quarter, with N2 series chips planned for 2027 — new roadmap leak finally hints at consumer release Windows-on-ARM machines ",
    "q": " nvidia's arm-based n1x-equipped gaming laptops are reportedly set to debut this quarter, with n2 series chips planned for 2027 — new roadmap leak finally hints at consumer release windows-on-arm machines  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Nvidia's Arm-based N1X-equipped gaming laptops are reportedly set to debut this quarter, with N2 series chips planned for 2027 — new roadmap leak finally hints at consumer release Windows-on-ARM machines </b><br>Nvidia's long-rumored N1/N1X SoCs have traded an actual launch for rumors for more than two years now. Going as far back as 2021, when MediaTek's partnership with Nvidia was first unveiled, we've only heard about the chip through leaks. Wi…<br><a href=\"https://www.tomshardware.com/pc-components/cpus/nvidias-arm-based-n1x-equipped-gaming-laptops-are-reportedly-set-to-debut-this-quarter-with-n2-series-chips-planned-for-2027-new-roadmap-leak-finally-hints-at-consumer-release-windows-on-arm-machines\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/pc-components/cpus/nvidias-arm-based-n1x-equipped-gaming-laptops-are-reportedly-set-to-debut-this-quarter-with-n2-series-chips-planned-for-2027-new-roadmap-leak-finally-hints-at-consumer-release-windows-on-arm-machines",
    "topic": "it",
    "date": "2026-01-20T12:35:34.000Z"
  },
  {
    "title": "5 Linux file managers to try when your GUI just won't do - they're all free",
    "q": "5 linux file managers to try when your gui just won't do - they're all free windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>5 Linux file managers to try when your GUI just won't do - they're all free</b><br>There are instances when a GUI file manager just won't work. When I run into those situations, there are several terminal-based options I go for.<br><a href=\"https://www.zdnet.com/article/favorite-terminal-based-linux-file-managers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/favorite-terminal-based-linux-file-managers/",
    "topic": "it",
    "date": "2026-01-20T17:31:20.000Z"
  },
  {
    "title": "Don't want to update your iPhone to iOS 26? These 4 reasons changed my mind immediately",
    "q": "don't want to update your iphone to ios 26? these 4 reasons changed my mind immediately windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Don't want to update your iPhone to iOS 26? These 4 reasons changed my mind immediately</b><br>Many iPhone owners may be resisting iOS 26. But this latest version includes important security updates that will keep your phone protected.<br><a href=\"https://www.zdnet.com/article/ios26-upgrade-four-security-reasons/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/ios26-upgrade-four-security-reasons/",
    "topic": "it",
    "date": "2026-01-20T15:51:00.000Z"
  },
  {
    "title": "I cracked Hyprland at last - thanks to this Arch-based Linux distro",
    "q": "i cracked hyprland at last - thanks to this arch-based linux distro windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I cracked Hyprland at last - thanks to this Arch-based Linux distro</b><br>Omarchy isn't for beginners, but it's the best way I've found to use Hyprland and get straight to work.<br><a href=\"https://www.zdnet.com/article/omarchy-linux-distro-makes-hyprland-easy/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/omarchy-linux-distro-makes-hyprland-easy/",
    "topic": "it",
    "date": "2026-01-20T15:44:00.000Z"
  },
  {
    "title": "Microsoft issues emergency patch for latest Windows bugs - grab it ASAP",
    "q": "microsoft issues emergency patch for latest windows bugs - grab it asap windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft issues emergency patch for latest Windows bugs - grab it ASAP</b><br>The out-of-band patch fixes a couple of annoying bugs added to Windows 11 and 10 by Microsoft's January update.<br><a href=\"https://www.zdnet.com/article/microsoft-emergency-tuesday-patch/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/microsoft-emergency-tuesday-patch/",
    "topic": "it",
    "date": "2026-01-20T15:21:55.000Z"
  },
  {
    "title": "Your Bluetooth earbuds are at risk of being hijacked - here's how to prevent it ASAP",
    "q": "your bluetooth earbuds are at risk of being hijacked - here's how to prevent it asap windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Your Bluetooth earbuds are at risk of being hijacked - here's how to prevent it ASAP</b><br>Google Fast Pair makes pairing easy, but a flawed implementation has created a potential security risk.<br><a href=\"https://www.zdnet.com/article/whisperpair-google-fast-pair-bluetooth-earbuds-attack/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/whisperpair-google-fast-pair-bluetooth-earbuds-attack/",
    "topic": "it",
    "date": "2026-01-20T15:17:00.000Z"
  },
  {
    "title": " Windows 11's reputation is at an all-time low ",
    "q": " windows 11's reputation is at an all-time low  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11's reputation is at an all-time low </b><br>Podcast: Daniel and Zac discuss the current state of Windows 11, all the recent backlash around Microsoft and AI, and how the platform has evolved into something most people hate.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-11s-reputation-is-at-an-all-time-low\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/windows-11s-reputation-is-at-an-all-time-low",
    "topic": "it",
    "date": "2026-01-20T14:20:19.000Z"
  },
  {
    "title": " Microsoft's AI Chief says we'll have intimate AI companions within 5 years — they'll know us \"deeply\" and help us navigate our lives ",
    "q": " microsoft's ai chief says we'll have intimate ai companions within 5 years — they'll know us \"deeply\" and help us navigate our lives  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft's AI Chief says we'll have intimate AI companions within 5 years — they'll know us \"deeply\" and help us navigate our lives </b><br>Microsoft AI CEO Mustafa Suleyman believes everyone will have an AI companion within the next five years, forming a personal and intimate connection with it.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsoft-ai-chief-intimate-ai-companion-in-5-years\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsoft-ai-chief-intimate-ai-companion-in-5-years",
    "topic": "it",
    "date": "2026-01-20T14:00:42.000Z"
  },
  {
    "title": " I raced to my PC to install this new PowerToys update — but its best new feature is one control away from greatness ",
    "q": " i raced to my pc to install this new powertoys update — but its best new feature is one control away from greatness  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> I raced to my PC to install this new PowerToys update — but its best new feature is one control away from greatness </b><br>Microsoft’s latest PowerToys update overhauled the Command Palette, but the new mouse wrapping feature is a toggle away from being a must-have.<br><a href=\"https://www.windowscentral.com/software-apps/i-raced-to-my-pc-to-install-this-new-powertoys-update-but-its-best-new-feature-is-one-control-away-from-greatness\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/i-raced-to-my-pc-to-install-this-new-powertoys-update-but-its-best-new-feature-is-one-control-away-from-greatness",
    "topic": "it",
    "date": "2026-01-20T13:27:40.000Z"
  },
  {
    "title": " A beefy Xbox Ally update from ASUS lets you avoid Microsoft's \"Gaming Copilot\" AI, alongside other enhancements  ",
    "q": " a beefy xbox ally update from asus lets you avoid microsoft's \"gaming copilot\" ai, alongside other enhancements   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> A beefy Xbox Ally update from ASUS lets you avoid Microsoft's \"Gaming Copilot\" AI, alongside other enhancements  </b><br>The Xbox Ally is getting better, as ASUS continues to iterate on the platform with BIOS and Armoury Crate updates.<br><a href=\"https://www.windowscentral.com/hardware/handheld-gaming-pc/a-beefy-xbox-ally-update-from-asus-lets-you-avoid-microsofts-gaming-copilot-ai-alongside-other-enhancements\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/handheld-gaming-pc/a-beefy-xbox-ally-update-from-asus-lets-you-avoid-microsofts-gaming-copilot-ai-alongside-other-enhancements",
    "topic": "it",
    "date": "2026-01-20T13:24:44.000Z"
  },
  {
    "title": "Microsoft PowerToys adds new CursorWrap mouse 'teleport' tool",
    "q": "microsoft powertoys adds new cursorwrap mouse 'teleport' tool windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft PowerToys adds new CursorWrap mouse 'teleport' tool</b><br>Microsoft has released PowerToys 0.97, with a new mouse utility for multi-monitor setups and significant improvements to the Command Palette quick launcher. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-powertoys-adds-new-cursorwrap-mouse-teleport-tool/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-powertoys-adds-new-cursorwrap-mouse-teleport-tool/",
    "topic": "it",
    "date": "2026-01-20T16:33:30.000Z"
  },
  {
    "title": "Make Identity Threat Detection your security strategy for 2026",
    "q": "make identity threat detection your security strategy for 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Make Identity Threat Detection your security strategy for 2026</b><br>Identity-based attacks are one of the primary paths attackers use to breach corporate networks. Tenfold shows how Identity Threat Detection helps spot suspicious account activity before real damage occurs. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/make-identity-threat-detection-your-security-strategy-for-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/make-identity-threat-detection-your-security-strategy-for-2026/",
    "topic": "it",
    "date": "2026-01-20T15:01:11.000Z"
  },
  {
    "title": "Webinar: Aligning cybersecurity purchases with what your SOC team needs",
    "q": "webinar: aligning cybersecurity purchases with what your soc team needs windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Webinar: Aligning cybersecurity purchases with what your SOC team needs</b><br>Learn how security leaders and SOC teams can work together to close the gap between platform decisions and operational needs. Join Sumo Logic and BleepingComputer on January 29 for a practical webinar on aligning security tools with real-w…<br><a href=\"https://www.bleepingcomputer.com/news/security/webinar-aligning-cybersecurity-purchases-with-what-your-soc-team-needs/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/webinar-aligning-cybersecurity-purchases-with-what-your-soc-team-needs/",
    "topic": "it",
    "date": "2026-01-20T13:15:23.000Z"
  },
  {
    "title": "New PDFSider Windows malware deployed on Fortune 100 firm's network",
    "q": "new pdfsider windows malware deployed on fortune 100 firm's network windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New PDFSider Windows malware deployed on Fortune 100 firm's network</b><br>Ransomware attackers targeting a Fortune 100 company in the finance sector used a new malware strain, dubbed PDFSider, to deliver malicious payloads on Windows systems. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/new-pdfsider-windows-malware-deployed-on-fortune-100-firms-network/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/new-pdfsider-windows-malware-deployed-on-fortune-100-firms-network/",
    "topic": "it",
    "date": "2026-01-19T21:00:34.000Z"
  },
  {
    "title": "KDE Plasma could get a VR desktop mode on Linux",
    "q": "kde plasma could get a vr desktop mode on linux windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>KDE Plasma could get a VR desktop mode on Linux</b><br>This new draft code turns KDE Plasma into a full VR desktop<br><a href=\"https://www.howtogeek.com/kde-plasma-could-get-a-vr-desktop-mode-on-linux/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/kde-plasma-could-get-a-vr-desktop-mode-on-linux/",
    "topic": "it",
    "date": "2026-01-20T18:15:33.000Z"
  },
  {
    "title": "PowerToys 0.97 has a better search bar for your Windows PC",
    "q": "powertoys 0.97 has a better search bar for your windows pc windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>PowerToys 0.97 has a better search bar for your Windows PC</b><br>It also has a new CursorWrap utility, and a pile of small improvements.<br><a href=\"https://www.howtogeek.com/powertoys-097-has-a-better-command-palette-for-your-windows-pc/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/powertoys-097-has-a-better-command-palette-for-your-windows-pc/",
    "topic": "it",
    "date": "2026-01-20T16:32:15.000Z"
  },
  {
    "title": "CachyOS proves Arch derivatives can actually improve on the original",
    "q": "cachyos proves arch derivatives can actually improve on the original windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>CachyOS proves Arch derivatives can actually improve on the original</b><br>If you're considering Arch Linux for your PC, CachyOS makes the case that a custom variant may actually be a better experience overall.<br><a href=\"https://www.xda-developers.com/cachyos-proved-arch-derivatives-can-actually-improve-original/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/cachyos-proved-arch-derivatives-can-actually-improve-original/",
    "topic": "it",
    "date": "2026-01-20T18:00:24.000Z"
  },
  {
    "title": "Windows 11's latest bug won't let you shut down your PC, but there's a fix",
    "q": "windows 11's latest bug won't let you shut down your pc, but there's a fix windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11's latest bug won't let you shut down your PC, but there's a fix</b><br>It just requires a single patch.<br><a href=\"https://www.xda-developers.com/windows-11s-latest-bug-wont-let-you-shut-down-your-pc-but-theres-a-fix/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-11s-latest-bug-wont-let-you-shut-down-your-pc-but-theres-a-fix/",
    "topic": "it",
    "date": "2026-01-20T17:45:47.000Z"
  },
  {
    "title": "I still don't understand why Microsoft didn't upgrade Windows with these utilities",
    "q": "i still don't understand why microsoft didn't upgrade windows with these utilities windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I still don't understand why Microsoft didn't upgrade Windows with these utilities</b><br>Bare essentials accessible only through third-party software<br><a href=\"https://www.xda-developers.com/microsoft-should-upgrade-windows-utilities/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/microsoft-should-upgrade-windows-utilities/",
    "topic": "it",
    "date": "2026-01-20T17:30:22.000Z"
  },
  {
    "title": "Bazzite isn't the Windows gaming replacement everyone hopes it is",
    "q": "bazzite isn't the windows gaming replacement everyone hopes it is windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Bazzite isn't the Windows gaming replacement everyone hopes it is</b><br>But it's still a great Linux OS for gaming<br><a href=\"https://www.xda-developers.com/bazzite-isnt-the-windows-gaming-replacement-everyone-hopes-it-is/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/bazzite-isnt-the-windows-gaming-replacement-everyone-hopes-it-is/",
    "topic": "it",
    "date": "2026-01-20T15:30:20.000Z"
  }
]