[
  {
    "title": "This Free Calculator Figures Out Your Anamorphic Aspect Ratios",
    "q": "this free calculator figures out your anamorphic aspect ratios camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Free Calculator Figures Out Your Anamorphic Aspect Ratios</b><br>Anamorphic lenses are a regular part of many cinematographers' kits, especially as new anamorphic lenses become more affordable and more cameras include more video recording features that help anamorphic optics shine. However, it can be ch…<br><a href=\"https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/",
    "topic": "photo",
    "date": "2025-11-28T18:22:43.000Z"
  },
  {
    "title": "The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now",
    "q": "the 10 best deals on full-frame mirrorless cameras right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now</b><br>We already have a deep-dive article about all the best deals on cameras for Black Friday and Cyber Monday, but some of the deals are so good that they warrant a bit more attention. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/",
    "topic": "photo",
    "date": "2025-11-28T17:31:02.000Z"
  },
  {
    "title": "Excire’s Incredible AI Photo-Management Tools Are 30% Off Through December 7th",
    "q": "excire’s incredible ai photo-management tools are 30% off through december 7th camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Excire’s Incredible AI Photo-Management Tools Are 30% Off Through December 7th</b><br>Excire’s AI-powered photo-management software has developed a devoted following among photographers who want faster culling, smarter search tools, and a well-organized image library—and this Black Friday, the company is offering a rare cha…<br><a href=\"https://petapixel.com/2025/11/28/excires-incredible-ai-photo-management-tools-are-30-off-through-december-7th/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/excires-incredible-ai-photo-management-tools-are-30-off-through-december-7th/",
    "topic": "photo",
    "date": "2025-11-28T16:06:11.000Z"
  },
  {
    "title": "The Best Deals on Lenses for Mirrorless and DSLR Cameras",
    "q": "the best deals on lenses for mirrorless and dslr cameras camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Best Deals on Lenses for Mirrorless and DSLR Cameras</b><br>Holiday savings are here at B&H, with huge deals on top prime and zoom lenses from all the major brands. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/the-best-deals-on-lenses-for-mirrorless-and-dslr-cameras/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-best-deals-on-lenses-for-mirrorless-and-dslr-cameras/",
    "topic": "photo",
    "date": "2025-11-28T14:52:10.000Z"
  },
  {
    "title": "‘Adolescence’ Cinematographer Signals Plans for Another One-Take Series",
    "q": "‘adolescence’ cinematographer signals plans for another one-take series camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘Adolescence’ Cinematographer Signals Plans for Another One-Take Series</b><br>The cinematographer and camera operator behind the hit Netflix drama Adolescence revealed their plans to film another one-take series. [Read More]<br><a href=\"https://petapixel.com/2025/11/27/netflix-adolescence-cinematographer-reveals-plans-for-another-one-shot-series/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/27/netflix-adolescence-cinematographer-reveals-plans-for-another-one-shot-series/",
    "topic": "photo",
    "date": "2025-11-27T17:17:18.000Z"
  },
  {
    "title": "The Best Deals on Cameras for Black Friday and Cyber Monday",
    "q": "the best deals on cameras for black friday and cyber monday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Best Deals on Cameras for Black Friday and Cyber Monday</b><br>The 2025 holiday season brings savings on cameras of all types at B&H, from professional full-frame DSLRs and mirrorless systems to compact point-and-shoots and analog cameras. There’s something for everyone. [Read More]<br><a href=\"https://petapixel.com/2025/11/27/the-best-deals-on-cameras-for-black-friday-and-cyber-monday/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/27/the-best-deals-on-cameras-for-black-friday-and-cyber-monday/",
    "topic": "photo",
    "date": "2025-11-27T15:36:46.000Z"
  },
  {
    "title": "Canon RF 45mm f/1.2 STM Review: Affordable and Usable Wide Aperture",
    "q": "canon rf 45mm f/1.2 stm review: affordable and usable wide aperture camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon RF 45mm f/1.2 STM Review: Affordable and Usable Wide Aperture</b><br>In a photo industry of ever-increasing prices, it's refreshing to see optics that supply exceptional value for the dollar. The new Canon RF 45mm f/1.2 STM made the entire industry double-take upon seeing an f/1.2 optic for only $479. Surel…<br><a href=\"https://petapixel.com/2025/11/27/canon-rf-45mm-f-1-2-stm-review-affordable-and-usable-wide-aperture/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/27/canon-rf-45mm-f-1-2-stm-review-affordable-and-usable-wide-aperture/",
    "topic": "photo",
    "date": "2025-11-27T15:01:10.000Z"
  },
  {
    "title": "Photographer Recreates Kingfisher Shot That Took Six Years in Just Six Minutes",
    "q": "photographer recreates kingfisher shot that took six years in just six minutes camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Recreates Kingfisher Shot That Took Six Years in Just Six Minutes</b><br>Back in 2015, Scottish photographer Alan McFadyen spent six years and fired off 720,000 shots in his quest to capture the perfect kingfisher photograph -- an image that went on to become an internet sensation. A decade later, armed with mo…<br><a href=\"https://petapixel.com/2025/11/27/photographer-recreates-kingfisher-shot-that-took-six-years-in-just-six-minutes/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/27/photographer-recreates-kingfisher-shot-that-took-six-years-in-just-six-minutes/",
    "topic": "photo",
    "date": "2025-11-27T14:29:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": "2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation",
    "q": "2025 royal photographic society awards reveal groundbreaking winners in art, science and innovation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation</b><br>Photos from left to right: Omar Victor Diop, Susan Derges HonFRPS and Jaskirt Dhaliwal-Boora The Royal Photographic Society has announced the recipients of its 2025 Awards. The contest highlights significant contributions across both the a…<br><a href=\"https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation",
    "topic": "photo",
    "date": "2025-11-24T15:55:00.000Z"
  },
  {
    "title": "The answers you missed: What our staff revealed in the DPReview AMA",
    "q": "the answers you missed: what our staff revealed in the dpreview ama camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The answers you missed: What our staff revealed in the DPReview AMA</b><br>Last week, the DPReview Editorial team hosted its first Ask Me Anything (AMA) event in the new forums. These AMA sessions are a great way to engage directly with our staff and pose those burning questions you've always wanted to ask. We ad…<br><a href=\"https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2137410254/the-answers-you-missed-what-our-staff-revealed-in-the-dpreview-ama",
    "topic": "photo",
    "date": "2025-11-23T15:00:00.000Z"
  },
  {
    "title": " I hate traveling with heavy camera gear. This is my favorite compact camera for travel (and there’s a hidden $100 coupon right now) ",
    "q": " i hate traveling with heavy camera gear. this is my favorite compact camera for travel (and there’s a hidden $100 coupon right now)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I hate traveling with heavy camera gear. This is my favorite compact camera for travel (and there’s a hidden $100 coupon right now) </b><br>The OM System Tough TG-7 is my go-to compact for travel – if I didn't already have it, I'd be snapping up this deal<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/i-hate-traveling-with-heavy-camera-gear-this-is-my-favorite-compact-camera-for-travel-and-theres-a-hidden-usd100-coupon-right-now\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/i-hate-traveling-with-heavy-camera-gear-this-is-my-favorite-compact-camera-for-travel-and-theres-a-hidden-usd100-coupon-right-now",
    "topic": "photo",
    "date": "2025-11-28T17:53:10.000Z"
  },
  {
    "title": " A 50MP DSLR, an accidental moment, and the photographer's intuition created this award-winning, multiple-exposure image – but it's not actually what it seems ",
    "q": " a 50mp dslr, an accidental moment, and the photographer's intuition created this award-winning, multiple-exposure image – but it's not actually what it seems  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> A 50MP DSLR, an accidental moment, and the photographer's intuition created this award-winning, multiple-exposure image – but it's not actually what it seems </b><br>The Nature Photographer of the Year announces its winner, and the awarded image stood out with its ethereal colors, perfect balance, and otherworldly atmosphere – let's discover its secret<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/a-50mp-dslr-an-accidental-moment-and-the-photographers-intuition-created-this-award-winning-multiple-exposure-image-but-its-not-actually-what-it-seems\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/a-50mp-dslr-an-accidental-moment-and-the-photographers-intuition-created-this-award-winning-multiple-exposure-image-but-its-not-actually-what-it-seems",
    "topic": "photo",
    "date": "2025-11-28T17:49:12.000Z"
  },
  {
    "title": " These 5 photography things made my Black Friday list – Affordable, practical, fun, or perfect for getting the most out of my existing kit  ",
    "q": " these 5 photography things made my black friday list – affordable, practical, fun, or perfect for getting the most out of my existing kit   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These 5 photography things made my Black Friday list – Affordable, practical, fun, or perfect for getting the most out of my existing kit  </b><br>Discover budget-friendly photography tools from as little as $6, that boost creativity, streamline your workflow, and help elevate your shots without breaking the bank<br><a href=\"https://www.digitalcameraworld.com/cameras/camera-accessories/these-5-photography-things-made-my-black-friday-list-affordable-practical-fun-or-perfect-for-getting-the-most-out-of-my-existing-kit\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/camera-accessories/these-5-photography-things-made-my-black-friday-list-affordable-practical-fun-or-perfect-for-getting-the-most-out-of-my-existing-kit",
    "topic": "photo",
    "date": "2025-11-28T17:13:09.000Z"
  },
  {
    "title": " Sorry, but you don’t need a retro compact camera. This US$98 / £94 pancake lens makes a mirrorless feel both more film-like and more compact ",
    "q": " sorry, but you don’t need a retro compact camera. this us$98 / £94 pancake lens makes a mirrorless feel both more film-like and more compact  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Sorry, but you don’t need a retro compact camera. This US$98 / £94 pancake lens makes a mirrorless feel both more film-like and more compact </b><br>The PolarPro LightLeak 28mm is my favorite lens for creating a retro look, and I've never seen the price lower<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/sorry-but-you-dont-need-a-retro-compact-camera-this-us-usd98-gbp94-pancake-lens-makes-a-mirrorless-feel-both-more-film-like-and-more-compact\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/sorry-but-you-dont-need-a-retro-compact-camera-this-us-usd98-gbp94-pancake-lens-makes-a-mirrorless-feel-both-more-film-like-and-more-compact",
    "topic": "photo",
    "date": "2025-11-28T16:44:42.000Z"
  },
  {
    "title": " The Fujifilm X-T30 III has barely launched – but you can already save money this Black Friday ",
    "q": " the fujifilm x-t30 iii has barely launched – but you can already save money this black friday  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Fujifilm X-T30 III has barely launched – but you can already save money this Black Friday </b><br>This X-T30 III twin lens kit will get you started with Fujifilm’s latest beginner-friendly camera<br><a href=\"https://www.digitalcameraworld.com/cameras/the-fujifilm-x-t30-iii-has-barely-launched-but-you-can-already-save-money-this-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/the-fujifilm-x-t30-iii-has-barely-launched-but-you-can-already-save-money-this-black-friday",
    "topic": "photo",
    "date": "2025-11-28T16:41:08.000Z"
  },
  {
    "title": " The Nikon Z30 + 16-50mm kit lens has hit its lowest-ever price for Black Friday! ",
    "q": " the nikon z30 + 16-50mm kit lens has hit its lowest-ever price for black friday!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Nikon Z30 + 16-50mm kit lens has hit its lowest-ever price for Black Friday! </b><br>This cracking little camera comes with a cracking little lens and is available for a cracking low price!<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-nikon-z30-16-50mm-kit-lens-has-hit-its-lowest-ever-price-for-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-nikon-z30-16-50mm-kit-lens-has-hit-its-lowest-ever-price-for-black-friday",
    "topic": "photo",
    "date": "2025-11-28T16:40:08.000Z"
  },
  {
    "title": " This retro Fujifilm compact camera feels like film – but it's (usually) too expensive. A massive Black Friday discount has changed my mind ",
    "q": " this retro fujifilm compact camera feels like film – but it's (usually) too expensive. a massive black friday discount has changed my mind  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This retro Fujifilm compact camera feels like film – but it's (usually) too expensive. A massive Black Friday discount has changed my mind </b><br>You probably won’t find the Fujifilm X100VI on sale for Black Friday, but this tiny retro Fujifilm compact camera has just dropped to its lowest ever price<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/this-retro-fujifilm-compact-camera-feels-like-film-but-its-usually-too-expensive-a-massive-black-friday-discount-has-changed-my-mind\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/this-retro-fujifilm-compact-camera-feels-like-film-but-its-usually-too-expensive-a-massive-black-friday-discount-has-changed-my-mind",
    "topic": "photo",
    "date": "2025-11-28T13:58:05.000Z"
  },
  {
    "title": " Hate subscriptions? This Adobe Photoshop and Lightroom deal might change your mind, just £98.99 for the whole year!  ",
    "q": " hate subscriptions? this adobe photoshop and lightroom deal might change your mind, just £98.99 for the whole year!   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Hate subscriptions? This Adobe Photoshop and Lightroom deal might change your mind, just £98.99 for the whole year!  </b><br>Save over £150 off Adobe’s Photography Plan and get access to industry-standard photo editing software for an entire year<br><a href=\"https://www.digitalcameraworld.com/tech/software/hate-subscriptions-this-adobe-photoshop-and-lightroom-deal-might-change-your-mind-just-gbp98-99-for-the-whole-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/software/hate-subscriptions-this-adobe-photoshop-and-lightroom-deal-might-change-your-mind-just-gbp98-99-for-the-whole-year",
    "topic": "photo",
    "date": "2025-11-28T12:10:37.000Z"
  },
  {
    "title": " Kodak's secret weapon! Who needs a 200mm f/2 lens? This hidden camera feature changes your photography! Listen to Episode 5 of our Bokeh Face podcast ",
    "q": " kodak's secret weapon! who needs a 200mm f/2 lens? this hidden camera feature changes your photography! listen to episode 5 of our bokeh face podcast  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Kodak's secret weapon! Who needs a 200mm f/2 lens? This hidden camera feature changes your photography! Listen to Episode 5 of our Bokeh Face podcast </b><br>In our latest podcast, James and Chris talk Kodak's \"Pokémon camera\", Sigma's 200mm f/2 lens, and a tool that makes photography fun again<br><a href=\"https://www.digitalcameraworld.com/cameras/dcw-podcast-bokeh-face-5-kodaks-secret-weapon-who-needs-a-200mm-f-2-lens-the-hidden-feature-that-changes-your-photography\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/dcw-podcast-bokeh-face-5-kodaks-secret-weapon-who-needs-a-200mm-f-2-lens-the-hidden-feature-that-changes-your-photography",
    "topic": "photo",
    "date": "2025-11-28T12:00:00.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Best Memory Cards for Photographers",
    "q": "best memory cards for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Cards for Photographers</b><br>People tend to focus more on cameras and lenses when discussing camera gear. Those are exciting, fun purchases! However, once a new photographer find themselves out taking photos, the next piece of gear takes center stage, and becomes infi…<br><a href=\"https://www.slrlounge.com/best-memory-cards-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-cards-for-photographers/",
    "topic": "photo",
    "date": "2025-11-26T23:41:26.000Z"
  },
  {
    "title": "TourBox Elite Plus Review | A Versatile New Creative Controller",
    "q": "tourbox elite plus review | a versatile new creative controller camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>TourBox Elite Plus Review | A Versatile New Creative Controller</b><br>Over the last few years, we’ve seen an explosion of various innovations that streamline creative workflows. From photographers and illustrators to video editors and animators, everyone is looking for this combination: speed and precision. …<br><a href=\"https://www.slrlounge.com/tourbox-elite-plus-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tourbox-elite-plus-review/",
    "topic": "photo",
    "date": "2025-11-26T16:00:00.000Z"
  },
  {
    "title": "DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools",
    "q": "dxo’s black friday deals take up to 50% off flagship photo editing tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools</b><br>DxO is rolling out its annual Black Friday sale with significant discounts across its full software lineup, offering up to 50% off both new licenses and upgrades. The promotion runs from November 18 through December 2, 2025. The sale spans…<br><a href=\"https://www.slrlounge.com/dxo-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-26T13:00:26.000Z"
  },
  {
    "title": "Best Booking Apps for Photographers",
    "q": "best booking apps for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Booking Apps for Photographers</b><br>As a photographer, managing your bookings and scheduling is an important but time consuming task that can detract from your productivity and workflow. However, with the increasing availability of scheduling and booking software and apps, m…<br><a href=\"https://www.slrlounge.com/best-booking-apps-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-booking-apps-for-photographers/",
    "topic": "photo",
    "date": "2025-11-25T23:34:28.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "Apple&#8217;s most affordable iPad is over 20 percent off for Black Friday",
    "q": "apple&#8217;s most affordable ipad is over 20 percent off for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple&#8217;s most affordable iPad is over 20 percent off for Black Friday</b><br>The base configuration 11th-gen iPad with Wi-Fi and 128GB of storage is $75 off. For Black Friday, we’re seeing some of the best prices all year on AirPods, AirTags, and other Apple gear. And if you’ve been eyeing a tablet for streaming, b…<br><a href=\"https://www.theverge.com/gadgets/832251/apple-ipad-air-mini-pro-black-friday-deal-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/832251/apple-ipad-air-mini-pro-black-friday-deal-sale-2025",
    "topic": "it",
    "date": "2025-11-28T18:02:20.000Z"
  },
  {
    "title": "The best earbuds we’ve tested for 2025",
    "q": "the best earbuds we’ve tested for 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best earbuds we’ve tested for 2025</b><br>Editor’s note: Black Friday has begun, and we’re covering the biggest and best deals you can get. It’s hard to buy a bad pair of wireless earbuds these days, and with constant discounts and deals wherever you look, now is as good a time as…<br><a href=\"https://www.theverge.com/21309820/best-wireless-earbuds\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21309820/best-wireless-earbuds",
    "topic": "it",
    "date": "2025-11-28T17:49:08.000Z"
  },
  {
    "title": "The best robot vacuums",
    "q": "the best robot vacuums windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best robot vacuums</b><br>Editor’s note: Lots of our favorite robovacs in this piece are on sale for Black Friday! Check out the biggest and best Black Friday deals we’ve covered so far. Robot vacuums are impressive devices that will clean your floors well and — th…<br><a href=\"https://www.theverge.com/22997597/best-robot-vacuum-cleaner\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22997597/best-robot-vacuum-cleaner",
    "topic": "it",
    "date": "2025-11-28T17:19:32.000Z"
  },
  {
    "title": "Black Friday deals on chargers and power banks we love from Anker and more",
    "q": "black friday deals on chargers and power banks we love from anker and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Black Friday deals on chargers and power banks we love from Anker and more</b><br>Twelve South’s HiRise 3 Deluxe is on sale for $59.99. We all know Black Friday is one of — if not the — best time to save hundreds on a laptop or big screen TV, but you shouldn’t forget about taking advantage of deals on lower-priced essen…<br><a href=\"https://www.theverge.com/gadgets/831598/black-friday-2025-chargers-power-banks-batteries-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/831598/black-friday-2025-chargers-power-banks-batteries-deal-sale",
    "topic": "it",
    "date": "2025-11-28T17:15:00.000Z"
  },
  {
    "title": "The best Black Friday deals on AirPods, AirTags, and other Apple gear",
    "q": "the best black friday deals on airpods, airtags, and other apple gear windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Black Friday deals on AirPods, AirTags, and other Apple gear</b><br>Apple’s latest AirPods Pro are down to their best price to date. If you’re planning to gift an Apple device this holiday season — or treat yourself — now’s the time to start shopping. Black Friday has officially arrived, bringing with it t…<br><a href=\"https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025",
    "topic": "it",
    "date": "2025-11-28T17:11:18.000Z"
  },
  {
    "title": "These Lego kits for kids and adults are up to 50% off for Black Friday",
    "q": "these lego kits for kids and adults are up to 50% off for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These Lego kits for kids and adults are up to 50% off for Black Friday</b><br>One of the best activities for the holiday season — especially if the weather is keeping you indoors — is to build yourself a Lego vehicle, scene, or animal. There are several on sale for Black Friday, suitable for kids or adults — here ar…<br><a href=\"https://www.theverge.com/gadgets/831898/these-lego-kits-for-kids-and-adults-are-up-to-50-off-for-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/831898/these-lego-kits-for-kids-and-adults-are-up-to-50-off-for-black-friday",
    "topic": "it",
    "date": "2025-11-28T17:03:25.000Z"
  },
  {
    "title": "We found the 100+ best Black Friday deals live now up to 75% off from Amazon, Walmart, Target & more",
    "q": "we found the 100+ best black friday deals live now up to 75% off from amazon, walmart, target & more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>We found the 100+ best Black Friday deals live now up to 75% off from Amazon, Walmart, Target & more</b><br>Black Friday sales have arrived, and nearly every major retailer is offering big discounts on items from LG, Apple, Garmin, Samsung, and far more.<br><a href=\"https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-28/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-28/",
    "topic": "it",
    "date": "2025-11-28T17:52:13.000Z"
  },
  {
    "title": "How to manage your Linux firewall the easy way - without touching the terminal",
    "q": "how to manage your linux firewall the easy way - without touching the terminal windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How to manage your Linux firewall the easy way - without touching the terminal</b><br>Securing your Linux desktop is straightforward when you let these GUIs handle all the work.<br><a href=\"https://www.zdnet.com/article/how-to-manage-your-linux-firewall-the-easy-way-without-touching-the-terminal/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/how-to-manage-your-linux-firewall-the-easy-way-without-touching-the-terminal/",
    "topic": "it",
    "date": "2025-11-28T17:31:31.000Z"
  },
  {
    "title": " I thought $4,000 laptops were untouchable — then I saw HP’s ProBook 4 G1i drop to $1,199 this Black Friday (70% off). Biggest laptop sale of 2025? ",
    "q": " i thought $4,000 laptops were untouchable — then i saw hp’s probook 4 g1i drop to $1,199 this black friday (70% off). biggest laptop sale of 2025?  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> I thought $4,000 laptops were untouchable — then I saw HP’s ProBook 4 G1i drop to $1,199 this Black Friday (70% off). Biggest laptop sale of 2025? </b><br>HP's ProBook 4 G1i is a professional grade laptop that's usually priced well above what I'd normally consider when buying a new PC, but thanks to Black Friday, it's now cheaper than a new MacBook Pro.<br><a href=\"https://www.windowscentral.com/hardware/hp/i-thought-usd4-000-laptops-were-untouchable-then-i-saw-hps-probook-4-g1i-drop-to-usd1-199-this-black-friday-70-percent-off-biggest-laptop-sale-of-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/hp/i-thought-usd4-000-laptops-were-untouchable-then-i-saw-hps-probook-4-g1i-drop-to-usd1-199-this-black-friday-70-percent-off-biggest-laptop-sale-of-2025",
    "topic": "it",
    "date": "2025-11-28T18:14:05.000Z"
  },
  {
    "title": " Unbeatable VR value — This Meta Quest 3S Black Friday discount makes it an essential Xbox Cloud Gaming companion ",
    "q": " unbeatable vr value — this meta quest 3s black friday discount makes it an essential xbox cloud gaming companion  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Unbeatable VR value — This Meta Quest 3S Black Friday discount makes it an essential Xbox Cloud Gaming companion </b><br>At $249, the Meta Quest 3S is an incredible Black Friday bargain, offering a premium VR experience and seamless integration with Xbox Cloud Gaming and Windows 11.<br><a href=\"https://www.windowscentral.com/hardware/virtual-reality/unbeatable-vr-value-this-meta-quest-3s-black-friday-discount-makes-it-an-essential-xbox-cloud-gaming-companion\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/virtual-reality/unbeatable-vr-value-this-meta-quest-3s-black-friday-discount-makes-it-an-essential-xbox-cloud-gaming-companion",
    "topic": "it",
    "date": "2025-11-28T15:53:06.000Z"
  },
  {
    "title": " Now might be the time to jump into Dying Light: The Beast — Update 1.4 adds New Game+ and hundreds of fixes ",
    "q": " now might be the time to jump into dying light: the beast — update 1.4 adds new game+ and hundreds of fixes  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Now might be the time to jump into Dying Light: The Beast — Update 1.4 adds New Game+ and hundreds of fixes </b><br>Update 1.4 adds New Game+, restores Legend Levels, introduces ray tracing, and delivers more than 400 improvements across gameplay, visuals, and performance.<br><a href=\"https://www.windowscentral.com/gaming/now-might-be-the-time-to-jump-into-dying-light-the-beast-update-1-4\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/now-might-be-the-time-to-jump-into-dying-light-the-beast-update-1-4",
    "topic": "it",
    "date": "2025-11-28T14:04:00.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "Public GitLab repositories exposed more than 17,000 secrets",
    "q": "public gitlab repositories exposed more than 17,000 secrets windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Public GitLab repositories exposed more than 17,000 secrets</b><br>After scanning all 5.6 million public repositories on GitLab Cloud, a security engineer discovered more than 17,000 exposed secrets across over 2,800 unique domains. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/",
    "topic": "it",
    "date": "2025-11-28T17:43:02.000Z"
  },
  {
    "title": "NordVPN Black Friday Deal: Unlock 77% off VPN plans in 2025",
    "q": "nordvpn black friday deal: unlock 77% off vpn plans in 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>NordVPN Black Friday Deal: Unlock 77% off VPN plans in 2025</b><br>The NordVPN Black Friday Deal is now live, and you can get the best discount available: 77% off that applies automatically when you follow our link. If you've been waiting for the right moment to upgrade your online security, privacy, and …<br><a href=\"https://www.bleepingcomputer.com/news/security/nordvpn-black-friday-deal-unlock-77-percent-off-vpn-plans-in-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/nordvpn-black-friday-deal-unlock-77-percent-off-vpn-plans-in-2025/",
    "topic": "it",
    "date": "2025-11-26T20:00:37.000Z"
  },
  {
    "title": "Ditch subscriptions with Botslab's home security discounts this Black Friday",
    "q": "ditch subscriptions with botslab's home security discounts this black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Ditch subscriptions with Botslab's home security discounts this Black Friday</b><br>This article is sponsored by Botslab<br><a href=\"https://www.howtogeek.com/ditch-subscriptions-with-the-botslab-home-security-discounts-this-black-friday/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/ditch-subscriptions-with-the-botslab-home-security-discounts-this-black-friday/",
    "topic": "it",
    "date": "2025-11-28T16:53:59.000Z"
  },
  {
    "title": "6 Linux terminal habits I wish I learned years ago",
    "q": "6 linux terminal habits i wish i learned years ago windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>6 Linux terminal habits I wish I learned years ago</b><br>These neat tricks make my Linux experiments a lot easier<br><a href=\"https://www.xda-developers.com/linux-terminal-habits-i-wish-i-learned-years-ago/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/linux-terminal-habits-i-wish-i-learned-years-ago/",
    "topic": "it",
    "date": "2025-11-28T17:01:17.000Z"
  },
  {
    "title": "I doubled my SSD endurance by changing these Windows settings",
    "q": "i doubled my ssd endurance by changing these windows settings windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I doubled my SSD endurance by changing these Windows settings</b><br>A few quick changes and you can heavily decrease your SSD's load<br><a href=\"https://www.xda-developers.com/i-doubled-my-ssd-endurance-by-changing-these-windows-settings/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/i-doubled-my-ssd-endurance-by-changing-these-windows-settings/",
    "topic": "it",
    "date": "2025-11-28T16:00:17.000Z"
  }
]