[
  {
    "title": "Kodak Apparel Opens Pop Up Store in Hong Kong",
    "q": "kodak apparel opens pop up store in hong kong camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Kodak Apparel Opens Pop Up Store in Hong Kong</b><br>Kodak has found success licensing its brand to fashion and technology retailers. Notably the Kodak Charmera, a tiny keychain camera made by Reto, was in demand last year. [Read More]<br><a href=\"https://petapixel.com/2026/01/28/kodak-apparel-opens-pop-up-store-in-hong-kong/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/28/kodak-apparel-opens-pop-up-store-in-hong-kong/",
    "topic": "photo",
    "date": "2026-01-28T12:13:54.000Z"
  },
  {
    "title": "Trail Camera Captures Grizzly Bear in Area That Hasn’t Had Confirmed Sighting for 50 Years",
    "q": "trail camera captures grizzly bear in area that hasn’t had confirmed sighting for 50 years camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Trail Camera Captures Grizzly Bear in Area That Hasn’t Had Confirmed Sighting for 50 Years</b><br>A trail camera captured a grizzly bear walking in the Bangtail Mountains of Montana -- the first official documentation of a grizzly since modern recovery efforts began 50 years ago. [Read More]<br><a href=\"https://petapixel.com/2026/01/28/trail-camera-captures-grizzly-bear-in-area-that-hasnt-had-confirmed-sighting-for-50-years/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/28/trail-camera-captures-grizzly-bear-in-area-that-hasnt-had-confirmed-sighting-for-50-years/",
    "topic": "photo",
    "date": "2026-01-28T11:30:05.000Z"
  },
  {
    "title": "Apple Sued by App Developer Over its Continuity Camera",
    "q": "apple sued by app developer over its continuity camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple Sued by App Developer Over its Continuity Camera</b><br>Apple is being sued by Reincubate, which makes the Camo smartphone webcam app. It has filed a lawsuit against Apple in a U.S. federal court in New Jersey, accusing the company of anticompetitive conduct and patent infringement. [Read More]<br><a href=\"https://petapixel.com/2026/01/28/apple-sued-by-app-developer-over-its-continuity-camera/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/28/apple-sued-by-app-developer-over-its-continuity-camera/",
    "topic": "photo",
    "date": "2026-01-28T10:58:13.000Z"
  },
  {
    "title": "Brightin Star’s New $180 60mm f/2.8 Macro Lens Offers 2:1 Magnification",
    "q": "brightin star’s new $180 60mm f/2.8 macro lens offers 2:1 magnification camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Brightin Star’s New $180 60mm f/2.8 Macro Lens Offers 2:1 Magnification</b><br>Brightin Star has announced the MF 60mm f/2.8 APS-C Macro Lens, a versatile manual-focus prime designed primarily for APS-C mirrorless cameras. [Read More]<br><a href=\"https://petapixel.com/2026/01/27/brightin-stars-new-180-60mm-f-2-8-macro-lens-offers-21-magnification/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/27/brightin-stars-new-180-60mm-f-2-8-macro-lens-offers-21-magnification/",
    "topic": "photo",
    "date": "2026-01-27T19:45:14.000Z"
  },
  {
    "title": "Photoshop Update Adds Popular Camera Raw Tools As Adjustment Layers",
    "q": "photoshop update adds popular camera raw tools as adjustment layers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photoshop Update Adds Popular Camera Raw Tools As Adjustment Layers</b><br>Adobe has released Photoshop 27.2, introducing new tools for visual artists, including new adjustment layers designed for photographers and improvements to Adobe Firefly features and performance inside Photoshop. [Read More]<br><a href=\"https://petapixel.com/2026/01/27/photoshop-update-adds-popular-camera-raw-tools-as-adjustment-layers/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/27/photoshop-update-adds-popular-camera-raw-tools-as-adjustment-layers/",
    "topic": "photo",
    "date": "2026-01-27T18:16:05.000Z"
  },
  {
    "title": "Glyph Atom EX40 SSD Review: Excellent Performance",
    "q": "glyph atom ex40 ssd review: excellent performance camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Glyph Atom EX40 SSD Review: Excellent Performance</b><br>Earlier this year, memory brand Glyph debuted its new Atom EX SSDs with a specific focus on serving content creators. With Sandisk still refusing to publicly acknowledge the problems with its compact SSDs, I was pretty happy to see another…<br><a href=\"https://petapixel.com/2026/01/27/glyph-atom-ex40-ssd-review-excellent-performance/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/27/glyph-atom-ex40-ssd-review-excellent-performance/",
    "topic": "photo",
    "date": "2026-01-27T17:03:04.000Z"
  },
  {
    "title": "Canon EOS C50 Receives Netflix’s Seal of Approval",
    "q": "canon eos c50 receives netflix’s seal of approval camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS C50 Receives Netflix’s Seal of Approval</b><br>The Fujifilm GFX Eterna 55 isn't the only recently released video camera to receive important industry certification. The Canon EOS C50, released last year, is now Netflix-approved. [Read More]<br><a href=\"https://petapixel.com/2026/01/27/canon-eos-c50-receives-netflixs-seal-of-approval/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/27/canon-eos-c50-receives-netflixs-seal-of-approval/",
    "topic": "photo",
    "date": "2026-01-27T16:59:19.000Z"
  },
  {
    "title": "These 10 Up-and-Comers Are Vying to Be ‘Youth Photographer of the Year’",
    "q": "these 10 up-and-comers are vying to be ‘youth photographer of the year’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>These 10 Up-and-Comers Are Vying to Be ‘Youth Photographer of the Year’</b><br>Alongside the shortlisted Student photographers, the Sony World Photography Awards also announced the 10 Youth photographers who are vying to be named Youth Photographer of the Year in the Sony World Photography Awards 2026. These 10 photo…<br><a href=\"https://petapixel.com/2026/01/27/these-10-up-and-comers-are-vying-to-be-youth-photographer-of-the-year/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/27/these-10-up-and-comers-are-vying-to-be-youth-photographer-of-the-year/",
    "topic": "photo",
    "date": "2026-01-27T15:36:58.000Z"
  },
  {
    "title": "One of These 10 Students Will Win the 2026 Sony World Photography Awards",
    "q": "one of these 10 students will win the 2026 sony world photography awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>One of These 10 Students Will Win the 2026 Sony World Photography Awards</b><br>The Sony World Photography Awards has unveiled the shortlisted photos in its 2026 Student competition. The shortlisted projects showcase the exceptional photographic talent of the next generation of photographers. [Read More]<br><a href=\"https://petapixel.com/2026/01/27/one-of-these-10-students-will-win-the-2026-sony-world-photography-awards/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/27/one-of-these-10-students-will-win-the-2026-sony-world-photography-awards/",
    "topic": "photo",
    "date": "2026-01-27T15:36:29.000Z"
  },
  {
    "title": "How I've used photography as an outlet when words aren't enough",
    "q": "how i've used photography as an outlet when words aren't enough camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How I've used photography as an outlet when words aren't enough</b><br>I created this image while I was working full-time, applying to far too many graduate schools and navigating a long-distance relationship. Photo: Abby Ferguson It's well established that photography is a superb tool for documentation purpo…<br><a href=\"https://www.dpreview.com/opinion/5588849061/how-i-ve-used-photography-as-an-outlet-when-words-aren-t-enough\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/opinion/5588849061/how-i-ve-used-photography-as-an-outlet-when-words-aren-t-enough",
    "topic": "photo",
    "date": "2026-01-27T16:30:00.000Z"
  },
  {
    "title": "Photoshop's latest update adds new adjustment layers and trials text tools",
    "q": "photoshop's latest update adds new adjustment layers and trials text tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photoshop's latest update adds new adjustment layers and trials text tools</b><br>Image: Adobe Adobe has announced an update to Photoshop that brings new types of adjustment layers and improves generative AI-powered fill tools. It's also adding a feature in beta that makes it easier to manipulate text into certain shape…<br><a href=\"https://www.dpreview.com/news/3036390848/adobe-photoshop-update-jan-26-adjustment-layers\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3036390848/adobe-photoshop-update-jan-26-adjustment-layers",
    "topic": "photo",
    "date": "2026-01-27T14:00:00.000Z"
  },
  {
    "title": "The Nikon ZR gets its first firmware update",
    "q": "the nikon zr gets its first firmware update camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Nikon ZR gets its first firmware update</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Nikon Nikon has announced firmware V1.10 for the ZR camera, heralding the first update for the video-focused camera. Given that it comes only a few months …<br><a href=\"https://www.dpreview.com/news/1800777439/nikon-zr-video-camera-firmware-update-v1p10\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/1800777439/nikon-zr-video-camera-firmware-update-v1p10",
    "topic": "photo",
    "date": "2026-01-27T04:01:00.000Z"
  },
  {
    "title": "Photographing Mongolia in winter: part 2",
    "q": "photographing mongolia in winter: part 2 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Mongolia in winter: part 2</b><br>DJI Mavic 3 Classic | 24mm F2.8 | ISO 100 | 1/320 sec | F5.6 Photo: Erez Marom In part one of my series about photographing Mongolia in winter, I wrote about my experience shooting the Khongor Sand Dunes and Lake Khuvsgul. This time, I'd l…<br><a href=\"https://www.dpreview.com/articles/1273132880/photographing-mongolia-in-winter-part-2\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1273132880/photographing-mongolia-in-winter-part-2",
    "topic": "photo",
    "date": "2026-01-26T14:00:00.000Z"
  },
  {
    "title": "\"Throwing my camera was the right thing to do\": The photographers behind the viral protest photos",
    "q": "\"throwing my camera was the right thing to do\": the photographers behind the viral protest photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>\"Throwing my camera was the right thing to do\": The photographers behind the viral protest photos</b><br>The photo John Abernathy took, showing his point of view as he was being surrounded by ICE officers, right before he threw his camera to another photographer. Photo: John Abernathy | Instagram: @john_abernathy_ By now, you've probably seen…<br><a href=\"https://www.dpreview.com/interviews/6336791578/john-abernathy-pierre-lavie-protest-photographers-ice-minneapolis-thrown-leica\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/interviews/6336791578/john-abernathy-pierre-lavie-protest-photographers-ice-minneapolis-thrown-leica",
    "topic": "photo",
    "date": "2026-01-25T14:00:00.000Z"
  },
  {
    "title": "The DPReview team discusses the Ricoh GR IV Monochrome and Instax Mini Evo Cinema",
    "q": "the dpreview team discusses the ricoh gr iv monochrome and instax mini evo cinema camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The DPReview team discusses the Ricoh GR IV Monochrome and Instax Mini Evo Cinema</b><br>When you use DPReview links to buy products, the site may earn a commission. We're back with the first episode of the DPReview team discussions show of the new year, and just in time. The first few weeks of the year have been relatively bu…<br><a href=\"https://www.dpreview.com/videos/7450856544/dpreview-team-discussions-ricoh-gr-iv-monochrome-instax-mini-evo-cinema\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/videos/7450856544/dpreview-team-discussions-ricoh-gr-iv-monochrome-instax-mini-evo-cinema",
    "topic": "photo",
    "date": "2026-01-24T14:00:00.000Z"
  },
  {
    "title": "Why bad photos matter more than you think",
    "q": "why bad photos matter more than you think camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Why bad photos matter more than you think</b><br>This image from last year could have potential, but the composition just isn't very good in my opinion. Photo: Abby Ferguson I’ve been thinking a lot about growth in photography lately, especially how projects and challenges can push creat…<br><a href=\"https://www.dpreview.com/opinion/4526761561/why-bad-photos-matter-more-than-you-think\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/opinion/4526761561/why-bad-photos-matter-more-than-you-think",
    "topic": "photo",
    "date": "2026-01-23T14:00:00.000Z"
  },
  {
    "title": "Leica M11-P studio scene: the rangefinder with resolution",
    "q": "leica m11-p studio scene: the rangefinder with resolution camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Leica M11-P studio scene: the rangefinder with resolution</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We recently got the opportunity to get a Leica M11-P (which is, at its heart, the same as the M11, M11-D and M EV1) in front of our studio s…<br><a href=\"https://www.dpreview.com/articles/1527407398/leica-m11-p-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1527407398/leica-m11-p-studio-scene",
    "topic": "photo",
    "date": "2026-01-22T14:00:00.000Z"
  },
  {
    "title": "These are the photo projects that have kept you inspired and learning",
    "q": "these are the photo projects that have kept you inspired and learning camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>These are the photo projects that have kept you inspired and learning</b><br>Photo: Community member NiVoak For our most recent Question of the Week, we asked about a topic that's near and dear to my heart: photography projects. We wondered what projects you are taking on to spark creativity and move your photograp…<br><a href=\"https://www.dpreview.com/articles/8158109343/these-are-the-photo-projects-that-have-kept-you-inspired-and-learning\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8158109343/these-are-the-photo-projects-that-have-kept-you-inspired-and-learning",
    "topic": "photo",
    "date": "2026-01-21T16:46:00.000Z"
  },
  {
    "title": "Nikon focuses on licensees as it files patent case against Viltrox",
    "q": "nikon focuses on licensees as it files patent case against viltrox camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon focuses on licensees as it files patent case against Viltrox</b><br>Viltrox has released a range of high-end lenses for Nikon Z-mount, including the 85mm F1.4 Pro. These appear to have been released without a license from Nikon. Photo: Viltrox Nikon has responded to reports of it taking legal action agains…<br><a href=\"https://www.dpreview.com/news/0506855771/nikon-viltrox-patent-battle\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0506855771/nikon-viltrox-patent-battle",
    "topic": "photo",
    "date": "2026-01-21T00:02:00.000Z"
  },
  {
    "title": " This Canon DSLR dominates Amazon US & UK best-seller lists – with multiple kit options and new bodies available from $529 or £285.50 ",
    "q": " this canon dslr dominates amazon us & uk best-seller lists – with multiple kit options and new bodies available from $529 or £285.50  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This Canon DSLR dominates Amazon US & UK best-seller lists – with multiple kit options and new bodies available from $529 or £285.50 </b><br>Available in multiple kits with lenses and accessories, this entry-level DSLR holds most top 10 spots on Amazon US and UK for a good reason<br><a href=\"https://www.digitalcameraworld.com/cameras/dslr-cameras/this-canon-dslr-dominates-amazon-us-and-uk-best-seller-lists-with-multiple-kit-options-and-new-bodies-available-from-usd529-or-gbp285-50\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/dslr-cameras/this-canon-dslr-dominates-amazon-us-and-uk-best-seller-lists-with-multiple-kit-options-and-new-bodies-available-from-usd529-or-gbp285-50",
    "topic": "photo",
    "date": "2026-01-28T11:29:45.000Z"
  },
  {
    "title": " The Virtual Photographer of the Year 2025 has been announced and I’m impressed by the winner's video game stills! ",
    "q": " the virtual photographer of the year 2025 has been announced and i’m impressed by the winner's video game stills!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Virtual Photographer of the Year 2025 has been announced and I’m impressed by the winner's video game stills! </b><br>The best stills captured during video game play in 2025 have been revealed ranging from dystopian cityscapes to evocative portraits<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/the-virtual-photographer-of-the-year-2025-has-been-announced-and-im-impressed-with-the-winners-video-game-stills\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/the-virtual-photographer-of-the-year-2025-has-been-announced-and-im-impressed-with-the-winners-video-game-stills",
    "topic": "photo",
    "date": "2026-01-28T10:10:00.000Z"
  },
  {
    "title": " I’m a Nikon photographer, you don’t have to go third party to get cheap lenses for your Z-system camera ",
    "q": " i’m a nikon photographer, you don’t have to go third party to get cheap lenses for your z-system camera  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I’m a Nikon photographer, you don’t have to go third party to get cheap lenses for your Z-system camera </b><br>Cheap third-party lenses are great for the consumer, but don’t automatically assume that cheap Nikon-branded lenses don’t exist<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/im-a-nikon-photographer-you-dont-have-to-go-third-party-to-get-cheap-lenses-for-your-z-system-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/im-a-nikon-photographer-you-dont-have-to-go-third-party-to-get-cheap-lenses-for-your-z-system-camera",
    "topic": "photo",
    "date": "2026-01-28T09:59:09.000Z"
  },
  {
    "title": " Just days after days launch, Ricoh's monochrome compact camera faces stock shortages in Europe. Are US and UK next?  ",
    "q": " just days after days launch, ricoh's monochrome compact camera faces stock shortages in europe. are us and uk next?   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Just days after days launch, Ricoh's monochrome compact camera faces stock shortages in Europe. Are US and UK next?  </b><br>\"Limited stock, deliveries affected until March\" – new Ricoh GR IV Monochrome is selling fast, making pre-orders essential<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/just-days-after-days-launch-ricohs-monochrome-compact-camera-faces-stock-shortages-in-europe-are-us-and-uk-next\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/just-days-after-days-launch-ricohs-monochrome-compact-camera-faces-stock-shortages-in-europe-are-us-and-uk-next",
    "topic": "photo",
    "date": "2026-01-28T09:50:00.000Z"
  },
  {
    "title": " This camera company now ranks among the top one percent for global sustainability  ",
    "q": " this camera company now ranks among the top one percent for global sustainability   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This camera company now ranks among the top one percent for global sustainability  </b><br>Canon has just received an EcoVadis Platinum ranking, which places it among the top one percent of assessed companies<br><a href=\"https://www.digitalcameraworld.com/cameras/this-camera-company-now-ranks-among-the-top-one-percent-for-global-sustainability\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/this-camera-company-now-ranks-among-the-top-one-percent-for-global-sustainability",
    "topic": "photo",
    "date": "2026-01-28T08:45:00.000Z"
  },
  {
    "title": " Nikon’s Z system is more attractive WITH Viltrox lenses, but first-party manufacturers should be compensated accordingly   ",
    "q": " nikon’s z system is more attractive with viltrox lenses, but first-party manufacturers should be compensated accordingly    camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Nikon’s Z system is more attractive WITH Viltrox lenses, but first-party manufacturers should be compensated accordingly   </b><br>I see Viltrox’s Z lenses as an incentive for those on a budget to buy a Nikon mirrorless camera, but I do think the ‘Big N’ deserves its dues for the mount it spent time and money developing<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/nikons-z-system-is-more-attractive-with-viltrox-lenses-but-first-party-manufacturers-should-be-compensated-accordingly\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/nikons-z-system-is-more-attractive-with-viltrox-lenses-but-first-party-manufacturers-should-be-compensated-accordingly",
    "topic": "photo",
    "date": "2026-01-28T08:37:57.000Z"
  },
  {
    "title": " Yes, this is a photo – and it just won an award:  a mind-blowing aerial shot of Iceland reveals nature's art at its best ",
    "q": " yes, this is a photo – and it just won an award:  a mind-blowing aerial shot of iceland reveals nature's art at its best  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Yes, this is a photo – and it just won an award:  a mind-blowing aerial shot of Iceland reveals nature's art at its best </b><br>This aerial photograph blurs the line between fine art and documentary photography, and it has taken top honors in AAP Magazine's international competition<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/yes-this-is-a-photo-and-it-just-won-an-award-a-mind-blowing-aerial-shot-of-iceland-reveals-natures-art-at-its-best\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/yes-this-is-a-photo-and-it-just-won-an-award-a-mind-blowing-aerial-shot-of-iceland-reveals-natures-art-at-its-best",
    "topic": "photo",
    "date": "2026-01-28T08:00:00.000Z"
  },
  {
    "title": " My hidden Photoshop tool that gives your photos a cinematic look in seconds ",
    "q": " my hidden photoshop tool that gives your photos a cinematic look in seconds  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> My hidden Photoshop tool that gives your photos a cinematic look in seconds </b><br>I think you’ve been using Photoshop all wrong if you aren’t making your own LUTs!<br><a href=\"https://www.digitalcameraworld.com/tech/software/my-hidden-photoshop-tool-that-gives-your-photos-a-cinematic-look-in-seconds\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/software/my-hidden-photoshop-tool-that-gives-your-photos-a-cinematic-look-in-seconds",
    "topic": "photo",
    "date": "2026-01-28T06:32:20.000Z"
  },
  {
    "title": " Trends revived the point-and-shoot from the dead. But what about the superzoom bridge camera? ",
    "q": " trends revived the point-and-shoot from the dead. but what about the superzoom bridge camera?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Trends revived the point-and-shoot from the dead. But what about the superzoom bridge camera? </b><br>The point-and-shoot is back! But, its bulky sibling, the bridge camera, hasn't fared as well<br><a href=\"https://www.digitalcameraworld.com/cameras/bridge-cameras/trends-revived-the-point-and-shoot-from-the-dead-but-what-about-the-superzoom-bridge-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/bridge-cameras/trends-revived-the-point-and-shoot-from-the-dead-but-what-about-the-superzoom-bridge-camera",
    "topic": "photo",
    "date": "2026-01-27T20:14:00.000Z"
  },
  {
    "title": "Forest Photography Tips & Guide for Better Photos",
    "q": "forest photography tips & guide for better photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Forest Photography Tips & Guide for Better Photos</b><br>Forest photography offers a unique creative challenge: capturing the interplay of light filtering through canopies, the textures of ancient bark, and the mood that only woodlands can provide. Whether you’re drawn to misty morning scenes, d…<br><a href=\"https://www.slrlounge.com/forest-photography-tips-guide-for-better-photos/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/forest-photography-tips-guide-for-better-photos/",
    "topic": "photo",
    "date": "2026-01-28T00:33:30.000Z"
  },
  {
    "title": "PPI vs DPI: What’s the Difference and Why It Matters to Photographers",
    "q": "ppi vs dpi: what’s the difference and why it matters to photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PPI vs DPI: What’s the Difference and Why It Matters to Photographers</b><br>PPI and DPI are both very important terms for any photographer who wants to display their images as beautifully as possible.<br><a href=\"https://www.slrlounge.com/ppi-vs-dpi/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/ppi-vs-dpi/",
    "topic": "photo",
    "date": "2026-01-27T00:34:28.000Z"
  },
  {
    "title": "Your Guide to Wedding Poses For Grooms",
    "q": "your guide to wedding poses for grooms camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Your Guide to Wedding Poses For Grooms</b><br>On a couple’s wedding day, brides are usually the show-stoppers, receiving the most pampering while preparing for the big day in order to take her groom and guests’ breath away when they get to see her. Photographers often think of a weddi…<br><a href=\"https://www.slrlounge.com/wedding-photography-posing-tips-posing-the-groom/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/wedding-photography-posing-tips-posing-the-groom/",
    "topic": "photo",
    "date": "2026-01-25T00:30:29.000Z"
  },
  {
    "title": "5 Responsibilities of a Photography Lighting Assistant",
    "q": "5 responsibilities of a photography lighting assistant camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>5 Responsibilities of a Photography Lighting Assistant</b><br>While being a lighting assistant doesn't require a specific skill set, the job does go beyond simply carrying equipment and following instructions. Here are some tips to make you a better photography lighting assistant.<br><a href=\"https://www.slrlounge.com/5-responsibilities-of-photography-lighting-assistants/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/5-responsibilities-of-photography-lighting-assistants/",
    "topic": "photo",
    "date": "2026-01-24T00:26:31.000Z"
  },
  {
    "title": "Wedding Ring Photography Tips and Inspiration For You To Try",
    "q": "wedding ring photography tips and inspiration for you to try camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Wedding Ring Photography Tips and Inspiration For You To Try</b><br>Wedding ring photography is an important aspect of wedding photography. Besides the fact that clients pay a whole lot of cash for them, they’re important because of their significance as a symbol of their union. Getting incredible wedding …<br><a href=\"https://www.slrlounge.com/wedding-rings-pictures/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/wedding-rings-pictures/",
    "topic": "photo",
    "date": "2026-01-22T20:55:28.000Z"
  },
  {
    "title": "What Is a Fixed Focal Length Lens? Benefits of Shooting with Primes",
    "q": "what is a fixed focal length lens? benefits of shooting with primes camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What Is a Fixed Focal Length Lens? Benefits of Shooting with Primes</b><br>As a portrait photographer, your lens choice is extremely important when it comes to your growth as a photographer. There’s a misconception among new photographers that zoom lenses are the way to go. Take a look at 3 reasons why you may wa…<br><a href=\"https://www.slrlounge.com/3-benefits-of-a-fixed-focal-length/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-benefits-of-a-fixed-focal-length/",
    "topic": "photo",
    "date": "2026-01-22T18:51:32.000Z"
  },
  {
    "title": "Clarity, Dehaze & Grain adjustment layers now in Photoshop",
    "q": "clarity, dehaze & grain adjustment layers now in photoshop camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Clarity, Dehaze & Grain adjustment layers now in Photoshop</b><br>Clarity, Dehaze and Grain effects in Lightroom and Camera Raw are my go-to tools. Now they are available as adjustment layers in Photoshop. New adjustment layers Clarity and Dehaze, and Grain bring powerful non-destructive, maskable, layer…<br><a href=\"https://photofocus.com/software/clarity-dehaze-grain-adjustment-layers-now-in-photoshop/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/clarity-dehaze-grain-adjustment-layers-now-in-photoshop/",
    "topic": "photo",
    "date": "2026-01-27T15:21:10.000Z"
  },
  {
    "title": "Godox announces new All-in-One AD800Pro Flash",
    "q": "godox announces new all-in-one ad800pro flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox announces new All-in-One AD800Pro Flash</b><br>Reliable 800Ws Power for Demanding Location Shoots Godox has announced the AD800Pro, a powerful 800Ws battery-powered monolight designed for photographers who need dependable main-light performance on location. Built to handle bright outdo…<br><a href=\"https://photofocus.com/news/godox-announces-new-all-in-one-ad800pro-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-announces-new-all-in-one-ad800pro-flash/",
    "topic": "photo",
    "date": "2026-01-23T03:20:28.000Z"
  },
  {
    "title": "SmallRig x Potato Jet TRIBEX SE Tripod Review",
    "q": "smallrig x potato jet tribex se tripod review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>SmallRig x Potato Jet TRIBEX SE Tripod Review</b><br>A fast, field-ready tripod built for landscape and hybrid shooters Let’s clear this up right from the start.The SmallRig x Potato Jet TRIBEX SE is not a studio portrait, product or still life tripod. It isn’t trying to be, and judging it b…<br><a href=\"https://photofocus.com/reviews/smallrig-x-potato-jet-tribex-se-tripod-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/smallrig-x-potato-jet-tribex-se-tripod-review/",
    "topic": "photo",
    "date": "2026-01-21T13:30:00.000Z"
  },
  {
    "title": "Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits ",
    "q": "creative color shifts | using nik collection’s color efex for dramatic portraits  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits </b><br>Explore creative colour shifts in still life photography using Nik Collection’s Color Efex Pro. In this video, I show how to use colour grading, film-inspired filters, and local contrast tools to create dramatic, moody still life images wi…<br><a href=\"https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/",
    "topic": "photo",
    "date": "2026-01-20T14:00:00.000Z"
  },
  {
    "title": "Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity",
    "q": "removing distractions in lightroom vs luminar, photolab and affinity camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity</b><br>In this beginner-friendly editing comparison, I walk photographers through one of the most common frustrations: removing unwanted people and distractions from photos, without needing to touch Photoshop. Using a real-world example from a bu…<br><a href=\"https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/",
    "topic": "photo",
    "date": "2026-01-19T14:00:00.000Z"
  },
  {
    "title": "A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light",
    "q": "a coastal wake-up call: variable nd filters vs real-world light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light</b><br>What I Loved in the Studio, and What Caught Me Out on the Coast After spending time with the K&F CONCEPT Ultra-Low Reflection Variable ND Filter in the studio, I was genuinely impressed. Long exposures behaved beautifully, reflections were…<br><a href=\"https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/",
    "topic": "photo",
    "date": "2026-01-18T14:00:00.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Windows 11&#8217;s ability to resume Android apps on your PC is getting closer",
    "q": "windows 11&#8217;s ability to resume android apps on your pc is getting closer windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11&#8217;s ability to resume Android apps on your PC is getting closer</b><br>Microsoft is getting ready to improve Windows 11's ability to resume Android apps on a PC. The software giant first introduced its cross-device resume last year, letting Windows 11 users resume OneDrive sessions from their Android device o…<br><a href=\"https://www.theverge.com/news/869161/microsoft-windows-11-android-app-resume-feature-release-preview\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/869161/microsoft-windows-11-android-app-resume-feature-release-preview",
    "topic": "it",
    "date": "2026-01-28T11:18:36.000Z"
  },
  {
    "title": "Tim Cook had ‘a good conversation’ with Trump about deescalation",
    "q": "tim cook had ‘a good conversation’ with trump about deescalation windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Tim Cook had ‘a good conversation’ with Trump about deescalation</b><br>Apple’s CEO is the latest executive to speak out following the killing of Alex Pretti. | Illustration by Laura Normand / The Verge Apple CEO Tim Cook has spoken out about \"the events in Minneapolis\" after federal agents shot and killed ano…<br><a href=\"https://www.theverge.com/news/869155/apple-tim-cook-president-trump-deescalate-minneapolis\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/869155/apple-tim-cook-president-trump-deescalate-minneapolis",
    "topic": "it",
    "date": "2026-01-28T10:52:14.000Z"
  },
  {
    "title": "Google just leaked a first look at Android for PC in action",
    "q": "google just leaked a first look at android for pc in action windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Google just leaked a first look at Android for PC in action</b><br>Aluminium OS looks like exactly what it is: a hybrid of Android and ChromeOS. We've been waiting months for our first look at Android running on a PC in Google's upcoming ChromeOS / Android hybrid platform, codenamed Aluminium OS. Now we'v…<br><a href=\"https://www.theverge.com/news/869142/google-leak-aluminium-os-android-pc-bug-report-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/869142/google-leak-aluminium-os-android-pc-bug-report-video",
    "topic": "it",
    "date": "2026-01-28T09:26:01.000Z"
  },
  {
    "title": "The best Android phones",
    "q": "the best android phones windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Android phones</b><br>The Android ecosystem is all about choice. While iPhone owners have a smaller pool of new devices to pick from when it’s time to upgrade, there’s a wider range of choices on Android. Some Android phones even fold in half! Imagine. On the f…<br><a href=\"https://www.theverge.com/23674658/best-android-phone\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/23674658/best-android-phone",
    "topic": "it",
    "date": "2026-01-28T00:27:47.000Z"
  },
  {
    "title": "Moltbot, the AI agent that &#8216;actually does things,&#8217; is tech’s new obsession",
    "q": "moltbot, the ai agent that &#8216;actually does things,&#8217; is tech’s new obsession windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Moltbot, the AI agent that &#8216;actually does things,&#8217; is tech’s new obsession</b><br>An open-source AI agent that \"actually does things\" is taking off, with people across the web sharing how they're using the agent to do a whole bunch of things, like manage reminders, log health and fitness data, and even communicate with …<br><a href=\"https://www.theverge.com/report/869004/moltbot-clawdbot-local-ai-agent\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/report/869004/moltbot-clawdbot-local-ai-agent",
    "topic": "it",
    "date": "2026-01-27T23:28:11.000Z"
  },
  {
    "title": " Microsoft is finally fixing Windows 11 under the hood — but new stats suggest it could be too little, too late ",
    "q": " microsoft is finally fixing windows 11 under the hood — but new stats suggest it could be too little, too late  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is finally fixing Windows 11 under the hood — but new stats suggest it could be too little, too late </b><br>Microsoft is working to smooth out the inner workings of Windows 11, but I'm struggling to have any confidence in this effort.<br><a href=\"https://www.techradar.com/computing/windows/microsoft-is-finally-fixing-windows-11-under-the-hood-but-new-stats-suggest-it-could-be-too-little-too-late\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/microsoft-is-finally-fixing-windows-11-under-the-hood-but-new-stats-suggest-it-could-be-too-little-too-late",
    "topic": "it",
    "date": "2026-01-28T12:04:13.000Z"
  },
  {
    "title": " I tested the Elegoo Centauri Carbon 2 Combo - and it's another impressive machine at an unbelievable price ",
    "q": " i tested the elegoo centauri carbon 2 combo - and it's another impressive machine at an unbelievable price  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> I tested the Elegoo Centauri Carbon 2 Combo - and it's another impressive machine at an unbelievable price </b><br>The Centauri Carbon 2 Combo is the much-anticipated follow-up to the original Centauri Carbon, and once again offers a CoreXY design, but now thankfully with an integrated CANVAS multicolour module. The result is a remarkably compact print…<br><a href=\"https://www.techradar.com/pro/elegoo-centauri-carbon-2-combo-3d-printer-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/elegoo-centauri-carbon-2-combo-3d-printer-review",
    "topic": "it",
    "date": "2026-01-28T11:35:16.000Z"
  },
  {
    "title": " After 34 years, the Linux kernel community finally has a contingency plan to replace Linus Torvalds — formal plan drawn up now community is 'getting grey and old' ",
    "q": " after 34 years, the linux kernel community finally has a contingency plan to replace linus torvalds — formal plan drawn up now community is 'getting grey and old'  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> After 34 years, the Linux kernel community finally has a contingency plan to replace Linus Torvalds — formal plan drawn up now community is 'getting grey and old' </b><br>Linux kernel community draws up contingency plan to replace Linus Torvalds<br><a href=\"https://www.tomshardware.com/software/linux/linux-kernel-community-draws-up-contingency-plan-to-replace-linus-torvalds-should-the-need-arise-only-34-years-in-the-making\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/software/linux/linux-kernel-community-draws-up-contingency-plan-to-replace-linus-torvalds-should-the-need-arise-only-34-years-in-the-making",
    "topic": "it",
    "date": "2026-01-28T12:00:00.000Z"
  },
  {
    "title": " Nvidia updates FrameView performance measurement tool — version 1.7 promises accurate results even at 800+ FPS ",
    "q": " nvidia updates frameview performance measurement tool — version 1.7 promises accurate results even at 800+ fps  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Nvidia updates FrameView performance measurement tool — version 1.7 promises accurate results even at 800+ FPS </b><br>Nvidia's FrameView game performance measurement utility has been updated to deliver more accurate results at 800+ FPS alongside a more customizable in-game overlay.<br><a href=\"https://www.tomshardware.com/pc-components/gpus/nvidia-updates-frameview-performance-measurement-tool-version-1-7-promises-accurate-results-even-at-800-fps\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/pc-components/gpus/nvidia-updates-frameview-performance-measurement-tool-version-1-7-promises-accurate-results-even-at-800-fps",
    "topic": "it",
    "date": "2026-01-28T10:00:00.000Z"
  },
  {
    "title": "I finally tested a Windows laptop with Intel's Panther Lake chip - and the hype is justified",
    "q": "i finally tested a windows laptop with intel's panther lake chip - and the hype is justified windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I finally tested a Windows laptop with Intel's Panther Lake chip - and the hype is justified</b><br>Asus' ExpertBook Ultra B9 is as ultraportable as it is powerful, with Intel's latest chipset and a stunning OLED display.<br><a href=\"https://www.zdnet.com/article/asus-expertbook-ultra-b9-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/asus-expertbook-ultra-b9-review/",
    "topic": "it",
    "date": "2026-01-28T01:30:40.000Z"
  },
  {
    "title": " Microsoft has reportedly scored a massive memory deal with SK Hynix — sending SK Hynix's stock up 8.7%  ",
    "q": " microsoft has reportedly scored a massive memory deal with sk hynix — sending sk hynix's stock up 8.7%   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft has reportedly scored a massive memory deal with SK Hynix — sending SK Hynix's stock up 8.7%  </b><br>Microsoft's platforms may avoid DRAM supply issues, if this report is to be believed.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-has-reportedly-scored-a-massive-memory-deal-with-sk-hynix-sending-sk-hynixs-stock-up-8-7-percent\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-has-reportedly-scored-a-massive-memory-deal-with-sk-hynix-sending-sk-hynixs-stock-up-8-7-percent",
    "topic": "it",
    "date": "2026-01-28T01:11:00.000Z"
  },
  {
    "title": " Windows 11 version 26H2: Everything we know so far about Microsoft's next OS update coming this fall ",
    "q": " windows 11 version 26h2: everything we know so far about microsoft's next os update coming this fall  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 version 26H2: Everything we know so far about Microsoft's next OS update coming this fall </b><br>Microsoft is now testing Windows 11 preview builds that are expected to make up the next version shipping this fall. Here's what we know.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-11-version-26h2-faq\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/windows-11-version-26h2-faq",
    "topic": "it",
    "date": "2026-01-28T00:31:47.000Z"
  },
  {
    "title": " Microsoft is in hot water for, well ... water abuse — data center water use expected 'to more than double' by 2030  ",
    "q": " microsoft is in hot water for, well ... water abuse — data center water use expected 'to more than double' by 2030   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is in hot water for, well ... water abuse — data center water use expected 'to more than double' by 2030  </b><br>Once upon a time, Microsoft pledged to replenish more water than it consumes by 2030. Those efforts seem to have gone up in smoke.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-is-in-hot-water-for-well-water-abuse-data-center-water-use-expected-to-more-than-double-by-2030\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-is-in-hot-water-for-well-water-abuse-data-center-water-use-expected-to-more-than-double-by-2030",
    "topic": "it",
    "date": "2026-01-28T00:18:14.000Z"
  },
  {
    "title": " Microsoft vows to make \"behind-the-scenes platform changes\" as it begins testing next phase of Windows 11 ",
    "q": " microsoft vows to make \"behind-the-scenes platform changes\" as it begins testing next phase of windows 11  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft vows to make \"behind-the-scenes platform changes\" as it begins testing next phase of Windows 11 </b><br>After a rough few weeks, Microsoft has promised to make behind-the-scenes platform changes to Windows 11 as it begins testing the next wave of features.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-vows-to-make-behind-the-scenes-platform-changes-as-it-begins-testing-next-phase-of-windows-11\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-vows-to-make-behind-the-scenes-platform-changes-as-it-begins-testing-next-phase-of-windows-11",
    "topic": "it",
    "date": "2026-01-27T23:08:59.000Z"
  },
  {
    "title": " Xbox Cloud Gaming’s new web UI is here, and it’s a huge upgrade — here’s how to get in and try it today ",
    "q": " xbox cloud gaming’s new web ui is here, and it’s a huge upgrade — here’s how to get in and try it today  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Xbox Cloud Gaming’s new web UI is here, and it’s a huge upgrade — here’s how to get in and try it today </b><br>Microsoft is now testing a new interface for the Xbox Cloud Gaming experience on the web, and these are the steps to start using it now.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/xbox-cloud-gaming-major-redesign-heres-how-to-access-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/xbox-cloud-gaming-major-redesign-heres-how-to-access-it",
    "topic": "it",
    "date": "2026-01-27T18:52:45.000Z"
  },
  {
    "title": "New WhatsApp lockdown feature protects high-risk users from hackers",
    "q": "new whatsapp lockdown feature protects high-risk users from hackers windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New WhatsApp lockdown feature protects high-risk users from hackers</b><br>Meta has started rolling out a new WhatsApp lockdown-style security feature designed to protect journalists, public figures, and other high-risk individuals from sophisticated threats, including spyware attacks. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/whatsapp-gets-new-lockdown-feature-that-blocks-cyberattacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/whatsapp-gets-new-lockdown-feature-that-blocks-cyberattacks/",
    "topic": "it",
    "date": "2026-01-28T11:48:26.000Z"
  },
  {
    "title": "Chinese Mustang Panda hackers deploy infostealers via CoolClient backdoor",
    "q": "chinese mustang panda hackers deploy infostealers via coolclient backdoor windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Chinese Mustang Panda hackers deploy infostealers via CoolClient backdoor</b><br>The Chinese espionage threat group Mustang Panda has updated its CoolClient backdoor to a new variant that can steal login data from browsers and monitor the clipboard. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/chinese-mustang-panda-hackers-deploy-infostealers-via-coolclient-backdoor/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/chinese-mustang-panda-hackers-deploy-infostealers-via-coolclient-backdoor/",
    "topic": "it",
    "date": "2026-01-27T22:26:26.000Z"
  },
  {
    "title": "Nike investigates data breach after extortion gang leaks files",
    "q": "nike investigates data breach after extortion gang leaks files windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Nike investigates data breach after extortion gang leaks files</b><br>Nike is investigating what it described as a \"potential cyber security incident\" after the World Leaks ransomware gang leaked 1.4 TB of files allegedly stolen from the sportswear giant. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/nike-investigates-data-breach-after-extortion-gang-leaks-files/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/nike-investigates-data-breach-after-extortion-gang-leaks-files/",
    "topic": "it",
    "date": "2026-01-27T16:45:46.000Z"
  },
  {
    "title": "Over 6,000 SmarterMail servers exposed to automated hijacking attacks ",
    "q": "over 6,000 smartermail servers exposed to automated hijacking attacks  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Over 6,000 SmarterMail servers exposed to automated hijacking attacks </b><br>Nonprofit security organization Shadowserver has found over 6,000 SmarterMail servers exposed online and likely vulnerable to attacks exploiting a critical authentication bypass vulnerability. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/over-6-000-smartermail-servers-exposed-to-automated-hijacking-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/over-6-000-smartermail-servers-exposed-to-automated-hijacking-attacks/",
    "topic": "it",
    "date": "2026-01-27T14:09:47.000Z"
  },
  {
    "title": "Excel's powerful Agent Mode is finally coming to Windows and Mac",
    "q": "excel's powerful agent mode is finally coming to windows and mac windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Excel's powerful Agent Mode is finally coming to Windows and Mac</b><br>Your spreadsheet just hired a full-time assistant that builds workbooks and fixes formulas directly in your grid.<br><a href=\"https://www.howtogeek.com/microsoft-excel-agent-mode-finally-coming-windows-mac/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-agent-mode-finally-coming-windows-mac/",
    "topic": "it",
    "date": "2026-01-28T08:33:48.000Z"
  },
  {
    "title": "I didn't shut down my Windows PC for a week: Here's how it went",
    "q": "i didn't shut down my windows pc for a week: here's how it went windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I didn't shut down my Windows PC for a week: Here's how it went</b><br>No rest for the wicked.<br><a href=\"https://www.howtogeek.com/i-didnt-shut-down-my-windows-pc-for-a-week/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/i-didnt-shut-down-my-windows-pc-for-a-week/",
    "topic": "it",
    "date": "2026-01-27T19:30:17.000Z"
  },
  {
    "title": "People don't like Windows 11's automatic Start menu sorting, and Microsoft wants to know why",
    "q": "people don't like windows 11's automatic start menu sorting, and microsoft wants to know why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>People don't like Windows 11's automatic Start menu sorting, and Microsoft wants to know why</b><br>Give it some feedback.<br><a href=\"https://www.xda-developers.com/people-dont-like-windows-11s-automatic-start-menu-sorting-and-microsoft-wants-to-know-why/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/people-dont-like-windows-11s-automatic-start-menu-sorting-and-microsoft-wants-to-know-why/",
    "topic": "it",
    "date": "2026-01-28T07:31:49.000Z"
  },
  {
    "title": "Windows 11's most underused feature is getting a boost soon",
    "q": "windows 11's most underused feature is getting a boost soon windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11's most underused feature is getting a boost soon</b><br>People might start using it now.<br><a href=\"https://www.xda-developers.com/windows-11s-most-underused-feature-is-getting-a-boost-soon/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-11s-most-underused-feature-is-getting-a-boost-soon/",
    "topic": "it",
    "date": "2026-01-28T06:43:06.000Z"
  },
  {
    "title": "Here are all the new features Microsoft added to Excel in January 2026",
    "q": "here are all the new features microsoft added to excel in january 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here are all the new features Microsoft added to Excel in January 2026</b><br>Excel gets a host of new features in January 2026<br><a href=\"https://www.xda-developers.com/here-are-all-the-new-features-microsoft-added-to-excel-in-january-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/here-are-all-the-new-features-microsoft-added-to-excel-in-january-2026/",
    "topic": "it",
    "date": "2026-01-28T06:11:09.000Z"
  },
  {
    "title": "GOG calls Linux \"the next major frontier\" for gaming as it works on a native client",
    "q": "gog calls linux \"the next major frontier\" for gaming as it works on a native client windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>GOG calls Linux \"the next major frontier\" for gaming as it works on a native client</b><br>Good for Good Old Games.<br><a href=\"https://www.xda-developers.com/gog-calls-linux-the-next-major-frontier-for-gaming-as-it-works-on-a-native-client/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/gog-calls-linux-the-next-major-frontier-for-gaming-as-it-works-on-a-native-client/",
    "topic": "it",
    "date": "2026-01-28T05:53:10.000Z"
  },
  {
    "title": "I turned my phone into a Linux desktop with this free app",
    "q": "i turned my phone into a linux desktop with this free app windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I turned my phone into a Linux desktop with this free app</b><br>It's basically Linux running inside an app, with a desktop environment, too.<br><a href=\"https://www.xda-developers.com/turned-phone-into-linux-desktop-free-app/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/turned-phone-into-linux-desktop-free-app/",
    "topic": "it",
    "date": "2026-01-28T00:00:20.000Z"
  }
]