[
  {
    "title": "The Curious Fujifilm X half Camera is Heavily Discounted Right Now",
    "q": "the curious fujifilm x half camera is heavily discounted right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Curious Fujifilm X half Camera is Heavily Discounted Right Now</b><br>When the Fujifilm X half was announced earlier this year it caused a stir for the digital camera's salute to analog photography. But that wasn't all -- the price raised eyebrows, too. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/the-curious-fujifilm-x-half-camera-is-heavily-discounted-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/the-curious-fujifilm-x-half-camera-is-heavily-discounted-right-now/",
    "topic": "photo",
    "date": "2025-12-01T11:29:36.000Z"
  },
  {
    "title": "How a 150MP Medium-Format Camera Preserves Japan’s Historic Manga",
    "q": "how a 150mp medium-format camera preserves japan’s historic manga camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How a 150MP Medium-Format Camera Preserves Japan’s Historic Manga</b><br>For many, digital cameras are tools for creating art. However, in some very specialized applications, high-resolution digital cameras are used to preserve it. In Japan, Shueisha Manga-Art Heritage is using 150-megapixel Phase One medium-fo…<br><a href=\"https://petapixel.com/2025/11/30/how-a-150mp-medium-format-camera-preserves-japans-historic-manga/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/how-a-150mp-medium-format-camera-preserves-japans-historic-manga/",
    "topic": "photo",
    "date": "2025-11-30T19:00:51.000Z"
  },
  {
    "title": "First-of-Its-Kind Exhibition Explores Photography’s Role in the Black Arts Movement",
    "q": "first-of-its-kind exhibition explores photography’s role in the black arts movement camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>First-of-Its-Kind Exhibition Explores Photography’s Role in the Black Arts Movement</b><br>The National Gallery of Art in Washington, D.C., is presenting the first exhibition to explore photography’s impact on a cultural and aesthetic movement that celebrated Black history, identity, and beauty. [Read More]<br><a href=\"https://petapixel.com/2025/11/30/first-of-its-kind-exhibition-explores-photographys-role-in-the-black-arts-movement/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/first-of-its-kind-exhibition-explores-photographys-role-in-the-black-arts-movement/",
    "topic": "photo",
    "date": "2025-11-30T19:00:23.000Z"
  },
  {
    "title": "Only Known Photos of Hamburg’s Jewish Deportation Discovered in Secret Album",
    "q": "only known photos of hamburg’s jewish deportation discovered in secret album camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Only Known Photos of Hamburg’s Jewish Deportation Discovered in Secret Album</b><br>The only known photographs of the deportation of the Jewish population in the German city of Hamburg have been discovered in a German police officer's secret photo album. [Read More]<br><a href=\"https://petapixel.com/2025/11/30/only-known-photos-of-hamburgs-jewish-deportation-discovered-in-secret-album/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/only-known-photos-of-hamburgs-jewish-deportation-discovered-in-secret-album/",
    "topic": "photo",
    "date": "2025-11-30T14:00:48.000Z"
  },
  {
    "title": "Legendary War Photographer Says His Negatives Have Been Taken From Him",
    "q": "legendary war photographer says his negatives have been taken from him camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Legendary War Photographer Says His Negatives Have Been Taken From Him</b><br>Legendary war photographer Al Rockoff -- who was immortalized in the classic movie The Killing Fields -- has claimed that his historic negatives were taken from him against his will in a bitter dispute. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/legendary-war-photographer-says-his-negatives-have-been-taken-from-him/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/legendary-war-photographer-says-his-negatives-have-been-taken-from-him/",
    "topic": "photo",
    "date": "2025-11-29T19:00:03.000Z"
  },
  {
    "title": "18 Gift Ideas for Photographers for All Budgets",
    "q": "18 gift ideas for photographers for all budgets camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>18 Gift Ideas for Photographers for All Budgets</b><br>The holiday season is not far off, and photographers may be thinking about what they want as a gift. Here are some gift ideas for photographers of all levels of experience and budgets. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/",
    "topic": "photo",
    "date": "2025-11-29T18:00:37.000Z"
  },
  {
    "title": "Camp Snap 8 (CS-8) Review: Pretty But Preposterous",
    "q": "camp snap 8 (cs-8) review: pretty but preposterous camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Camp Snap 8 (CS-8) Review: Pretty But Preposterous</b><br>The original Camp Snap camera was released a while back and became an unexpected hit. This digital camera was extremely limited and lacked an LCD screen in an attempt to bring the fun back to photography. Now Camp Snap is bringing this phi…<br><a href=\"https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/",
    "topic": "photo",
    "date": "2025-11-29T15:01:05.000Z"
  },
  {
    "title": "113 Years Ago, the US Tried to Outlaw Fake Photographs",
    "q": "113 years ago, the us tried to outlaw fake photographs camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>113 Years Ago, the US Tried to Outlaw Fake Photographs</b><br>It’s easy to imagine that anxiety over manipulated images began with Photoshop or AI, but photographers have been wrestling with the problem almost since the birth of the medium. More than a century ago (113 years back to be exact), the U.…<br><a href=\"https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "This New Astrophotography Camera Has a 44MP Full-Frame Sensor",
    "q": "this new astrophotography camera has a 44mp full-frame sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This New Astrophotography Camera Has a 44MP Full-Frame Sensor</b><br>ZWO has announced a new 44-megapixel full-frame camera designed specifically for astrophotography, and its specs are impressive. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/",
    "topic": "photo",
    "date": "2025-11-28T22:03:46.000Z"
  },
  {
    "title": "The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’",
    "q": "the five most shocking claims made by netflix’s ‘the stringer’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’</b><br>Finally the day has come: The Stringer: The Man Who Took the Photo, a film about who really took the famous Napalm Girl photo during the Vietnam War, has dropped on Netflix meaning anyone with a subscription can now see what the fuss is al…<br><a href=\"https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/",
    "topic": "photo",
    "date": "2025-11-28T22:00:20.000Z"
  },
  {
    "title": "Compact camera bonanza: 20 standout shots from our November Editors' photo challenge",
    "q": "compact camera bonanza: 20 standout shots from our november editors' photo challenge camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Compact camera bonanza: 20 standout shots from our November Editors' photo challenge</b><br>The October Editors' photo challenge The theme for our November Editor's photo challenge was \"Compact Camera Bonanza.\" For this challenge, we asked you to share photos taken with compact, or fixed-lens, cameras, and wow, did you deliver! W…<br><a href=\"https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge",
    "topic": "photo",
    "date": "2025-11-30T14:00:00.000Z"
  },
  {
    "title": "Do you need to learn Manual mode right away?",
    "q": "do you need to learn manual mode right away? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do you need to learn Manual mode right away?</b><br>Photo: Abby Ferguson If you're a beginner photographer who spends any time on the internet, chances are you've been bombarded with content saying that you need to learn Manual mode immediately. It's a frequent refrain that \"real\" photograp…<br><a href=\"https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": " \"Last night I edited an 8-angle video in minutes\" – Multicam editing and cheap cameras have changed video making... ",
    "q": " \"last night i edited an 8-angle video in minutes\" – multicam editing and cheap cameras have changed video making...  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> \"Last night I edited an 8-angle video in minutes\" – Multicam editing and cheap cameras have changed video making... </b><br>I thought I could resist the buying, but multicam tech meant that cheap action cameras have become irresistible to me...<br><a href=\"https://www.digitalcameraworld.com/cameras/action-cameras/last-night-i-edited-an-8-angle-video-in-minutes-multicam-editing-and-cheap-cameras-have-changed-video-making\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/action-cameras/last-night-i-edited-an-8-angle-video-in-minutes-multicam-editing-and-cheap-cameras-have-changed-video-making",
    "topic": "photo",
    "date": "2025-12-01T12:09:49.000Z"
  },
  {
    "title": " Only want to carry one lens? Treat yourself to a Nikon Z 24-200mm on Cyber Monday! ",
    "q": " only want to carry one lens? treat yourself to a nikon z 24-200mm on cyber monday!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Only want to carry one lens? Treat yourself to a Nikon Z 24-200mm on Cyber Monday! </b><br>This money-saving deal bundles Nikon's top-quality ultra-versatile do-anything superzoom with loads of handy accessories<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/only-want-to-carry-one-lens-treat-yourself-to-a-nikon-z-24-200mm-on-cyber-monday\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/only-want-to-carry-one-lens-treat-yourself-to-a-nikon-z-24-200mm-on-cyber-monday",
    "topic": "photo",
    "date": "2025-12-01T11:36:58.000Z"
  },
  {
    "title": " Only want to carry one lens? The Nikon Z 24-200mm is a Cyber Monday bargain! ",
    "q": " only want to carry one lens? the nikon z 24-200mm is a cyber monday bargain!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Only want to carry one lens? The Nikon Z 24-200mm is a Cyber Monday bargain! </b><br>Treat yourself! This deal has this ultra-versatile do-anything superzoom lens at an unbeatable price!<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/only-want-to-carry-one-lens-the-nikon-z-24-200mm-is-a-cyber-monday-bargain\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/only-want-to-carry-one-lens-the-nikon-z-24-200mm-is-a-cyber-monday-bargain",
    "topic": "photo",
    "date": "2025-12-01T11:17:05.000Z"
  },
  {
    "title": " Now I understand that every UK vlogger's wishlist should be topped with this low-cost device... ",
    "q": " now i understand that every uk vlogger's wishlist should be topped with this low-cost device...  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Now I understand that every UK vlogger's wishlist should be topped with this low-cost device... </b><br>There was a time when a vlogger came for expert gear advice and was told about 'proper cameras' – now I think I'd start somewhere else for attention...<br><a href=\"https://www.digitalcameraworld.com/cameras/gimbals/now-i-understand-that-every-uk-vloggers-wishlist-should-be-topped-with-this-low-cost-device\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/gimbals/now-i-understand-that-every-uk-vloggers-wishlist-should-be-topped-with-this-low-cost-device",
    "topic": "photo",
    "date": "2025-12-01T10:53:52.000Z"
  },
  {
    "title": " Now I understand that every vlogger's wishlist should be topped with this low-cost device... ",
    "q": " now i understand that every vlogger's wishlist should be topped with this low-cost device...  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Now I understand that every vlogger's wishlist should be topped with this low-cost device... </b><br>There was a time when a vlogger came for expert gear advice and was told about 'proper cameras' – now I think I'd start somewhere else for attention...<br><a href=\"https://www.digitalcameraworld.com/cameras/gimbals/now-i-understand-that-every-vloggers-wishlist-should-be-topped-with-this-low-cost-device\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/gimbals/now-i-understand-that-every-vloggers-wishlist-should-be-topped-with-this-low-cost-device",
    "topic": "photo",
    "date": "2025-12-01T10:50:17.000Z"
  },
  {
    "title": " I know this LED light is expensive –but it's so good, it might be the last light you ever need to buy ",
    "q": " i know this led light is expensive –but it's so good, it might be the last light you ever need to buy  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I know this LED light is expensive –but it's so good, it might be the last light you ever need to buy </b><br>I truly think this is the best light you can get for photo and video.Portable, powerful, versatile –it's an incredible creative tool<br><a href=\"https://www.digitalcameraworld.com/photography/lighting/i-know-this-led-light-is-expensive-but-its-so-good-it-might-be-the-last-light-you-ever-need-to-buy\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/lighting/i-know-this-led-light-is-expensive-but-its-so-good-it-might-be-the-last-light-you-ever-need-to-buy",
    "topic": "photo",
    "date": "2025-12-01T08:17:00.000Z"
  },
  {
    "title": " 17-year-old captures the detail of this tiny predator with a Fujifilm X-H2 camera by patiently shooting a 104-frame focus stack ",
    "q": " 17-year-old captures the detail of this tiny predator with a fujifilm x-h2 camera by patiently shooting a 104-frame focus stack  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> 17-year-old captures the detail of this tiny predator with a Fujifilm X-H2 camera by patiently shooting a 104-frame focus stack </b><br>Teenager Alexis Tinker-Tsavalas employed a flash, diffuser and Laowa Ultra Macro lens to produce this incredible image<br><a href=\"https://www.digitalcameraworld.com/photography/nature-and-wildlife-photography/17-year-old-captures-the-detail-of-this-tiny-predator-with-a-fujifilm-x-h2-camera-by-patiently-shooting-a-104-frame-focus-stack\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/nature-and-wildlife-photography/17-year-old-captures-the-detail-of-this-tiny-predator-with-a-fujifilm-x-h2-camera-by-patiently-shooting-a-104-frame-focus-stack",
    "topic": "photo",
    "date": "2025-12-01T07:45:00.000Z"
  },
  {
    "title": " Cyber Monday camera deals – Our live feed of all the latest deals as they drop, all day long! ",
    "q": " cyber monday camera deals – our live feed of all the latest deals as they drop, all day long!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Cyber Monday camera deals – Our live feed of all the latest deals as they drop, all day long! </b><br>Cameras, lenses, photography accessories – we're tracking the top Cyber Monday camera deals throughout the day<br><a href=\"https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/live/cyber-monday-camera-deals-our-live-feed-of-all-the-latest-deals-as-they-drop-all-day-long\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/live/cyber-monday-camera-deals-our-live-feed-of-all-the-latest-deals-as-they-drop-all-day-long",
    "topic": "photo",
    "date": "2025-12-01T05:03:10.000Z"
  },
  {
    "title": " This super-quick editing hack transforms my travel photos into magical movie moments ",
    "q": " this super-quick editing hack transforms my travel photos into magical movie moments  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This super-quick editing hack transforms my travel photos into magical movie moments </b><br>Canon pro Peter Travers shares his secret to creating more atmospheric scenic photos with cinematic widescreen cropping<br><a href=\"https://www.digitalcameraworld.com/photography/composition/this-super-quick-editing-hack-transforms-my-travel-photos-into-magical-movie-moments\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/composition/this-super-quick-editing-hack-transforms-my-travel-photos-into-magical-movie-moments",
    "topic": "photo",
    "date": "2025-11-30T22:18:00.000Z"
  },
  {
    "title": "Newborn Photography Props and Ideas",
    "q": "newborn photography props and ideas camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Newborn Photography Props and Ideas</b><br>When it comes to producing great newborn photography images, creative newborn photography props and ideas can be the difference between an amateur photo and a high-quality, professional photo. Afterall, you could have all of the best camer…<br><a href=\"https://www.slrlounge.com/newborn-photography-props-ideas/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/newborn-photography-props-ideas/",
    "topic": "photo",
    "date": "2025-12-01T02:04:26.000Z"
  },
  {
    "title": "Fall Children’s Portrait Photography Tutorial",
    "q": "fall children’s portrait photography tutorial camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fall Children’s Portrait Photography Tutorial</b><br>We're going to create a rich, Autumn-toned portrait, from start to finish.<br><a href=\"https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/",
    "topic": "photo",
    "date": "2025-11-30T06:06:28.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Best Memory Cards for Photographers",
    "q": "best memory cards for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Cards for Photographers</b><br>People tend to focus more on cameras and lenses when discussing camera gear. Those are exciting, fun purchases! However, once a new photographer find themselves out taking photos, the next piece of gear takes center stage, and becomes infi…<br><a href=\"https://www.slrlounge.com/best-memory-cards-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-cards-for-photographers/",
    "topic": "photo",
    "date": "2025-11-26T23:41:26.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "These great Cyber Monday tech deals will likely be gone tomorrow",
    "q": "these great cyber monday tech deals will likely be gone tomorrow windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These great Cyber Monday tech deals will likely be gone tomorrow</b><br>December is kicking off with a bang. Cyber Monday is today, and it’s one of your last chances to score major deals before the holiday rush plows us all over. It’s a great moment to snag gadgets — many of which have been tested by The Verge…<br><a href=\"https://www.theverge.com/gadgets/834422/cyber-monday-2025-best-deals-tech-gadgets-gift-ideas\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834422/cyber-monday-2025-best-deals-tech-gadgets-gift-ideas",
    "topic": "it",
    "date": "2025-12-01T12:33:10.000Z"
  },
  {
    "title": "Apple’s M2 MacBook Air is just $599 during Cyber Monday",
    "q": "apple’s m2 macbook air is just $599 during cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple’s M2 MacBook Air is just $599 during Cyber Monday</b><br>The 13-inch M2 MacBook Air is down to $599 for Cyber Monday. While Walmart continues to sell the 2020 M1 MacBook Air for $549, Best Buy is upping the ante for Cyber Monday with a sweet doorbuster deal on Apple’s 13-inch M2 MacBook Air that…<br><a href=\"https://www.theverge.com/gadgets/834693/apple-m2-macbook-air-cyber-monday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834693/apple-m2-macbook-air-cyber-monday-deal-sale",
    "topic": "it",
    "date": "2025-12-01T12:30:00.000Z"
  },
  {
    "title": "Welcome to fandom’s AI clout economy",
    "q": "welcome to fandom’s ai clout economy windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Welcome to fandom’s AI clout economy</b><br>Madison Lawrence Tabbey was scrolling through X in late October when a post from a Wicked update account caught her attention. Ariana Grande, who stars in the movies as Glinda, had just liked a meme on Instagram about never wanting to see …<br><a href=\"https://www.theverge.com/ai-artificial-intelligence/830876/influencers-anti-ai-deepfakes-fandom-economy\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/ai-artificial-intelligence/830876/influencers-anti-ai-deepfakes-fandom-economy",
    "topic": "it",
    "date": "2025-12-01T12:00:00.000Z"
  },
  {
    "title": "The Verge’s guide to Cyber Monday 2025",
    "q": "the verge’s guide to cyber monday 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Verge’s guide to Cyber Monday 2025</b><br>Cyber Monday is here in full force. It brings with it many of the same deals as we saw during Black Friday, along with a handful of new, limited-time sale prices on Verge-approved tech products. It’s a great time to save on laptops, OLED T…<br><a href=\"https://www.theverge.com/tech/808624/black-friday-cyber-monday-guide-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/808624/black-friday-cyber-monday-guide-2025",
    "topic": "it",
    "date": "2025-12-01T10:23:49.000Z"
  },
  {
    "title": "Netflix kills casting from phones",
    "q": "netflix kills casting from phones windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Netflix kills casting from phones</b><br>Netflix has removed the ability to cast shows and movies from phones to TVs, unless subscribers are using older casting devices. An updated help page on Netflix’s website, first reported by Android Authority, says that the streaming servic…<br><a href=\"https://www.theverge.com/news/834655/netflix-phone-casting-chromecast-support-killed\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/834655/netflix-phone-casting-chromecast-support-killed",
    "topic": "it",
    "date": "2025-12-01T10:20:50.000Z"
  },
  {
    "title": "Here are 50 standout deals under $100 we’re eyeing for Cyber Monday",
    "q": "here are 50 standout deals under $100 we’re eyeing for cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here are 50 standout deals under $100 we’re eyeing for Cyber Monday</b><br>The Google Pixel Buds come in several colors, but why would you choose anything other than purple? When the deals are flying fast and furious, it can be easy to overspend, especially when OLED TVs, laptops, and other great pieces of tech a…<br><a href=\"https://www.theverge.com/gadgets/833655/cyber-monday-best-cheap-tech-deals-under-100-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833655/cyber-monday-best-cheap-tech-deals-under-100-2025",
    "topic": "it",
    "date": "2025-12-01T03:29:13.000Z"
  },
  {
    "title": "The best Cyber Monday deals on Apple MacBooks, AirTags, iPads, and more",
    "q": "the best cyber monday deals on apple macbooks, airtags, ipads, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Cyber Monday deals on Apple MacBooks, AirTags, iPads, and more</b><br>If you’re planning to gift an Apple device this holiday season — or treat yourself — now’s the time to start shopping. Black Friday is bleeding into Cyber Monday — and these Apple deals are some of the best we’ve seen all year. Despite hav…<br><a href=\"https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025",
    "topic": "it",
    "date": "2025-12-01T02:53:01.000Z"
  },
  {
    "title": "The absolute best Cyber Monday deals you can already shop",
    "q": "the absolute best cyber monday deals you can already shop windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The absolute best Cyber Monday deals you can already shop</b><br>Editor’s note: December has arrived, bringing Cyber Monday with it. We’re tracking all of the latest deals kicking off today in a new post rounding up the best Cyber Monday deals, so we will no longer be updating this article. Black Friday…<br><a href=\"https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025",
    "topic": "it",
    "date": "2025-12-01T02:38:32.000Z"
  },
  {
    "title": "Anker’s Laptop Power Bank is  $32 off for Cyber Monday, its biggest discount yet",
    "q": "anker’s laptop power bank is  $32 off for cyber monday, its biggest discount yet windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Anker’s Laptop Power Bank is  $32 off for Cyber Monday, its biggest discount yet</b><br>Anker’s portable charger is about the size of a soda can and can charge multiple devices for less than $90. If you’re planning to head out of town for the holidays, now is a good time to stock up on chargers so that your devices don’t die …<br><a href=\"https://www.theverge.com/gadgets/834269/anker-laptop-power-bank-cyber-monday-deal-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834269/anker-laptop-power-bank-cyber-monday-deal-sale-2025",
    "topic": "it",
    "date": "2025-12-01T00:53:23.000Z"
  },
  {
    "title": " Complaints about Windows 11's fix for File Explorer sluggishness are overblown – but they underline a fundamental problem with the OS ",
    "q": " complaints about windows 11's fix for file explorer sluggishness are overblown – but they underline a fundamental problem with the os  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Complaints about Windows 11's fix for File Explorer sluggishness are overblown – but they underline a fundamental problem with the OS </b><br>Latest flak fired at Windows 11 over performance is a fuss about nothing – but it still shines a light on one of Microsoft's weaknesses.<br><a href=\"https://www.techradar.com/computing/windows/complaints-about-windows-11s-fix-for-file-explorer-sluggishness-are-overblown-but-they-underline-a-fundamental-problem-with-the-os\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/complaints-about-windows-11s-fix-for-file-explorer-sluggishness-are-overblown-but-they-underline-a-fundamental-problem-with-the-os",
    "topic": "it",
    "date": "2025-12-01T12:33:50.000Z"
  },
  {
    "title": " The PlayStation Portal is still at its lowest ever price for Cyber Monday, and it's an infinitely better device in 2025 ",
    "q": " the playstation portal is still at its lowest ever price for cyber monday, and it's an infinitely better device in 2025  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The PlayStation Portal is still at its lowest ever price for Cyber Monday, and it's an infinitely better device in 2025 </b><br>The PlayStation Portal is now at its lowest ever price for Cyber Monday. After recent updates, I recommend it as a must-buy, thanks to cloud-streaming features.<br><a href=\"https://www.techradar.com/gaming/the-playstation-portal-is-still-at-its-lowest-ever-price-for-cyber-monday-and-its-an-infinitely-better-device-in-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/gaming/the-playstation-portal-is-still-at-its-lowest-ever-price-for-cyber-monday-and-its-an-infinitely-better-device-in-2025",
    "topic": "it",
    "date": "2025-12-01T12:27:05.000Z"
  },
  {
    "title": " Some Apple Watch Series 10 owners are reportedly getting free replacements due to a paint flaw ",
    "q": " some apple watch series 10 owners are reportedly getting free replacements due to a paint flaw  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Some Apple Watch Series 10 owners are reportedly getting free replacements due to a paint flaw </b><br>Some Apple Watch Series 10 owners are reporting that Apple is offering free replacements due to a paint defect.<br><a href=\"https://www.techradar.com/health-fitness/smartwatches/some-apple-watch-series-10-owners-are-reportedly-getting-free-replacements-due-to-a-paint-flaw\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/health-fitness/smartwatches/some-apple-watch-series-10-owners-are-reportedly-getting-free-replacements-due-to-a-paint-flaw",
    "topic": "it",
    "date": "2025-12-01T12:24:13.000Z"
  },
  {
    "title": " Apple TV’s rare Cyber Monday streaming deal is ending soon – don’t miss out! ",
    "q": " apple tv’s rare cyber monday streaming deal is ending soon – don’t miss out!  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Apple TV’s rare Cyber Monday streaming deal is ending soon – don’t miss out! </b><br>The best Cyber Monday streaming deals are ending soon – here’s why this rare Apple TV discount is my top pick.<br><a href=\"https://www.techradar.com/streaming/apple-tv-plus/apple-tvs-rare-cyber-monday-streaming-deal-is-ending-soon-dont-miss-out\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/streaming/apple-tv-plus/apple-tvs-rare-cyber-monday-streaming-deal-is-ending-soon-dont-miss-out",
    "topic": "it",
    "date": "2025-12-01T12:02:45.000Z"
  },
  {
    "title": "Prime Video Subscribers: Grab 6 Months of Apple TV Plus for $36 This Cyber Monday",
    "q": "prime video subscribers: grab 6 months of apple tv plus for $36 this cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Prime Video Subscribers: Grab 6 Months of Apple TV Plus for $36 This Cyber Monday</b><br>Binge watch top-notch shows like Ted Lasso and Shrinking TV from Apple for as little as $6 per month. The best part? It's not the only deal available.<br><a href=\"https://www.cnet.com/deals/prime-video-subscribers-grab-6-months-of-apple-tv-plus-for-36-this-cyber-monday/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/deals/prime-video-subscribers-grab-6-months-of-apple-tv-plus-for-36-this-cyber-monday/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-30T17:51:00.000Z"
  },
  {
    "title": "Best Cyber Monday 2025 deals: These are our favorites at Amazon, Best Buy, and more",
    "q": "best cyber monday 2025 deals: these are our favorites at amazon, best buy, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Best Cyber Monday 2025 deals: These are our favorites at Amazon, Best Buy, and more</b><br>Black Friday is over, and Cyber Monday is now here. Every major retailer is offering attractive sales on items from Apple, Samsung, LG, Roku, and more.<br><a href=\"https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-11-30/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-11-30/",
    "topic": "it",
    "date": "2025-12-01T12:30:00.000Z"
  },
  {
    "title": "Thousands of readers bought this smartwatch this year (it's not from Samsung, Apple, or Google)",
    "q": "thousands of readers bought this smartwatch this year (it's not from samsung, apple, or google) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Thousands of readers bought this smartwatch this year (it's not from Samsung, Apple, or Google)</b><br>We identified the top 10 smartwatches and fitness trackers that our readers purchased the most this year, and there were several surprises on the list.<br><a href=\"https://www.zdnet.com/article/most-popular-smartwatches-from-our-readers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/most-popular-smartwatches-from-our-readers/",
    "topic": "it",
    "date": "2025-12-01T12:28:00.000Z"
  },
  {
    "title": "2 years of charging my iPhone the 'Apple way' later - here's how the battery has changed",
    "q": "2 years of charging my iphone the 'apple way' later - here's how the battery has changed windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>2 years of charging my iPhone the 'Apple way' later - here's how the battery has changed</b><br>Is there a correct way to charge your iPhone? And what happens when you do? Here's how mine has held up.<br><a href=\"https://www.zdnet.com/article/2-years-of-charging-my-iphone-the-apple-way-later-heres-how-the-battery-has-changed/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/2-years-of-charging-my-iphone-the-apple-way-later-heres-how-the-battery-has-changed/",
    "topic": "it",
    "date": "2025-12-01T12:20:00.000Z"
  },
  {
    "title": "T-Mobile is giving a free iPhone 17, iPad, and Apple Watch for Cyber Monday - how to qualify",
    "q": "t-mobile is giving a free iphone 17, ipad, and apple watch for cyber monday - how to qualify windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>T-Mobile is giving a free iPhone 17, iPad, and Apple Watch for Cyber Monday - how to qualify</b><br>T-Mobile's new Ultimate Apple Bundle is one of our favorite Cyber Monday deals of 2025. We break down the fine print.<br><a href=\"https://www.zdnet.com/article/t-mobile-is-giving-a-free-iphone-17-ipad-and-apple-watch-for-cyber-monday-how-to-qualify/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/t-mobile-is-giving-a-free-iphone-17-ipad-and-apple-watch-for-cyber-monday-how-to-qualify/",
    "topic": "it",
    "date": "2025-12-01T12:17:00.000Z"
  },
  {
    "title": " 8 Cyber Monday deals we actually bought this year — laptops, PC accessories, video games, and more ",
    "q": " 8 cyber monday deals we actually bought this year — laptops, pc accessories, video games, and more  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> 8 Cyber Monday deals we actually bought this year — laptops, PC accessories, video games, and more </b><br>There are plenty of tempting Cyber Monday deals going on now, but these are the ones that actually got us here at Windows Central to make a purchase.<br><a href=\"https://www.windowscentral.com/hardware/handheld-gaming-pc/cyber-monday-deals-we-actually-bought\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/handheld-gaming-pc/cyber-monday-deals-we-actually-bought",
    "topic": "it",
    "date": "2025-12-01T12:24:00.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "Public GitLab repositories exposed more than 17,000 secrets",
    "q": "public gitlab repositories exposed more than 17,000 secrets windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Public GitLab repositories exposed more than 17,000 secrets</b><br>After scanning all 5.6 million public repositories on GitLab Cloud, a security engineer discovered more than 17,000 exposed secrets across over 2,800 unique domains. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/",
    "topic": "it",
    "date": "2025-11-28T17:43:02.000Z"
  },
  {
    "title": "This is the only Linux distro I recommend for self-hosting",
    "q": "this is the only linux distro i recommend for self-hosting windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This is the only Linux distro I recommend for self-hosting</b><br>Proxmox makes self-hosting less risky and more approachable.<br><a href=\"https://www.howtogeek.com/only-linux-distro-recommend-elf-hosting/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/only-linux-distro-recommend-elf-hosting/",
    "topic": "it",
    "date": "2025-11-30T22:15:14.000Z"
  },
  {
    "title": "These hidden Windows repair tricks fix corrupted files—and Microsoft won't tell you about it",
    "q": "these hidden windows repair tricks fix corrupted files—and microsoft won't tell you about it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These hidden Windows repair tricks fix corrupted files—and Microsoft won't tell you about it</b><br>Your PC is acting strange, and Microsoft isn't telling you why. Discover the hidden repair tricks to fix corrupted files before it's too late.<br><a href=\"https://www.howtogeek.com/these-hidden-windows-repair-tricks-fixe-corrupted-filesand-microsoft-wont-tell-you-about-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/these-hidden-windows-repair-tricks-fixe-corrupted-filesand-microsoft-wont-tell-you-about-it/",
    "topic": "it",
    "date": "2025-11-30T22:00:13.000Z"
  },
  {
    "title": "6 Linux apps I always run at startup (and why they’re worth it)",
    "q": "6 linux apps i always run at startup (and why they’re worth it) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>6 Linux apps I always run at startup (and why they’re worth it)</b><br>Sometimes you just need your apps from the get-go.<br><a href=\"https://www.howtogeek.com/linux-apps-i-always-run-at-startup-and-why-theyre-worth-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/linux-apps-i-always-run-at-startup-and-why-theyre-worth-it/",
    "topic": "it",
    "date": "2025-11-30T21:00:14.000Z"
  },
  {
    "title": "5 reasons your Bluetooth audio keeps cracking or cutting out",
    "q": "5 reasons your bluetooth audio keeps cracking or cutting out windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>5 reasons your Bluetooth audio keeps cracking or cutting out</b><br>Bluetooth isn't perfect on Windows, and these mistakes can make it worse<br><a href=\"https://www.xda-developers.com/why-bluetooth-audio-keeps-cracking-or-cutting-out/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/why-bluetooth-audio-keeps-cracking-or-cutting-out/",
    "topic": "it",
    "date": "2025-12-01T12:00:17.000Z"
  },
  {
    "title": "Windows 11's new pre-loaded File Explorer is reportedly still slower than Windows 10",
    "q": "windows 11's new pre-loaded file explorer is reportedly still slower than windows 10 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11's new pre-loaded File Explorer is reportedly still slower than Windows 10</b><br>Not a good look.<br><a href=\"https://www.xda-developers.com/windows-11s-new-pre-loaded-file-explorer-is-reportedly-still-slower-than-windows-10/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-11s-new-pre-loaded-file-explorer-is-reportedly-still-slower-than-windows-10/",
    "topic": "it",
    "date": "2025-12-01T04:09:59.000Z"
  },
  {
    "title": "People really don't want Windows 11 on their PCs, says Dell",
    "q": "people really don't want windows 11 on their pcs, says dell windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>People really don't want Windows 11 on their PCs, says Dell</b><br>It's more than you may think.<br><a href=\"https://www.xda-developers.com/people-really-dont-want-windows-11-on-their-pcs-says-dell/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/people-really-dont-want-windows-11-on-their-pcs-says-dell/",
    "topic": "it",
    "date": "2025-12-01T02:46:23.000Z"
  }
]