[
  {
    "title": "Man Builds Two Billion FPS Camera That Literally Records at the Speed of Light",
    "q": "man builds two billion fps camera that literally records at the speed of light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Man Builds Two Billion FPS Camera That Literally Records at the Speed of Light</b><br>Brian Haidet of the AlphaPhoenix YouTube channel has recorded a laser beam at two billion frames per second (FPS), recording the path of light as it bounces across his garage. [Read More]<br><a href=\"https://petapixel.com/2025/10/20/man-builds-two-billion-fps-camera-that-literally-records-at-the-speed-of-light/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/man-builds-two-billion-fps-camera-that-literally-records-at-the-speed-of-light/",
    "topic": "photo",
    "date": "2025-10-20T17:42:10.000Z"
  },
  {
    "title": "Japanese Astronaut Snaps Spectacular Photos of Aurora Lights Dancing Above Earth",
    "q": "japanese astronaut snaps spectacular photos of aurora lights dancing above earth camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Japanese Astronaut Snaps Spectacular Photos of Aurora Lights Dancing Above Earth</b><br>The International Space Station's social media accounts have been silent since October 1, coinciding with the U.S. government's shutdown and starving fans of awesome space photographs. [Read More]<br><a href=\"https://petapixel.com/2025/10/20/japanese-astronaut-snaps-spectacular-photos-of-aurora-lights-dancing-above-earth/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/japanese-astronaut-snaps-spectacular-photos-of-aurora-lights-dancing-above-earth/",
    "topic": "photo",
    "date": "2025-10-20T16:44:40.000Z"
  },
  {
    "title": "Kohler Just Unveiled a Toilet Camera",
    "q": "kohler just unveiled a toilet camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Kohler Just Unveiled a Toilet Camera</b><br>Kohler, best known for its plumbing products including toilets and faucets, is entering the photography game with a camera that goes inside a toilet and analyzes photos of people's stool. [Read More]<br><a href=\"https://petapixel.com/2025/10/20/kohler-just-unveiled-a-toilet-camera/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/kohler-just-unveiled-a-toilet-camera/",
    "topic": "photo",
    "date": "2025-10-20T16:18:29.000Z"
  },
  {
    "title": "UK Probes Getty-Shutterstock Merger Over Competition Concerns",
    "q": "uk probes getty-shutterstock merger over competition concerns camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>UK Probes Getty-Shutterstock Merger Over Competition Concerns</b><br>Britain’s Competition and Markets Authority (CMA) has warned that the proposed $3.7 billion merger between Getty Images and Shutterstock could significantly reduce competition in the editorial and stock photography markets. [Read More]<br><a href=\"https://petapixel.com/2025/10/20/uk-probes-getty-shutterstock-merger-over-competition-concerns/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/uk-probes-getty-shutterstock-merger-over-competition-concerns/",
    "topic": "photo",
    "date": "2025-10-20T15:39:34.000Z"
  },
  {
    "title": "The Most Prompted Photographers on AI Image Generator Midjourney Revealed",
    "q": "the most prompted photographers on ai image generator midjourney revealed camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Most Prompted Photographers on AI Image Generator Midjourney Revealed</b><br>The top 200 photographers requested by Midjourney users have been exclusively revealed to PetaPixel -- and it's a world-famous, still active photographer that tops the list. [Read More]<br><a href=\"https://petapixel.com/2025/10/20/the-most-prompted-photographers-on-ai-image-generator-midjourney-revealed/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/the-most-prompted-photographers-on-ai-image-generator-midjourney-revealed/",
    "topic": "photo",
    "date": "2025-10-20T14:46:09.000Z"
  },
  {
    "title": "Meta Wants Its AI to Learn From Your Camera Roll",
    "q": "meta wants its ai to learn from your camera roll camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Meta Wants Its AI to Learn From Your Camera Roll</b><br>Meta wants access to the photos on Facebook users' smartphone camera rolls. The company's new feature is designed to help people find \"shareworthy\" photos they haven't yet published, but the privacy concerns are obvious and there are impor…<br><a href=\"https://petapixel.com/2025/10/20/meta-wants-its-ai-to-learn-from-your-camera-roll/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/meta-wants-its-ai-to-learn-from-your-camera-roll/",
    "topic": "photo",
    "date": "2025-10-20T14:21:25.000Z"
  },
  {
    "title": "22 Photos From Magnum’s New Square Print Sale That Capture Spirit of Youth",
    "q": "22 photos from magnum’s new square print sale that capture spirit of youth camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>22 Photos From Magnum’s New Square Print Sale That Capture Spirit of Youth</b><br>Magnum Photos and Aperture have teamed up for a new edition of Magnum's Square Print Sale. The latest sale, titled Youth, features prints from celebrated photographers like Steve McCurry, Joel Meyerowitz, Susan Meiselas, Alec Soth, and man…<br><a href=\"https://petapixel.com/2025/10/20/22-photos-from-magnums-new-square-print-sale-that-capture-spirit-of-youth/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/22-photos-from-magnums-new-square-print-sale-that-capture-spirit-of-youth/",
    "topic": "photo",
    "date": "2025-10-20T13:00:17.000Z"
  },
  {
    "title": "Viltrox Kicks Off New Compact Lens Series With $275 AF 85mm f/2 Evo",
    "q": "viltrox kicks off new compact lens series with $275 af 85mm f/2 evo camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Viltrox Kicks Off New Compact Lens Series With $275 AF 85mm f/2 Evo</b><br>Viltrox has announced a brand new series of fast, affordable full-frame prime lenses: Evo. The first lens in the series is the AF 85mm f/2 Evo for Sony E-mount, which the Chinese lens maker says \"redefines\" this essential portrait focal le…<br><a href=\"https://petapixel.com/2025/10/20/viltrox-kicks-off-new-compact-lens-series-with-275-af-85mm-f-2-evo/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/20/viltrox-kicks-off-new-compact-lens-series-with-275-af-85mm-f-2-evo/",
    "topic": "photo",
    "date": "2025-10-20T13:00:02.000Z"
  },
  {
    "title": "Photographer’s Once-in-a-Lifetime Shot of Lightning Sprites and the Milky Way",
    "q": "photographer’s once-in-a-lifetime shot of lightning sprites and the milky way camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer’s Once-in-a-Lifetime Shot of Lightning Sprites and the Milky Way</b><br>While out photographing the dark skies of New Zealand last weekend, the heavens aligned for Dan Zafra as he captured lightning sprites appearing in front of the galactic core of the Milky Way. [Read More]<br><a href=\"https://petapixel.com/2025/10/19/photographers-dan-zafra-once-in-a-lifetime-shot-of-lightning-sprites-and-the-milky-way/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/19/photographers-dan-zafra-once-in-a-lifetime-shot-of-lightning-sprites-and-the-milky-way/",
    "topic": "photo",
    "date": "2025-10-19T12:00:22.000Z"
  },
  {
    "title": "How to Elevate Your Travel Photography Beyond Vacation Snapshots",
    "q": "how to elevate your travel photography beyond vacation snapshots camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Elevate Your Travel Photography Beyond Vacation Snapshots</b><br>Travel photography is one of the most rewarding genres, as it allows you to use your image skills in new and exciting environments. But there is more to it than just creating vacation snaps. Here are some of my approaches to better travel …<br><a href=\"https://petapixel.com/2025/10/18/how-to-elevate-your-travel-photography-beyond-vacation-snapshots/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/18/how-to-elevate-your-travel-photography-beyond-vacation-snapshots/",
    "topic": "photo",
    "date": "2025-10-18T16:00:46.000Z"
  },
  {
    "title": "This 85mm lens might be Viltrox’s next Evo-lution",
    "q": "this 85mm lens might be viltrox’s next evo-lution camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This 85mm lens might be Viltrox’s next Evo-lution</b><br>Photo: Viltrox Viltrox has announced the first offering in a new lens lineup, the AF 85mm F2.0 Evo FE. The third-party lens maker is promising edge-to-edge clarity, fast autofocus, and a compact design from its latest prime lens for Sony f…<br><a href=\"https://www.dpreview.com/news/3445944863/viltrox-af-85mm-f2-evo-fe-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3445944863/viltrox-af-85mm-f2-evo-fe-lens-announcement",
    "topic": "photo",
    "date": "2025-10-20T13:00:00.000Z"
  },
  {
    "title": "Jungle specter: Photographing critically-endangered primates in the jungles of Vietnam",
    "q": "jungle specter: photographing critically-endangered primates in the jungles of vietnam camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Jungle specter: Photographing critically-endangered primates in the jungles of Vietnam</b><br>A huge silverback mountain gorilla weighing over 200kg (441lbs). Looking at it eye-to-eye, you simply can't deny we're related. Mgahinga National Park, Uganda. Canon EOS 5D IV + Canon 16–35mm F2.8 | F2.8 | 1/200 sec. | ISO 6400 Photo: Erez…<br><a href=\"https://www.dpreview.com/news/0005045289/photographing-critically-endangered-primates-in-the-jungles-of-vietnam\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0005045289/photographing-critically-endangered-primates-in-the-jungles-of-vietnam",
    "topic": "photo",
    "date": "2025-10-19T12:00:00.000Z"
  },
  {
    "title": "The Nikon Film and Photo Contest 2025 celebrates inspiration, from everyday beauty to moving short films",
    "q": "the nikon film and photo contest 2025 celebrates inspiration, from everyday beauty to moving short films camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Nikon Film and Photo Contest 2025 celebrates inspiration, from everyday beauty to moving short films</b><br>The 2024-2025 Nikon Film and Photo Contest winners have been announced, marking the 40th edition of the competition. This year's contest was based around the theme \"Inspire\" and drew submissions from 180 countries and regions around the wo…<br><a href=\"https://www.dpreview.com/articles/3877868612/nikon-film-and-photo-contest-2024-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3877868612/nikon-film-and-photo-contest-2024-2025",
    "topic": "photo",
    "date": "2025-10-18T13:00:00.000Z"
  },
  {
    "title": "Honor has a wild idea for getting steady smartphone shots",
    "q": "honor has a wild idea for getting steady smartphone shots camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Honor has a wild idea for getting steady smartphone shots</b><br>Image: Honor Chinese technology startup Honor has unveiled a CGI video teaser showcasing a concept smartphone with a gimbal-mounted camera. Honor has dubbed it the \"Robot Phone\" and says it will share additional details at Mobile World Con…<br><a href=\"https://www.dpreview.com/news/3385075551/honor-robot-phone-concept-smartphone-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3385075551/honor-robot-phone-concept-smartphone-teaser",
    "topic": "photo",
    "date": "2025-10-17T21:02:00.000Z"
  },
  {
    "title": "See the grain effect that's about to make the Nikon Zf even more retro",
    "q": "see the grain effect that's about to make the nikon zf even more retro camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>See the grain effect that's about to make the Nikon Zf even more retro</b><br>When you use DPReview links to buy products, the site may earn a commission. The ability to add a grain effect burnishes the Zf's retro credentials Photo: Richard Butler When Nikon showed us its two new DX lenses, it also let us try the Gr…<br><a href=\"https://www.dpreview.com/articles/0500232021/see-the-grain-effect-that-s-about-to-make-the-nikon-zf-even-more-retro\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0500232021/see-the-grain-effect-that-s-about-to-make-the-nikon-zf-even-more-retro",
    "topic": "photo",
    "date": "2025-10-17T14:00:00.000Z"
  },
  {
    "title": "What the FX do all the letters on Nikon's lenses mean?",
    "q": "what the fx do all the letters on nikon's lenses mean? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What the FX do all the letters on Nikon's lenses mean?</b><br>Image: Nikon While Nikon lens names may not be the most complicated out there (that award probably goes to Tamron), they still aren't short of letters and abbreviations. And while its mirrorless lenses feature more streamlined lens names t…<br><a href=\"https://www.dpreview.com/articles/5275380740/what-do-all-the-letters-mean-on-nikon-lenses\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5275380740/what-do-all-the-letters-mean-on-nikon-lenses",
    "topic": "photo",
    "date": "2025-10-17T13:00:00.000Z"
  },
  {
    "title": "Panasonic launches firmware, updates apps, gives the S9 an extra sheen and adds adventure (kits)",
    "q": "panasonic launches firmware, updates apps, gives the s9 an extra sheen and adds adventure (kits) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic launches firmware, updates apps, gives the S9 an extra sheen and adds adventure (kits)</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced a slew of updates, including firmware updates for cameras, added app features and a 'Titanium Gold' version of its S9 mir…<br><a href=\"https://www.dpreview.com/articles/9079513390/panasonic-updates-everything-s9-titanium-gold-adventure-kits-s5ii-s5iix-s1ii-s1rii-firmware\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9079513390/panasonic-updates-everything-s9-titanium-gold-adventure-kits-s5ii-s5iix-s1ii-s1rii-firmware",
    "topic": "photo",
    "date": "2025-10-16T14:00:00.000Z"
  },
  {
    "title": "Viltrox's new 50mm F1.4 Pro is light on your wallet, but heavy in your bag",
    "q": "viltrox's new 50mm f1.4 pro is light on your wallet, but heavy in your bag camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Viltrox's new 50mm F1.4 Pro is light on your wallet, but heavy in your bag</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Viltrox Sony mirrorless users now have another fast standard prime lens option thanks to Viltrox. The company has announced the AF 50mm F1.4 Pro lens, prom…<br><a href=\"https://www.dpreview.com/news/8654951917/viltrox-s-new-50mm-f1p4-pro-is-light-on-your-wallet-but-heavy-in-your-bag\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/8654951917/viltrox-s-new-50mm-f1p4-pro-is-light-on-your-wallet-but-heavy-in-your-bag",
    "topic": "photo",
    "date": "2025-10-16T13:00:00.000Z"
  },
  {
    "title": "Nikon is finally making a fast zoom for APS-C",
    "q": "nikon is finally making a fast zoom for aps-c camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon is finally making a fast zoom for APS-C</b><br>When you use DPReview links to buy products, the site may earn a commission. Nikon has announced the Nikkor Z DX 16-50mm (24-75 equiv.) F2.8 VR, its first APS-C zoom lens with a fast, constant aperture for its mirrorless Z mount. It's an i…<br><a href=\"https://www.dpreview.com/news/6644590313/nikon-announces-16-50mm-f2p8-vr-aps-c-lens\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6644590313/nikon-announces-16-50mm-f2p8-vr-aps-c-lens",
    "topic": "photo",
    "date": "2025-10-16T04:01:00.000Z"
  },
  {
    "title": "Nikon's 35mm Micro lens is made to get up close and personal",
    "q": "nikon's 35mm micro lens is made to get up close and personal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon's 35mm Micro lens is made to get up close and personal</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Nikon Nikon has announced the Nikkor Z DX Micro 35mm F1.7, an APS-C macro lens with a roughly 53mm equiv. focal length and the ability to focus on subjects…<br><a href=\"https://www.dpreview.com/news/9933786864/nikon-z-dx-35mm-micro-f1p7-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9933786864/nikon-z-dx-35mm-micro-f1p7-announcement",
    "topic": "photo",
    "date": "2025-10-16T04:01:00.000Z"
  },
  {
    "title": " Are you enough of a camera nerd to put one on your toilet? The Kohler Dekoda wants to look in your loo to track your poo ",
    "q": " are you enough of a camera nerd to put one on your toilet? the kohler dekoda wants to look in your loo to track your poo  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Are you enough of a camera nerd to put one on your toilet? The Kohler Dekoda wants to look in your loo to track your poo </b><br>The Kohler Health Dekoda is a smart device that decodes what's in your toilet bowl to track your gut health<br><a href=\"https://www.digitalcameraworld.com/tech/are-you-enough-of-a-camera-nerd-to-put-one-on-your-toilet-the-kohler-dekoda-wants-to-look-in-your-loo-to-track-your-poo\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/are-you-enough-of-a-camera-nerd-to-put-one-on-your-toilet-the-kohler-dekoda-wants-to-look-in-your-loo-to-track-your-poo",
    "topic": "photo",
    "date": "2025-10-20T16:49:00.000Z"
  },
  {
    "title": " As 60MP compact cameras make headlines, the best cameras on TIME's 2025 inventions list are retro-inspired tech  ",
    "q": " as 60mp compact cameras make headlines, the best cameras on time's 2025 inventions list are retro-inspired tech   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> As 60MP compact cameras make headlines, the best cameras on TIME's 2025 inventions list are retro-inspired tech  </b><br>TIME spotlights cameras that go the other way – combining notalgia, simplicity and innovation, like the Pentax 17 film camera, Kodak Charmera and more<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/as-60mp-compact-cameras-make-headlines-the-best-cameras-on-times-2025-inventions-list-are-retro-inspired-tech\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/as-60mp-compact-cameras-make-headlines-the-best-cameras-on-times-2025-inventions-list-are-retro-inspired-tech",
    "topic": "photo",
    "date": "2025-10-20T16:30:25.000Z"
  },
  {
    "title": " Learn the most important portrait photography techniques with the new edition of 'Mastering Portrait Photography' ",
    "q": " learn the most important portrait photography techniques with the new edition of 'mastering portrait photography'  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Learn the most important portrait photography techniques with the new edition of 'Mastering Portrait Photography' </b><br>Award-winning photographers Paul Wilkinson and Sarah Plater share their expert advice on lighting, posing, and capturing authentic portraits<br><a href=\"https://www.digitalcameraworld.com/photography/books/learn-the-most-important-portrait-photography-techniques-with-the-new-edition-of-mastering-portrait-photography\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/books/learn-the-most-important-portrait-photography-techniques-with-the-new-edition-of-mastering-portrait-photography",
    "topic": "photo",
    "date": "2025-10-20T15:32:39.000Z"
  },
  {
    "title": " Leica makes a limited edition camera that literally weighs a ton! ",
    "q": " leica makes a limited edition camera that literally weighs a ton!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Leica makes a limited edition camera that literally weighs a ton! </b><br>Dutch artist Casper Braat has carved a M11 Monochrom into marble… and Leica's selling ten copies for €50,000 each<br><a href=\"https://www.digitalcameraworld.com/cameras/leica-makes-a-limited-edition-camera-that-literally-weighs-a-ton\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/leica-makes-a-limited-edition-camera-that-literally-weighs-a-ton",
    "topic": "photo",
    "date": "2025-10-20T13:58:35.000Z"
  },
  {
    "title": " Own a Susan Meiselas or Joel Meyerowitz photo for $110 / £110 – Magnum Square Print Sale is on now ",
    "q": " own a susan meiselas or joel meyerowitz photo for $110 / £110 – magnum square print sale is on now  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Own a Susan Meiselas or Joel Meyerowitz photo for $110 / £110 – Magnum Square Print Sale is on now </b><br>Over 100 works by the iconic agency’s photographers appear in the 'Youth' sale, in partnership with the publisher Aperture, until October 26<br><a href=\"https://www.digitalcameraworld.com/printing/own-a-susan-meiselas-or-joel-meyerowitz-photo-for-usd110-gbp110-magnum-square-print-sale-is-on-now\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/printing/own-a-susan-meiselas-or-joel-meyerowitz-photo-for-usd110-gbp110-magnum-square-print-sale-is-on-now",
    "topic": "photo",
    "date": "2025-10-20T13:00:00.000Z"
  },
  {
    "title": " Are people still buying DSLR lenses in 2025? Sigma says yes – Tamron says no ",
    "q": " are people still buying dslr lenses in 2025? sigma says yes – tamron says no  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Are people still buying DSLR lenses in 2025? Sigma says yes – Tamron says no </b><br>Sigma's decade-old 150-600mm is still a best-seller, but Tamron exited DSLR production entirely. Let's explore what that means for the market<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/are-people-still-buying-dslr-lenses-in-2025-sigma-says-yes-tamron-says-no\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/are-people-still-buying-dslr-lenses-in-2025-sigma-says-yes-tamron-says-no",
    "topic": "photo",
    "date": "2025-10-20T12:07:53.000Z"
  },
  {
    "title": " Viltrox AF 85mm f/2.0 Evo review: evolution of the species ",
    "q": " viltrox af 85mm f/2.0 evo review: evolution of the species  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Viltrox AF 85mm f/2.0 Evo review: evolution of the species </b><br>The evolutionary Viltrox AF 85mm f/2.0 Evo is a relatively compact and lightweight yet sophisticated prime lens for Sony cameras<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/viltrox-af-85mm-f-2-0-evo-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/viltrox-af-85mm-f-2-0-evo-review",
    "topic": "photo",
    "date": "2025-10-20T12:00:00.000Z"
  },
  {
    "title": "6 Night Photography Ideas & Tips You Need to Try",
    "q": "6 night photography ideas & tips you need to try camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>6 Night Photography Ideas & Tips You Need to Try</b><br>Golden hour has just come to an end and the sky is slowly fading from a rich cyan to black, but that doesn’t mean it’s time to pack up your things and leave. Although natural light has its ethereal qualities, nighttime photography forces y…<br><a href=\"https://www.slrlounge.com/6-night-photography-tips-ideas-you-need-to-try/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/6-night-photography-tips-ideas-you-need-to-try/",
    "topic": "photo",
    "date": "2025-10-20T05:19:26.000Z"
  },
  {
    "title": "What You Should Check Before Taking a Photograph  | The C.A.M.P Framework",
    "q": "what you should check before taking a photograph  | the c.a.m.p framework camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What You Should Check Before Taking a Photograph  | The C.A.M.P Framework</b><br>We created a 4 step framework designed to help you get the most from every scene you step into!<br><a href=\"https://www.slrlounge.com/what-you-should-check-before-taking-a-photograph-the-c-a-m-p-framework/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/what-you-should-check-before-taking-a-photograph-the-c-a-m-p-framework/",
    "topic": "photo",
    "date": "2025-10-18T23:29:26.000Z"
  },
  {
    "title": "Artist Feature | How Misty Huss Reinvented Picture Day",
    "q": "artist feature | how misty huss reinvented picture day camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Artist Feature | How Misty Huss Reinvented Picture Day</b><br>Laid off in 2020, Colorado-based photographer Misty Huss was sending résumés into the void when her husband stopped her mid-scroll. “You’re an excellent photographer,” he said, “Go do that!” Days later, athletic directors began calling, an…<br><a href=\"https://www.slrlounge.com/artist-feature-how-misty-huss-reinvented-picture-day/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/artist-feature-how-misty-huss-reinvented-picture-day/",
    "topic": "photo",
    "date": "2025-10-17T15:00:00.000Z"
  },
  {
    "title": "Family Photography Tips and Inspiration",
    "q": "family photography tips and inspiration camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Family Photography Tips and Inspiration</b><br>Family Photography is one of most common genres of photography for amateurs, professionals, and weekend warriors because of its universal demand. Virtually everyone in this world wants a nice photo of their family, regardless of their budg…<br><a href=\"https://www.slrlounge.com/family-photography-tips-and-inspiration/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/family-photography-tips-and-inspiration/",
    "topic": "photo",
    "date": "2025-10-16T17:02:21.000Z"
  },
  {
    "title": "Nikon Expands APS-C Z-Mount Lineup with Two Versatile Lenses: 16-50mm f/2.8 VR and 35mm f/1.7 Macro",
    "q": "nikon expands aps-c z-mount lineup with two versatile lenses: 16-50mm f/2.8 vr and 35mm f/1.7 macro camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon Expands APS-C Z-Mount Lineup with Two Versatile Lenses: 16-50mm f/2.8 VR and 35mm f/1.7 Macro</b><br>Nikon is doubling down on its commitment to DX-format mirrorless users with the launch of two new NIKKOR Z lenses: the NIKKOR Z DX 16-50mm f/2.8 VR and the NIKKOR Z DX MC 35mm f/1.7. Both are compact, affordable, and designed to offer Z50,…<br><a href=\"https://www.slrlounge.com/nikon-expands-aps-c-z-mount-lineup-with-two-versatile-lenses-16-50mm-f-2-8-vr-and-35mm-f-1-7-macro/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/nikon-expands-aps-c-z-mount-lineup-with-two-versatile-lenses-16-50mm-f-2-8-vr-and-35mm-f-1-7-macro/",
    "topic": "photo",
    "date": "2025-10-16T13:42:00.000Z"
  },
  {
    "title": "8 Rainy Day Wedding Photography Tips You Need to Know",
    "q": "8 rainy day wedding photography tips you need to know camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>8 Rainy Day Wedding Photography Tips You Need to Know</b><br>Whenever we are faced with a wedding that has even the slightest chance of rain, we are reminded of a certain Boyz II Men song, because as they so beautifully sing, “Storms will come, but tell me, baby, can you stand the rain?” The true te…<br><a href=\"https://www.slrlounge.com/8-rainy-day-wedding-photography-tips-you-need-to-know/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/8-rainy-day-wedding-photography-tips-you-need-to-know/",
    "topic": "photo",
    "date": "2025-10-15T16:35:27.000Z"
  },
  {
    "title": "8 Tips on How To Get More Photography Clients",
    "q": "8 tips on how to get more photography clients camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>8 Tips on How To Get More Photography Clients</b><br>If you’re still struggling to get enough clients, know that it doesn’t have to be this way.<br><a href=\"https://www.slrlounge.com/5-ways-get-photography-clients/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/5-ways-get-photography-clients/",
    "topic": "photo",
    "date": "2025-10-14T22:32:26.000Z"
  },
  {
    "title": "Food Photography Tips | The Basics for Getting Started",
    "q": "food photography tips | the basics for getting started camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Food Photography Tips | The Basics for Getting Started</b><br>Food photography has been booming in the recent years, with many photographers ditching portrait and wedding gigs to concentrate their whole business solely on this niche.<br><a href=\"https://www.slrlounge.com/basics-food-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/basics-food-photography/",
    "topic": "photo",
    "date": "2025-10-14T16:23:27.000Z"
  },
  {
    "title": "PolarPro Spectra Center Split Filter (67 mm) Review",
    "q": "polarpro spectra center split filter (67 mm) review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PolarPro Spectra Center Split Filter (67 mm) Review</b><br>Do You Really Need Another Filter? Maybe You Do, Maybe you Don’t — Meet the PolarPro Spectra Centre Split Filter If you’re anything like me, you’ve probably got a drawer full of filters — ND, CPL, diffusion, star, you name it. So, do you r…<br><a href=\"https://photofocus.com/reviews/polarpro-spectra-center-split-filter-67-mm-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/polarpro-spectra-center-split-filter-67-mm-review/",
    "topic": "photo",
    "date": "2025-10-18T01:00:00.000Z"
  },
  {
    "title": "DxO PhotoLab 9.1 vs PhotoLab 8: Is the Upgrade Really Worth It?",
    "q": "dxo photolab 9.1 vs photolab 8: is the upgrade really worth it? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO PhotoLab 9.1 vs PhotoLab 8: Is the Upgrade Really Worth It?</b><br>DxO PhotoLab is DxO’s flagship RAW-development and photo editing software (non-destructive, with strong lens & camera correction capabilities, local adjustments, etc.). Over the years, its appeal has been in combining “optical corrections …<br><a href=\"https://photofocus.com/reviews/dxo-photolab-9-1-vs-photolab-8-is-the-upgrade-really-worth-it/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/dxo-photolab-9-1-vs-photolab-8-is-the-upgrade-really-worth-it/",
    "topic": "photo",
    "date": "2025-10-17T01:00:00.000Z"
  },
  {
    "title": "PGYTECH OneGo Lite Backpack Review: A Sleek Everyday Camera Bag for Creators",
    "q": "pgytech onego lite backpack review: a sleek everyday camera bag for creators camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PGYTECH OneGo Lite Backpack Review: A Sleek Everyday Camera Bag for Creators</b><br>If you’re anything like me, you probably already have a heap of different camera bags. Do you need one more? Maybe. Or perhaps you’re still searching for that perfect balance of size, functionality, and comfort? Then you might want to chec…<br><a href=\"https://photofocus.com/reviews/bags/pgytech-onego-lite-backpack-review-a-sleek-everyday-camera-bag-for-creators/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/bags/pgytech-onego-lite-backpack-review-a-sleek-everyday-camera-bag-for-creators/",
    "topic": "photo",
    "date": "2025-10-16T01:00:00.000Z"
  },
  {
    "title": "Neewer Q6 vs Q4: Which Studio Strobe Is Right for You?",
    "q": "neewer q6 vs q4: which studio strobe is right for you? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Q6 vs Q4: Which Studio Strobe Is Right for You?</b><br>When it comes to choosing the right studio strobe, the Neewer Q6 and Q4 are two powerful contenders that photographers often compare. Both offer excellent performance, but their differences in power, speed, battery life, and colour accurac…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-q6-vs-q4-which-studio-strobe-is-right-for-you/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-q6-vs-q4-which-studio-strobe-is-right-for-you/",
    "topic": "photo",
    "date": "2025-10-15T12:00:00.000Z"
  },
  {
    "title": "Exciting News: DxO FilmPack 8 Has Arrived!",
    "q": "exciting news: dxo filmpack 8 has arrived! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Exciting News: DxO FilmPack 8 Has Arrived!</b><br>As someone who adores blending the magic of old-school film with the freedom of digital, I couldn’t be more excited about the release of DxO FilmPack 8. This update is a true gift for photographers who love storytelling through mood, textu…<br><a href=\"https://photofocus.com/news/exciting-news-dxo-filmpack-8-has-arrived/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/exciting-news-dxo-filmpack-8-has-arrived/",
    "topic": "photo",
    "date": "2025-10-14T23:53:50.000Z"
  },
  {
    "title": "Pro technique: Rear curtain flash sync",
    "q": "pro technique: rear curtain flash sync camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Pro technique: Rear curtain flash sync</b><br>“Talk about a challenge! Inventor of the Platypod ecosystem, Dr. T asked me to push the envelope once again knowing I like a challenge. Nice background. Continuous LED panel light for blurred movement. Rear curtain sync flash lighting the …<br><a href=\"https://photofocus.com/photography/pro-technique-rear-curtain-flash-sync/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/pro-technique-rear-curtain-flash-sync/",
    "topic": "photo",
    "date": "2025-10-08T20:00:00.000Z"
  },
  {
    "title": "The power of looking up in architecture photography",
    "q": "the power of looking up in architecture photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The power of looking up in architecture photography</b><br>When it comes to architecture photography, looking up is inevitable. Towering skyscrapers will often force you to point your camera to their height. Some buildings and architectural elements also only reveal their full effect when viewed f…<br><a href=\"https://photofocus.com/inspiration/the-power-of-looking-up-in-architecture-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/inspiration/the-power-of-looking-up-in-architecture-photography/",
    "topic": "photo",
    "date": "2025-10-08T16:00:00.000Z"
  },
  {
    "title": "Travel tips for capturing the best of fall",
    "q": "travel tips for capturing the best of fall camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Travel tips for capturing the best of fall</b><br>When the weather cools down, the days get shorter and the leaves start to change color, for me, it’s time to hit the road for some R&R and to capture some of that fall color. Whether you’re camping or staying in motels, there are some grea…<br><a href=\"https://photofocus.com/photography/shooting-photography/travel-tips-for-capturing-the-best-of-fall/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/shooting-photography/travel-tips-for-capturing-the-best-of-fall/",
    "topic": "photo",
    "date": "2025-10-07T20:00:00.000Z"
  },
  {
    "title": "Review: Neewer X11 2-in-1 Teleprompter with Monitor",
    "q": "review: neewer x11 2-in-1 teleprompter with monitor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer X11 2-in-1 Teleprompter with Monitor</b><br>Interested in an inexpensive teleprompter with a monitor for content creation, professional video presentations, live streaming, and more? Neewer recently sent us an X11 2-In-1 Teleprompter with Monitor to try, and here’s what we found. No…<br><a href=\"https://photofocus.com/reviews/review-neewer-x11-2-in-1-teleprompter-with-monitor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-x11-2-in-1-teleprompter-with-monitor/",
    "topic": "photo",
    "date": "2025-10-06T16:00:00.000Z"
  },
  {
    "title": "Major AWS outage took down Fortnite, Alexa, Snapchat, and more",
    "q": "major aws outage took down fortnite, alexa, snapchat, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Major AWS outage took down Fortnite, Alexa, Snapchat, and more</b><br>Here are just a few of the services impacted by the outage. | Image: Downdetector A major Amazon Web Services (AWS) outage took down multiple online services for several hours this morning, including Amazon, Alexa, Snapchat, Fortnite, Chat…<br><a href=\"https://www.theverge.com/news/802486/aws-outage-alexa-fortnite-snapchat-offline\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/802486/aws-outage-alexa-fortnite-snapchat-offline",
    "topic": "it",
    "date": "2025-10-20T16:41:13.000Z"
  },
  {
    "title": "The Sims Mobile is shutting down next year",
    "q": "the sims mobile is shutting down next year windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Sims Mobile is shutting down next year</b><br>The Sims is in a period of transition — and as part of that, the ongoing mobile version will be shutting down in a few months. EA announced that today’s update for The Sims Mobile will be its last, and that on January 20th, 2026 the game “…<br><a href=\"https://www.theverge.com/games/802631/the-sims-mobile-shut-down-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/games/802631/the-sims-mobile-shut-down-2026",
    "topic": "it",
    "date": "2025-10-20T15:24:54.000Z"
  },
  {
    "title": "Meta is removing its Messenger apps for Windows and macOS",
    "q": "meta is removing its messenger apps for windows and macos windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Meta is removing its Messenger apps for Windows and macOS</b><br>Meta is getting ready to pull support for its desktop Messenger apps on Windows and macOS. Both apps have already been removed from the Microsoft Store and Mac App Store, and existing users are starting to get notifications that the deskto…<br><a href=\"https://www.theverge.com/news/802627/meta-messenger-app-removal-windows-macos\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/802627/meta-messenger-app-removal-windows-macos",
    "topic": "it",
    "date": "2025-10-20T15:09:26.000Z"
  },
  {
    "title": "Lenovo’s Legion 5 is a fast, OLED-equipped gaming laptop for $1,050",
    "q": "lenovo’s legion 5 is a fast, oled-equipped gaming laptop for $1,050 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Lenovo’s Legion 5 is a fast, OLED-equipped gaming laptop for $1,050</b><br>You can grab the AMD-based model or spend an extra $150 on the slightly faster Intel version, which has twice the internal storage. | Image: The Verge As part of our Amazon Prime Big Deal Days coverage earlier this month, I was tasked with…<br><a href=\"https://www.theverge.com/tech/802576/lenovo-legion-5-gaming-laptop-nvidia-rtx-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/802576/lenovo-legion-5-gaming-laptop-nvidia-rtx-deal-sale",
    "topic": "it",
    "date": "2025-10-20T14:48:01.000Z"
  },
  {
    "title": "Zocdoc CEO: ‘Dr. Google is going to be replaced by Dr. AI’",
    "q": "zocdoc ceo: ‘dr. google is going to be replaced by dr. ai’ windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Zocdoc CEO: ‘Dr. Google is going to be replaced by Dr. AI’</b><br>Today’s Decoder episode is a special one: I’m talking to Zocdoc CEO Oliver Kharraz, and we chatted live onstage at the TechFutures conference here in New York City. You’re almost certainly familiar with Zocdoc — it’s a platform that helps …<br><a href=\"https://www.theverge.com/podcast/801767/zocdoc-ceo-oliver-kharraz-ai-medical-healthcare-doctors\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/podcast/801767/zocdoc-ceo-oliver-kharraz-ai-medical-healthcare-doctors",
    "topic": "it",
    "date": "2025-10-20T14:00:00.000Z"
  },
  {
    "title": " Microsoft fixes one of its \"highest ever\" rated security flaws - here's what happened ",
    "q": " microsoft fixes one of its \"highest ever\" rated security flaws - here's what happened  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft fixes one of its \"highest ever\" rated security flaws - here's what happened </b><br>An “HTTP request smuggling bug” was found in ASP.NET Core that could allow different security bypasses.<br><a href=\"https://www.techradar.com/pro/security/microsoft-fixes-one-of-its-highest-ever-rated-security-flaws-heres-what-happened\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/microsoft-fixes-one-of-its-highest-ever-rated-security-flaws-heres-what-happened",
    "topic": "it",
    "date": "2025-10-20T16:27:00.000Z"
  },
  {
    "title": " \"We need to go beyond Signal\" – How today's AWS outage shows the weaknesses of centralized apps ",
    "q": " \"we need to go beyond signal\" – how today's aws outage shows the weaknesses of centralized apps  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> \"We need to go beyond Signal\" – How today's AWS outage shows the weaknesses of centralized apps </b><br>Signal's privacy and security are great, but being a centralized app makes it vulnerable. Element explains to TechRadar why we do need decentralized apps more than ever.<br><a href=\"https://www.techradar.com/vpn/vpn-privacy-security/we-need-to-go-beyond-signal-how-todays-aws-outage-shows-the-weaknesses-of-centralized-apps\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/vpn/vpn-privacy-security/we-need-to-go-beyond-signal-how-todays-aws-outage-shows-the-weaknesses-of-centralized-apps",
    "topic": "it",
    "date": "2025-10-20T16:17:13.000Z"
  },
  {
    "title": "A Hotfix Is Coming for a Windows 11 Security Update That Introduced Some Major Bugs",
    "q": "a hotfix is coming for a windows 11 security update that introduced some major bugs windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>A Hotfix Is Coming for a Windows 11 Security Update That Introduced Some Major Bugs</b><br>Microsoft is working on a solution for a security update that's causing multiple issues for some people.<br><a href=\"https://www.cnet.com/tech/services-and-software/a-hotfix-is-coming-for-a-windows-11-security-update-that-introduced-some-major-bugs/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/a-hotfix-is-coming-for-a-windows-11-security-update-that-introduced-some-major-bugs/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-10-20T17:34:41.000Z"
  },
  {
    "title": "Enter the Endless Night With This Sci-Fi Techno-Noir Thriller Now Streaming Free on Tubi",
    "q": "enter the endless night with this sci-fi techno-noir thriller now streaming free on tubi windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Enter the Endless Night With This Sci-Fi Techno-Noir Thriller Now Streaming Free on Tubi</b><br>In this '90s sci-fi cult classic, a man missing his memories must grapple with an enemy that can shift reality and the truth behind a city swathed in shadows.<br><a href=\"https://www.cnet.com/culture/entertainment/enter-the-endless-night-with-this-sci-fi-techno-noir-thriller-streaming-free-on-tubi/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/culture/entertainment/enter-the-endless-night-with-this-sci-fi-techno-noir-thriller-streaming-free-on-tubi/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-10-20T16:05:44.000Z"
  },
  {
    "title": "The Apple TV and Peacock Bundle Is Here",
    "q": "the apple tv and peacock bundle is here windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Apple TV and Peacock Bundle Is Here</b><br>A package of the two streaming services starts at $15 per month.<br><a href=\"https://www.cnet.com/tech/services-and-software/the-apple-tv-and-peacock-bundle-is-here/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/the-apple-tv-and-peacock-bundle-is-here/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-10-20T15:49:30.000Z"
  },
  {
    "title": " China says it has foiled a series U.S. cyberattacks on its critical infrastructure — Ministry of State Security says it has 'irrefutable evidence' NSA tried to cause 'international time chaos' ",
    "q": " china says it has foiled a series u.s. cyberattacks on its critical infrastructure — ministry of state security says it has 'irrefutable evidence' nsa tried to cause 'international time chaos'  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> China says it has foiled a series U.S. cyberattacks on its critical infrastructure — Ministry of State Security says it has 'irrefutable evidence' NSA tried to cause 'international time chaos' </b><br>China’s Ministry of State Security has taken to social media to boast about foiling a series of cyberattacks it says were directed by the U.S. National Security Agency.<br><a href=\"https://www.tomshardware.com/tech-industry/cyber-security/china-says-it-has-foiled-a-series-u-s-cyberattacks-on-its-critical-infrastructure-ministry-of-state-security-says-it-has-irrefutable-evidence-nsa-tried-to-cause-international-time-chaos\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/china-says-it-has-foiled-a-series-u-s-cyberattacks-on-its-critical-infrastructure-ministry-of-state-security-says-it-has-irrefutable-evidence-nsa-tried-to-cause-international-time-chaos",
    "topic": "it",
    "date": "2025-10-20T16:48:11.000Z"
  },
  {
    "title": " Microsoft let Asus set the prices for Xbox Rog Ally, confirms Xbox President — work on next-gen console hardware is already underway with AMD ",
    "q": " microsoft let asus set the prices for xbox rog ally, confirms xbox president — work on next-gen console hardware is already underway with amd  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft let Asus set the prices for Xbox Rog Ally, confirms Xbox President — work on next-gen console hardware is already underway with AMD </b><br>Xbox President Sarah Bond has just confirmed that Microsoft relied on Asus' experience in handhelds to help determine the price of the Xbox Ally. The team at Xbox is confident and proud of the device, with sold-out preorders. Sarah also ta…<br><a href=\"https://www.tomshardware.com/video-games/handheld-gaming/microsoft-let-asus-set-the-prices-for-xbox-rog-ally-confirms-xbox-president-work-on-next-gen-console-hardware-is-already-underway-with-amd\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/handheld-gaming/microsoft-let-asus-set-the-prices-for-xbox-rog-ally-confirms-xbox-president-work-on-next-gen-console-hardware-is-already-underway-with-amd",
    "topic": "it",
    "date": "2025-10-20T14:44:23.000Z"
  },
  {
    "title": " Microsoft denies Mexico data center linked to water shortages, local illnesses, and power outages — stomach bugs and even hepatitis reported in region as 1.5 Gigawatt AI data center buildout looms ",
    "q": " microsoft denies mexico data center linked to water shortages, local illnesses, and power outages — stomach bugs and even hepatitis reported in region as 1.5 gigawatt ai data center buildout looms  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft denies Mexico data center linked to water shortages, local illnesses, and power outages — stomach bugs and even hepatitis reported in region as 1.5 Gigawatt AI data center buildout looms </b><br>Microsoft has denied claims that its data center in central Mexico is tied to a recent spate of power outages, water shortages, and health concerns, claiming it always prioritizes the needs of local communities in any actions it takes.<br><a href=\"https://www.tomshardware.com/tech-industry/microsoft-denies-mexico-data-center-linked-to-water-shortages-local-illnesses-and-power-outages-stomach-bugs-and-even-hepatitis-reported-in-region-as-1-5-gigawatt-ai-data-center-buildout-looms\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/microsoft-denies-mexico-data-center-linked-to-water-shortages-local-illnesses-and-power-outages-stomach-bugs-and-even-hepatitis-reported-in-region-as-1-5-gigawatt-ai-data-center-buildout-looms",
    "topic": "it",
    "date": "2025-10-20T13:19:12.000Z"
  },
  {
    "title": "My 6 favorite Spotlight actions in MacOS Tahoe so far - and how to add your own",
    "q": "my 6 favorite spotlight actions in macos tahoe so far - and how to add your own windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>My 6 favorite Spotlight actions in MacOS Tahoe so far - and how to add your own</b><br>With MacOS Spotlight's major overhaul in Tahoe, there's a new feature you absolutely must try.<br><a href=\"https://www.zdnet.com/article/my-6-favorite-spotlight-actions-in-macos-tahoe-so-far-and-how-to-add-your-own/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/my-6-favorite-spotlight-actions-in-macos-tahoe-so-far-and-how-to-add-your-own/",
    "topic": "it",
    "date": "2025-10-20T18:11:44.000Z"
  },
  {
    "title": "I saw the future of Windows PCs - and it may finally be time to ditch my MacBook",
    "q": "i saw the future of windows pcs - and it may finally be time to ditch my macbook windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I saw the future of Windows PCs - and it may finally be time to ditch my MacBook</b><br>Qualcomm last month revealed its Snapdragon X2 Elite Extreme chipset, which promises major gains over Apple's M4.<br><a href=\"https://www.zdnet.com/article/i-saw-the-future-of-windows-pcs-and-it-may-finally-be-time-to-ditch-my-macbook/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/i-saw-the-future-of-windows-pcs-and-it-may-finally-be-time-to-ditch-my-macbook/",
    "topic": "it",
    "date": "2025-10-20T18:00:00.000Z"
  },
  {
    "title": "This is the only wireless charger that an Apple user will ever need - here's why",
    "q": "this is the only wireless charger that an apple user will ever need - here's why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This is the only wireless charger that an Apple user will ever need - here's why</b><br>Ugreen's MagFlow 3-in-1 charges an iPhone, Apple Watch, and AirPods wirelessly (and at full speed).<br><a href=\"https://www.zdnet.com/article/this-is-the-only-wireless-charger-that-an-apple-user-will-ever-need-heres-why/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/this-is-the-only-wireless-charger-that-an-apple-user-will-ever-need-heres-why/",
    "topic": "it",
    "date": "2025-10-20T17:00:27.000Z"
  },
  {
    "title": "I found the new Asmi Linux fast and fun to use - if you're not afraid of a little setup work",
    "q": "i found the new asmi linux fast and fun to use - if you're not afraid of a little setup work windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the new Asmi Linux fast and fun to use - if you're not afraid of a little setup work</b><br>Xfce is a unique desktop environment that offers serious flexibility and speed. Asmi Linux takes advantage of that to create a Linux distribution that, in theory, should work for anyone.<br><a href=\"https://www.zdnet.com/article/i-found-the-new-asmi-linux-fast-and-fun-to-use-if-youre-not-afraid-of-a-little-setup-work/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/i-found-the-new-asmi-linux-fast-and-fun-to-use-if-youre-not-afraid-of-a-little-setup-work/",
    "topic": "it",
    "date": "2025-10-20T16:47:23.000Z"
  },
  {
    "title": " Meta is killing Messenger on Windows — These secure messaging apps are a perfect replacement on PC ",
    "q": " meta is killing messenger on windows — these secure messaging apps are a perfect replacement on pc  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Meta is killing Messenger on Windows — These secure messaging apps are a perfect replacement on PC </b><br>Meta has announced that it will be deprecating its Messenger apps on Windows and macOS on December 15. Here's how to ensure you don't lose your chat history, as well as three great alternatives for your Windows PC.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/meta-messenger-app-windows-alternatives\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/meta-messenger-app-windows-alternatives",
    "topic": "it",
    "date": "2025-10-20T13:54:41.000Z"
  },
  {
    "title": " Windows 10 support has ended: Here's what you need to do going forward ",
    "q": " windows 10 support has ended: here's what you need to do going forward  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 10 support has ended: Here's what you need to do going forward </b><br>Windows 10 support ended on Tuesday, October 14. That means Windows 10 PCs will no longer receive security updates automatically, and you must take action to ensure these devices remain secure when connected to the internet.<br><a href=\"https://www.windowscentral.com/microsoft/windows-10/windows-10-eol-esu-faq\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-10/windows-10-eol-esu-faq",
    "topic": "it",
    "date": "2025-10-20T13:10:44.000Z"
  },
  {
    "title": " Microsoft highlights all the new features that have shipped on Windows 11 in 2025 — and promises more to come ",
    "q": " microsoft highlights all the new features that have shipped on windows 11 in 2025 — and promises more to come  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft highlights all the new features that have shipped on Windows 11 in 2025 — and promises more to come </b><br>2025 has been quite a busy year for Windows 11, with the OS receiving new features on an almost monthly basis. Now, Microsoft has published a handy recap of everything that has shipped so far.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-highlights-all-the-new-features-that-have-shipped-on-windows-11-in-2025-and-promises-more-to-come\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-highlights-all-the-new-features-that-have-shipped-on-windows-11-in-2025-and-promises-more-to-come",
    "topic": "it",
    "date": "2025-10-20T12:54:58.000Z"
  },
  {
    "title": " Microsoft triples down on Xbox hardware commitment, while also teasing first-party gaming handhelds — will it actually happen? ",
    "q": " microsoft triples down on xbox hardware commitment, while also teasing first-party gaming handhelds — will it actually happen?  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft triples down on Xbox hardware commitment, while also teasing first-party gaming handhelds — will it actually happen? </b><br>Rumors of Xbox's first-imposed demise have been greatly exaggerated, after Xbox president took to Variety to reiterate the firm's commitment to gaming hardware.<br><a href=\"https://www.windowscentral.com/gaming/xbox/microsoft-triples-down-on-xbox-hardware-commitment-while-also-teasing-first-party-gaming-handhelds-too-what-will-it-look-like-in-practice\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/microsoft-triples-down-on-xbox-hardware-commitment-while-also-teasing-first-party-gaming-handhelds-too-what-will-it-look-like-in-practice",
    "topic": "it",
    "date": "2025-10-20T08:58:41.000Z"
  },
  {
    "title": "Over 75,000 WatchGuard security devices vulnerable to critical RCE",
    "q": "over 75,000 watchguard security devices vulnerable to critical rce windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Over 75,000 WatchGuard security devices vulnerable to critical RCE</b><br>Nearly 76,000 WatchGuard Firebox network security appliances are exposed on the public web and still vulnerable to a critical issue (CVE-2025-9242) that could allow a remote attacker to execute code without authentication. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/over-75-000-watchguard-security-devices-vulnerable-to-critical-rce/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/over-75-000-watchguard-security-devices-vulnerable-to-critical-rce/",
    "topic": "it",
    "date": "2025-10-20T17:42:08.000Z"
  },
  {
    "title": "CISA: High-severity Windows SMB flaw now exploited in attacks",
    "q": "cisa: high-severity windows smb flaw now exploited in attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>CISA: High-severity Windows SMB flaw now exploited in attacks</b><br>CISA says threat actors are now actively exploiting a high-severity Windows SMB privilege escalation vulnerability that can let them gain SYSTEM privileges on unpatched systems. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/cisa-high-severity-windows-smb-flaw-now-exploited-in-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/cisa-high-severity-windows-smb-flaw-now-exploited-in-attacks/",
    "topic": "it",
    "date": "2025-10-20T17:18:16.000Z"
  },
  {
    "title": "Self-spreading GlassWorm malware hits OpenVSX,  VS Code registries",
    "q": "self-spreading glassworm malware hits openvsx,  vs code registries windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Self-spreading GlassWorm malware hits OpenVSX,  VS Code registries</b><br>A new and ongoing supply-chain attack is targeting developers on the OpenVSX and Microsoft Visual Studio marketplaces with self-spreading malware called GlassWorm that has been installed an estimated 35,800 times. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/self-spreading-glassworm-malware-hits-openvsx-vs-code-registries/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/self-spreading-glassworm-malware-hits-openvsx-vs-code-registries/",
    "topic": "it",
    "date": "2025-10-20T16:13:20.000Z"
  },
  {
    "title": "Microsoft fixes Windows Server Active Directory sync issues",
    "q": "microsoft fixes windows server active directory sync issues windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft fixes Windows Server Active Directory sync issues</b><br>Microsoft is rolling out a fix for Active Directory issues affecting some Windows Server 2025 systems after installing security updates released since September. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-active-directory-sync-issues/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-server-active-directory-sync-issues/",
    "topic": "it",
    "date": "2025-10-20T15:58:21.000Z"
  },
  {
    "title": "Microsoft warns of Windows smart card auth issues after October updates",
    "q": "microsoft warns of windows smart card auth issues after october updates windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft warns of Windows smart card auth issues after October updates</b><br>Microsoft says the October 2025 Windows security updates are causing smart card authentication and certificate issues due to a change designed to strengthen the Windows Cryptographic Services. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-october-security-updates-cause-windows-smart-card-auth-issues/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-october-security-updates-cause-windows-smart-card-auth-issues/",
    "topic": "it",
    "date": "2025-10-20T14:21:54.000Z"
  },
  {
    "title": "Find hidden malicious OAuth apps in Microsoft 365 using Cazadora",
    "q": "find hidden malicious oauth apps in microsoft 365 using cazadora windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Find hidden malicious OAuth apps in Microsoft 365 using Cazadora</b><br>Malicious OAuth apps can hide inside Microsoft 365 tenants. Huntress Labs' Cazadora script helps uncover rogue apps before they lead to a breach. Dive deeper in their Tradecraft Tuesday sessions. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/find-hidden-malicious-oauth-apps-in-microsoft-365-using-cazadora/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/find-hidden-malicious-oauth-apps-in-microsoft-365-using-cazadora/",
    "topic": "it",
    "date": "2025-10-20T14:00:10.000Z"
  },
  {
    "title": "TikTok videos continue to push infostealers in ClickFix attacks",
    "q": "tiktok videos continue to push infostealers in clickfix attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>TikTok videos continue to push infostealers in ClickFix attacks</b><br>Cybercriminals are using TikTok videos disguised as free activation guides for popular software like Windows, Spotify, and Netflix to spread information-stealing malware. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/tiktok-videos-continue-to-push-infostealers-in-clickfix-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/tiktok-videos-continue-to-push-infostealers-in-clickfix-attacks/",
    "topic": "it",
    "date": "2025-10-19T18:28:25.000Z"
  },
  {
    "title": "Amazon's DNS Bug Just Broke the Internet",
    "q": "amazon's dns bug just broke the internet windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Amazon's DNS Bug Just Broke the Internet</b><br>It's always DNS.<br><a href=\"https://www.howtogeek.com/amazons-dns-bug-just-broke-the-internet/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/amazons-dns-bug-just-broke-the-internet/",
    "topic": "it",
    "date": "2025-10-20T17:28:12.000Z"
  },
  {
    "title": "Forget Microsoft Word: Here's Why I Do All My Writing in Markdown",
    "q": "forget microsoft word: here's why i do all my writing in markdown windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Forget Microsoft Word: Here's Why I Do All My Writing in Markdown</b><br>Markdown: clean, simple, unbeatable.<br><a href=\"https://www.howtogeek.com/forget-word-write-markdown/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/forget-word-write-markdown/",
    "topic": "it",
    "date": "2025-10-20T17:00:16.000Z"
  },
  {
    "title": "These 5 Hidden Windows 11 Settings Instantly Made My PC Faster",
    "q": "these 5 hidden windows 11 settings instantly made my pc faster windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These 5 Hidden Windows 11 Settings Instantly Made My PC Faster</b><br>These settings will give your PC a boost.<br><a href=\"https://www.howtogeek.com/these-hidden-windows-11-settings-instantly-made-my-pc-faster/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/these-hidden-windows-11-settings-instantly-made-my-pc-faster/",
    "topic": "it",
    "date": "2025-10-20T16:30:15.000Z"
  },
  {
    "title": "Open Source Streaming Server Jellyfin Just Dropped a Big Update",
    "q": "open source streaming server jellyfin just dropped a big update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Open Source Streaming Server Jellyfin Just Dropped a Big Update</b><br>Jellyfin's latest release brings resilience and speed to your media server.<br><a href=\"https://www.howtogeek.com/jellyfin-10-11-0-released/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/jellyfin-10-11-0-released/",
    "topic": "it",
    "date": "2025-10-20T15:59:16.000Z"
  },
  {
    "title": "Simplewall is the Windows Firewall tuning tool everyone needs",
    "q": "simplewall is the windows firewall tuning tool everyone needs windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Simplewall is the Windows Firewall tuning tool everyone needs</b><br>It's the same thing, but different<br><a href=\"https://www.xda-developers.com/simplewall-windows-firewall-tuning-tool/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/simplewall-windows-firewall-tuning-tool/",
    "topic": "it",
    "date": "2025-10-20T12:00:19.000Z"
  }
]