[
  {
    "title": "Oppo Find X9 Pro Review: This Phone Rocks for Photography",
    "q": "oppo find x9 pro review: this phone rocks for photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Oppo Find X9 Pro Review: This Phone Rocks for Photography</b><br>Come in for the camera but stick around for the battery life. That’s one way to sum up the Oppo Find X9 Pro, a flagship smartphone that makes a strong case for being one of the top three in the world. And with a global version available, t…<br><a href=\"https://petapixel.com/2025/12/01/oppo-find-x9-pro-review-this-phone-rocks-for-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/oppo-find-x9-pro-review-this-phone-rocks-for-photography/",
    "topic": "photo",
    "date": "2025-12-01T17:57:09.000Z"
  },
  {
    "title": "Pergear’s Fast New 50mm f/1.2 APS-C Lens Costs Under $100",
    "q": "pergear’s fast new 50mm f/1.2 aps-c lens costs under $100 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Pergear’s Fast New 50mm f/1.2 APS-C Lens Costs Under $100</b><br>Fast prime lenses don't need to break the bank. Pergear has announced a new 50mm f/1.2 manual-focus prime lens for APS-C mirrorless cameras, priced under $100. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/pergears-fast-new-50mm-f-1-2-aps-c-lens-costs-under-100/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/pergears-fast-new-50mm-f-1-2-aps-c-lens-costs-under-100/",
    "topic": "photo",
    "date": "2025-12-01T17:32:15.000Z"
  },
  {
    "title": "San Francisco Names Yet Another Street After a Legendary Photographer",
    "q": "san francisco names yet another street after a legendary photographer camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>San Francisco Names Yet Another Street After a Legendary Photographer</b><br>Legendary rock 'n' roll photographer Jim Marshall is to have a street named after him in San Francisco, close to his apartment where musicians would frequently mingle. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/san-francisco-names-street-after-photographer-jim-marshall/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/san-francisco-names-street-after-photographer-jim-marshall/",
    "topic": "photo",
    "date": "2025-12-01T16:18:16.000Z"
  },
  {
    "title": "Secret WWII Resistance Photo Album Found Beneath Apartment Floorboards",
    "q": "secret wwii resistance photo album found beneath apartment floorboards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Secret WWII Resistance Photo Album Found Beneath Apartment Floorboards</b><br>A secret cache of World War II photographs of the resistance has been found beneath the floorboards of an apartment, where the album had been concealed in Nazi-occupied Poland. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/secret-wwii-resistance-photo-album-found-beneath-apartment-floorboards/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/secret-wwii-resistance-photo-album-found-beneath-apartment-floorboards/",
    "topic": "photo",
    "date": "2025-12-01T15:18:46.000Z"
  },
  {
    "title": "This Colorful Joel Meyerowitz Photo Is the Leica Picture of the Year 2025",
    "q": "this colorful joel meyerowitz photo is the leica picture of the year 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Colorful Joel Meyerowitz Photo Is the Leica Picture of the Year 2025</b><br>American photographer Joel Meyerowitz (b. 1938) has been an exceptionally influential photographer since the 1960s. He helped color photography earn respect in fine art circles, and his street photography exudes unmistakable style. One of …<br><a href=\"https://petapixel.com/2025/12/01/this-colorful-joel-meyerowitz-photo-is-the-leica-picture-of-the-year-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/this-colorful-joel-meyerowitz-photo-is-the-leica-picture-of-the-year-2025/",
    "topic": "photo",
    "date": "2025-12-01T14:00:18.000Z"
  },
  {
    "title": "Seth Rogen is Really into His Panoramic Film Photography",
    "q": "seth rogen is really into his panoramic film photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Seth Rogen is Really into His Panoramic Film Photography</b><br>You might know funny man Seth Rogen from his hit comedy movies from the 2000s or from Apple TV's new series The Studio. But the Canadian actor recently revealed that he is also an enthusiastic photographer -- specifically panoramic film ph…<br><a href=\"https://petapixel.com/2025/12/01/seth-rogen-is-really-into-his-panoramic-film-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/seth-rogen-is-really-into-his-panoramic-film-photography/",
    "topic": "photo",
    "date": "2025-12-01T13:05:08.000Z"
  },
  {
    "title": "The Curious Fujifilm X half Camera is Heavily Discounted Right Now",
    "q": "the curious fujifilm x half camera is heavily discounted right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Curious Fujifilm X half Camera is Heavily Discounted Right Now</b><br>When the Fujifilm X half was announced earlier this year it caused a stir for the digital camera's salute to analog photography. But that wasn't all -- the price raised eyebrows, too. [Read More]<br><a href=\"https://petapixel.com/2025/12/01/the-curious-fujifilm-x-half-camera-is-heavily-discounted-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/12/01/the-curious-fujifilm-x-half-camera-is-heavily-discounted-right-now/",
    "topic": "photo",
    "date": "2025-12-01T11:29:36.000Z"
  },
  {
    "title": "How a 150MP Medium-Format Camera Preserves Japan’s Historic Manga",
    "q": "how a 150mp medium-format camera preserves japan’s historic manga camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How a 150MP Medium-Format Camera Preserves Japan’s Historic Manga</b><br>For many, digital cameras are tools for creating art. However, in some very specialized applications, high-resolution digital cameras are used to preserve it. In Japan, Shueisha Manga-Art Heritage is using 150-megapixel Phase One medium-fo…<br><a href=\"https://petapixel.com/2025/11/30/how-a-150mp-medium-format-camera-preserves-japans-historic-manga/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/how-a-150mp-medium-format-camera-preserves-japans-historic-manga/",
    "topic": "photo",
    "date": "2025-11-30T19:00:51.000Z"
  },
  {
    "title": "DPReview Annual Awards: The best photography gear of 2025",
    "q": "dpreview annual awards: the best photography gear of 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Annual Awards: The best photography gear of 2025</b><br>The 2025 DPReview Annual Awards After careful consideration, healthy debate and a few heated arguments, we're proud to announce the winners of the 2025 DPReview Annual Awards. While innovation in the camera industry is often a gradual proc…<br><a href=\"https://www.dpreview.com/articles/4997046801/dpreview-annual-awards-the-best-photography-gear-of-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4997046801/dpreview-annual-awards-the-best-photography-gear-of-2025",
    "topic": "photo",
    "date": "2025-12-01T14:00:00.000Z"
  },
  {
    "title": "Reader photos of the year: Show us your best shot from 2025",
    "q": "reader photos of the year: show us your best shot from 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Reader photos of the year: Show us your best shot from 2025</b><br>Mt. Jefferson, a volcano in the Cascade Mountains, is illuminated at sunset near Sisters, Oregon, on November 18, 2025. I had my Olympus OM-1 with me when the sunset suddenly became very intense, and I managed to snap this photo in the bri…<br><a href=\"https://www.dpreview.com/articles/3951182772/reader-photos-of-the-year-2025-announced\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3951182772/reader-photos-of-the-year-2025-announced",
    "topic": "photo",
    "date": "2025-12-01T14:00:00.000Z"
  },
  {
    "title": "Compact camera bonanza: 20 standout shots from our November Editors' photo challenge",
    "q": "compact camera bonanza: 20 standout shots from our november editors' photo challenge camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Compact camera bonanza: 20 standout shots from our November Editors' photo challenge</b><br>The October Editors' photo challenge The theme for our November Editor's photo challenge was \"Compact Camera Bonanza.\" For this challenge, we asked you to share photos taken with compact, or fixed-lens, cameras, and wow, did you deliver! W…<br><a href=\"https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge",
    "topic": "photo",
    "date": "2025-11-30T14:00:00.000Z"
  },
  {
    "title": "Do you need to learn Manual mode right away?",
    "q": "do you need to learn manual mode right away? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do you need to learn Manual mode right away?</b><br>Photo: Abby Ferguson If you're a beginner photographer who spends any time on the internet, chances are you've been bombarded with content saying that you need to learn Manual mode immediately. It's a frequent refrain that \"real\" photograp…<br><a href=\"https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": " I’m a pro photographer and a mom of three. These are the only kid camera deals that I’d consider adding to my cart ",
    "q": " i’m a pro photographer and a mom of three. these are the only kid camera deals that i’d consider adding to my cart  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I’m a pro photographer and a mom of three. These are the only kid camera deals that I’d consider adding to my cart </b><br>As both a photographer and a parent, these are the only kids' camera deals I'd consider for gifting this holiday season<br><a href=\"https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/im-a-pro-photographer-and-a-mom-of-three-these-are-the-only-kid-camera-deals-that-id-consider-adding-to-my-cart\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/im-a-pro-photographer-and-a-mom-of-three-these-are-the-only-kid-camera-deals-that-id-consider-adding-to-my-cart",
    "topic": "photo",
    "date": "2025-12-01T18:08:42.000Z"
  },
  {
    "title": " I've found the best Nikon Z6 III and kit lens deal, and it isn't the one you think ",
    "q": " i've found the best nikon z6 iii and kit lens deal, and it isn't the one you think  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I've found the best Nikon Z6 III and kit lens deal, and it isn't the one you think </b><br>If you're looking to get a Nikon Z6 III, you'll save money with a kit lens, but I reckon the Z 24-120mm f/4 S is the best choice, especially at this price…<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/ive-found-the-best-nikon-z6-iii-and-kit-lens-deal-and-it-isnt-the-one-you-think\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/ive-found-the-best-nikon-z6-iii-and-kit-lens-deal-and-it-isnt-the-one-you-think",
    "topic": "photo",
    "date": "2025-12-01T17:21:15.000Z"
  },
  {
    "title": " I've found the best Nikon Z6 III and kit lens deal, and it's not the one you think ",
    "q": " i've found the best nikon z6 iii and kit lens deal, and it's not the one you think  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I've found the best Nikon Z6 III and kit lens deal, and it's not the one you think </b><br>If you're looking to get a Nikon Z6 III, you'll save money with a kit lens, but I reckon the Z 24-120mm f/4 S is the best choice, especially at this price…<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/ive-found-the-best-nikon-z6-iii-and-kit-lens-deal-and-its-not-the-one-you-think\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/ive-found-the-best-nikon-z6-iii-and-kit-lens-deal-and-its-not-the-one-you-think",
    "topic": "photo",
    "date": "2025-12-01T17:13:22.000Z"
  },
  {
    "title": " Quietly, while we weren't watching, Kodak has become a major force in photography again. These are the five cameras leading the fightback ",
    "q": " quietly, while we weren't watching, kodak has become a major force in photography again. these are the five cameras leading the fightback  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Quietly, while we weren't watching, Kodak has become a major force in photography again. These are the five cameras leading the fightback </b><br>The popular myth is that Kodak cameras were killed off by digital... but the truth is that Kodak is now leading the rise of the pocket camera once again<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/quietly-while-we-werent-watching-kodak-has-become-a-major-force-in-photography-again-these-are-the-five-cameras-leading-the-fightback\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/quietly-while-we-werent-watching-kodak-has-become-a-major-force-in-photography-again-these-are-the-five-cameras-leading-the-fightback",
    "topic": "photo",
    "date": "2025-12-01T16:32:43.000Z"
  },
  {
    "title": " This compact camera features a 30x optical zoom and is No.1 on Japan's top 10 bestseller list ",
    "q": " this compact camera features a 30x optical zoom and is no.1 on japan's top 10 bestseller list  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This compact camera features a 30x optical zoom and is No.1 on Japan's top 10 bestseller list </b><br>Yodobashi's November compact camera ranking reveals: this travel-friendly camera beats even Ricoh's street photography favorite<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/this-compact-camera-features-a-30x-optical-zoom-and-is-no-1-on-japans-top-10-bestseller-list\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/this-compact-camera-features-a-30x-optical-zoom-and-is-no-1-on-japans-top-10-bestseller-list",
    "topic": "photo",
    "date": "2025-12-01T15:58:49.000Z"
  },
  {
    "title": " This compact retro mirrorless has a secret coupon, putting a five-star camera at its lowest-ever price ",
    "q": " this compact retro mirrorless has a secret coupon, putting a five-star camera at its lowest-ever price  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This compact retro mirrorless has a secret coupon, putting a five-star camera at its lowest-ever price </b><br>The OM System OM-3 is a retro mirrorless with flagship-level tech – and a hidden coupon that beats Amazon's lowest-ever price<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/this-compact-retro-mirrorless-has-a-secret-coupon-putting-a-five-star-camera-at-its-lowest-ever-price\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/this-compact-retro-mirrorless-has-a-secret-coupon-putting-a-five-star-camera-at-its-lowest-ever-price",
    "topic": "photo",
    "date": "2025-12-01T15:21:13.000Z"
  },
  {
    "title": " Quietly, while we weren't watching, Kodak has become a major force in photography again. These are five cameras leading the fightback ",
    "q": " quietly, while we weren't watching, kodak has become a major force in photography again. these are five cameras leading the fightback  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Quietly, while we weren't watching, Kodak has become a major force in photography again. These are five cameras leading the fightback </b><br>The popular myth is that Kodak cameras were killed off by digital... but the truth is that Kodak is now leading the rise of the pocket camera once again<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/quietly-while-we-werent-watching-kodak-has-become-a-major-force-in-photography-again-these-are-five-cameras-leading-the-fightback\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/quietly-while-we-werent-watching-kodak-has-become-a-major-force-in-photography-again-these-are-five-cameras-leading-the-fightback",
    "topic": "photo",
    "date": "2025-12-01T15:17:53.000Z"
  },
  {
    "title": "7 Winter Photography Tips, Ideas, and Examples",
    "q": "7 winter photography tips, ideas, and examples camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>7 Winter Photography Tips, Ideas, and Examples</b><br>If you think wintertime is an excuse to put your camera away and stay warm indoors, then you need to read this article! Winter photography can be one of the most rewarding challenges in photography, whether you are interested in landscapes…<br><a href=\"https://www.slrlounge.com/winter-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/winter-photography/",
    "topic": "photo",
    "date": "2025-12-01T18:14:14.000Z"
  },
  {
    "title": "Fitness Photography Tips: How to Images with Interest and Impact",
    "q": "fitness photography tips: how to images with interest and impact camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fitness Photography Tips: How to Images with Interest and Impact</b><br>Here a few simple tips to help you chisel out the human body using dramatic highlights and shadows, perfect for athletic and fitness portraiture.<br><a href=\"https://www.slrlounge.com/3-tips-for-dramatic-fitness-and-athletic-portraiture/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/3-tips-for-dramatic-fitness-and-athletic-portraiture/",
    "topic": "photo",
    "date": "2025-12-01T18:11:58.000Z"
  },
  {
    "title": "Newborn Photography Props and Ideas",
    "q": "newborn photography props and ideas camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Newborn Photography Props and Ideas</b><br>When it comes to producing great newborn photography images, creative newborn photography props and ideas can be the difference between an amateur photo and a high-quality, professional photo. Afterall, you could have all of the best camer…<br><a href=\"https://www.slrlounge.com/newborn-photography-props-ideas/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/newborn-photography-props-ideas/",
    "topic": "photo",
    "date": "2025-12-01T02:04:26.000Z"
  },
  {
    "title": "Fall Children’s Portrait Photography Tutorial",
    "q": "fall children’s portrait photography tutorial camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fall Children’s Portrait Photography Tutorial</b><br>We're going to create a rich, Autumn-toned portrait, from start to finish.<br><a href=\"https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/",
    "topic": "photo",
    "date": "2025-11-30T06:06:28.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "Why IBM CEO Arvind Krishna is still hiring humans in the AI era",
    "q": "why ibm ceo arvind krishna is still hiring humans in the ai era windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Why IBM CEO Arvind Krishna is still hiring humans in the AI era</b><br>Today, I’m talking with Arvind Krishna, the CEO of IBM. IBM is a fascinating company. It’s still a household name and among the oldest tech firms in the US. Without IBM, we simply wouldn’t have the modern era of computing — it was instrume…<br><a href=\"https://www.theverge.com/podcast/829868/ibm-arvind-krishna-watson-llms-ai-bubble-quantum-computing\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/podcast/829868/ibm-arvind-krishna-watson-llms-ai-bubble-quantum-computing",
    "topic": "it",
    "date": "2025-12-01T15:00:00.000Z"
  },
  {
    "title": "GE’s indoor food smoker is cheaper than ever this Cyber Monday",
    "q": "ge’s indoor food smoker is cheaper than ever this cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>GE’s indoor food smoker is cheaper than ever this Cyber Monday</b><br>GE’s Profile Smart Indoor Smoker is $424.15 for Cyber Monday. GE’s Profile smart indoor smoker can help pitmasters stave off the winter cooking blues, and it’s $424.15 ($275 off) at Amazon during Cyber Monday. The countertop appliance uses…<br><a href=\"https://www.theverge.com/gadgets/834666/ge-profile-smart-indoor-smoker-cyber-monday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834666/ge-profile-smart-indoor-smoker-cyber-monday-deal-sale",
    "topic": "it",
    "date": "2025-12-01T15:00:00.000Z"
  },
  {
    "title": "These great Cyber Monday tech deals will likely be gone tomorrow",
    "q": "these great cyber monday tech deals will likely be gone tomorrow windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These great Cyber Monday tech deals will likely be gone tomorrow</b><br>December is kicking off with a bang. Cyber Monday is today, and it’s one of your last chances to score major deals before the holiday rush plows us all over. It’s a great moment to snag gadgets — many of which have been tested by The Verge…<br><a href=\"https://www.theverge.com/gadgets/834422/cyber-monday-2025-best-deals-tech-gadgets-gift-ideas\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834422/cyber-monday-2025-best-deals-tech-gadgets-gift-ideas",
    "topic": "it",
    "date": "2025-12-01T14:36:24.000Z"
  },
  {
    "title": "Apple’s M2 MacBook Air is just $599 during Cyber Monday",
    "q": "apple’s m2 macbook air is just $599 during cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple’s M2 MacBook Air is just $599 during Cyber Monday</b><br>The 13-inch M2 MacBook Air is down to $599 for Cyber Monday. While Walmart continues to sell the 2020 M1 MacBook Air for $549, Best Buy is upping the ante for Cyber Monday with a sweet doorbuster deal on Apple’s 13-inch M2 MacBook Air that…<br><a href=\"https://www.theverge.com/gadgets/834693/apple-m2-macbook-air-cyber-monday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834693/apple-m2-macbook-air-cyber-monday-deal-sale",
    "topic": "it",
    "date": "2025-12-01T12:30:00.000Z"
  },
  {
    "title": "Welcome to fandom’s AI clout economy",
    "q": "welcome to fandom’s ai clout economy windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Welcome to fandom’s AI clout economy</b><br>Madison Lawrence Tabbey was scrolling through X in late October when a post from a Wicked update account caught her attention. Ariana Grande, who stars in the movies as Glinda, had just liked a meme on Instagram about never wanting to see …<br><a href=\"https://www.theverge.com/ai-artificial-intelligence/830876/influencers-anti-ai-deepfakes-fandom-economy\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/ai-artificial-intelligence/830876/influencers-anti-ai-deepfakes-fandom-economy",
    "topic": "it",
    "date": "2025-12-01T12:00:00.000Z"
  },
  {
    "title": " HP Omnibook X Flip vs MacBook Air: which of these two discounted laptops should you buy this Cyber Monday? ",
    "q": " hp omnibook x flip vs macbook air: which of these two discounted laptops should you buy this cyber monday?  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> HP Omnibook X Flip vs MacBook Air: which of these two discounted laptops should you buy this Cyber Monday? </b><br>Save almost half off the HP Omnibook X Flip – this is a Cyber Monday laptop deal you won't want to miss.<br><a href=\"https://www.techradar.com/computing/laptops/hp-omnibook-x-flip-vs-macbook-air-which-of-these-two-discounted-laptops-should-you-buy-this-cyber-monday\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/laptops/hp-omnibook-x-flip-vs-macbook-air-which-of-these-two-discounted-laptops-should-you-buy-this-cyber-monday",
    "topic": "it",
    "date": "2025-12-01T18:25:24.000Z"
  },
  {
    "title": " Windows 11 bug causes password sign-in icon to turn invisible – but don't worry, Microsoft reassures, just keep clicking, and you'll find it ",
    "q": " windows 11 bug causes password sign-in icon to turn invisible – but don't worry, microsoft reassures, just keep clicking, and you'll find it  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 bug causes password sign-in icon to turn invisible – but don't worry, Microsoft reassures, just keep clicking, and you'll find it </b><br>Windows Hello password icon has somehow turned invisible – and if this glitch is odd, Microsoft's advice is even weirder.<br><a href=\"https://www.techradar.com/computing/windows/windows-11-bug-causes-password-sign-in-icon-to-turn-invisible-but-dont-worry-microsoft-reassures-just-keep-clicking-and-youll-find-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/windows-11-bug-causes-password-sign-in-icon-to-turn-invisible-but-dont-worry-microsoft-reassures-just-keep-clicking-and-youll-find-it",
    "topic": "it",
    "date": "2025-12-01T17:21:23.000Z"
  },
  {
    "title": "Amazon's best 2025 Cyber Monday deals are live: Shop my top sales on Apple, Oura, and Bose",
    "q": "amazon's best 2025 cyber monday deals are live: shop my top sales on apple, oura, and bose windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Amazon's best 2025 Cyber Monday deals are live: Shop my top sales on Apple, Oura, and Bose</b><br>Amazon's Cyber Monday sale is here. These are the top deals I've uncovered so far, like the Hisense Canvas TV for $350 off.<br><a href=\"https://www.zdnet.com/article/cyber-monday-amazon-deals-ps5-earbuds-tvs-12-1/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-amazon-deals-ps5-earbuds-tvs-12-1/",
    "topic": "it",
    "date": "2025-12-01T18:26:02.000Z"
  },
  {
    "title": "Cyber Monday deals are huge in 2025: Shop my favorite deals from Amazon, Best Buy, Lowe's & more",
    "q": "cyber monday deals are huge in 2025: shop my favorite deals from amazon, best buy, lowe's & more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Cyber Monday deals are huge in 2025: Shop my favorite deals from Amazon, Best Buy, Lowe's & more</b><br>Black Friday is over, and Cyber Monday has arrived. Every major retailer is offering big sales on items from Apple, Samsung, LG, Roku, and more.<br><a href=\"https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-12-1/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-12-1/",
    "topic": "it",
    "date": "2025-12-01T18:18:00.000Z"
  },
  {
    "title": "I've used every immutable Linux distro, and this is the one I'd install today - here's why",
    "q": "i've used every immutable linux distro, and this is the one i'd install today - here's why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I've used every immutable Linux distro, and this is the one I'd install today - here's why</b><br>The latest release of Ultramarine makes one very big change - and it's good news for new and experienced Linux users.<br><a href=\"https://www.zdnet.com/article/ive-used-every-immutable-linux-distro-and-this-is-the-one-id-install-today-heres-why/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/ive-used-every-immutable-linux-distro-and-this-is-the-one-id-install-today-heres-why/",
    "topic": "it",
    "date": "2025-12-01T18:08:02.000Z"
  },
  {
    "title": "I found the best Cyber Monday Apple Watch deals",
    "q": "i found the best cyber monday apple watch deals windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Cyber Monday Apple Watch deals</b><br>Shop these Cyber Monday deals on Apple Watches, including the new Series 11, Ultra 3, and SE 3, while they're still available.<br><a href=\"https://www.zdnet.com/article/cyber-monday-apple-watch-deals-amazon-best-buy-walmart-12-1/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-apple-watch-deals-amazon-best-buy-walmart-12-1/",
    "topic": "it",
    "date": "2025-12-01T17:35:05.000Z"
  },
  {
    "title": " Microsoft’s 2025 Limted Edition Windows Ugly Sweater celebrates 50 years of nostalgia with Clippy, DOS, MSN, and more— and it’ll sell out fast, so act now! ",
    "q": " microsoft’s 2025 limted edition windows ugly sweater celebrates 50 years of nostalgia with clippy, dos, msn, and more— and it’ll sell out fast, so act now!  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft’s 2025 Limted Edition Windows Ugly Sweater celebrates 50 years of nostalgia with Clippy, DOS, MSN, and more— and it’ll sell out fast, so act now! </b><br>To cap off Microsoft's 50th anniversary year, the company has announced a new Windows Ugly Sweater for 2025, this time themed after nostalgic and popular icons from Windows' past.<br><a href=\"https://www.windowscentral.com/microsoft/microsofts-2025-limted-edition-windows-ugly-sweater-celebrates-50-years-of-nostalgia\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsofts-2025-limted-edition-windows-ugly-sweater-celebrates-50-years-of-nostalgia",
    "topic": "it",
    "date": "2025-12-01T18:01:44.000Z"
  },
  {
    "title": " 8 Cyber Monday deals we actually bought this year — laptops, PC accessories, video games, and more ",
    "q": " 8 cyber monday deals we actually bought this year — laptops, pc accessories, video games, and more  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> 8 Cyber Monday deals we actually bought this year — laptops, PC accessories, video games, and more </b><br>There are plenty of tempting Cyber Monday deals going on now, but these are the ones that actually got us here at Windows Central to make a purchase.<br><a href=\"https://www.windowscentral.com/hardware/handheld-gaming-pc/cyber-monday-deals-we-actually-bought\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/handheld-gaming-pc/cyber-monday-deals-we-actually-bought",
    "topic": "it",
    "date": "2025-12-01T12:24:00.000Z"
  },
  {
    "title": "Microsoft says new Outlook can't open some Excel attachments",
    "q": "microsoft says new outlook can't open some excel attachments windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft says new Outlook can't open some Excel attachments</b><br>​Microsoft is working to resolve a known issue that prevents some users from opening Excel email attachments in the new Outlook client. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-says-new-outlook-cant-open-some-excel-attachments/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-new-outlook-cant-open-some-excel-attachments/",
    "topic": "it",
    "date": "2025-12-01T17:42:51.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "The M2 MacBook Air is a fantastic deal at $599 today ($200 off)",
    "q": "the m2 macbook air is a fantastic deal at $599 today ($200 off) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The M2 MacBook Air is a fantastic deal at $599 today ($200 off)</b><br>It knocks the socks off any $600 Windows laptop at most tasks.<br><a href=\"https://www.howtogeek.com/the-m2-macbook-air-is-a-fantastic-deal-at-599-today-200-off/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/the-m2-macbook-air-is-a-fantastic-deal-at-599-today-200-off/",
    "topic": "it",
    "date": "2025-12-01T18:06:47.000Z"
  },
  {
    "title": "Linux kernel 6.18 has arrived: Here's what's new",
    "q": "linux kernel 6.18 has arrived: here's what's new windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Linux kernel 6.18 has arrived: Here's what's new</b><br>Linux 6.18 prepares for long-term duty with Apple M2 and Intel upgrades.<br><a href=\"https://www.howtogeek.com/linux-kernel-618-has-arrived-heres-whats-new/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/linux-kernel-618-has-arrived-heres-whats-new/",
    "topic": "it",
    "date": "2025-12-01T17:10:31.000Z"
  },
  {
    "title": "Microsoft can't fix Windows 11 because it won't stop breaking it",
    "q": "microsoft can't fix windows 11 because it won't stop breaking it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft can't fix Windows 11 because it won't stop breaking it</b><br>Microsoft has a growing Windows 11 problem, but it's not doing anything to fix it.<br><a href=\"https://www.xda-developers.com/microsoft-cant-fix-windows-11-wont-stop-breaking-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/microsoft-cant-fix-windows-11-wont-stop-breaking-it/",
    "topic": "it",
    "date": "2025-12-01T17:00:18.000Z"
  },
  {
    "title": "5 reasons your Bluetooth audio keeps cracking or cutting out",
    "q": "5 reasons your bluetooth audio keeps cracking or cutting out windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>5 reasons your Bluetooth audio keeps cracking or cutting out</b><br>Bluetooth isn't perfect on Windows, and these mistakes can make it worse<br><a href=\"https://www.xda-developers.com/why-bluetooth-audio-keeps-cracking-or-cutting-out/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/why-bluetooth-audio-keeps-cracking-or-cutting-out/",
    "topic": "it",
    "date": "2025-12-01T12:00:17.000Z"
  }
]