[
  {
    "title": "Are Cameras Actually More Expensive Now? | The PetaPixel Podcast",
    "q": "are cameras actually more expensive now? | the petapixel podcast camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Are Cameras Actually More Expensive Now? | The PetaPixel Podcast</b><br>This week on The PetaPixel Podcast, the team is in New York City and spend time chatting in different hotel rooms together! The big topic that has been on everyone's mind lately is pricing, and the idea that photography has become too expe…<br><a href=\"https://petapixel.com/2026/01/21/are-cameras-actually-more-expensive-now-the-petapixel-podcast/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/are-cameras-actually-more-expensive-now-the-petapixel-podcast/",
    "topic": "photo",
    "date": "2026-01-21T18:01:36.000Z"
  },
  {
    "title": "Photographer Documents Untouched Children’s Bedrooms Left by School Shootings in Netflix’s ‘All The Empty Rooms’",
    "q": "photographer documents untouched children’s bedrooms left by school shootings in netflix’s ‘all the empty rooms’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Documents Untouched Children’s Bedrooms Left by School Shootings in Netflix’s ‘All The Empty Rooms’</b><br>A photographer and journalist document the children’s bedrooms left behind by school shootings and the lasting grief in the Netflix documentary All the Empty Rooms. [Read More]<br><a href=\"https://petapixel.com/2026/01/21/photographer-documents-untouched-childrens-bedrooms-left-by-school-shootings-in-netflixs-all-the-empty-rooms/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/photographer-documents-untouched-childrens-bedrooms-left-by-school-shootings-in-netflixs-all-the-empty-rooms/",
    "topic": "photo",
    "date": "2026-01-21T17:44:30.000Z"
  },
  {
    "title": "Brooklyn Beckham’s Photography Book Surges in Price Amid Family Drama",
    "q": "brooklyn beckham’s photography book surges in price amid family drama camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Brooklyn Beckham’s Photography Book Surges in Price Amid Family Drama</b><br>Brooklyn Beckham's photography career lives in infamy -- who can forget that elephant photo? But amid a family drama, the photo book he released in 2017 is now surging in value. [Read More]<br><a href=\"https://petapixel.com/2026/01/21/brooklyn-beckhams-photography-book-surges-in-price-amid-family-drama/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/brooklyn-beckhams-photography-book-surges-in-price-amid-family-drama/",
    "topic": "photo",
    "date": "2026-01-21T17:36:39.000Z"
  },
  {
    "title": "Nikon Files Lawsuit Against Viltrox in China Over Z-Mount Patent: Report",
    "q": "nikon files lawsuit against viltrox in china over z-mount patent: report camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon Files Lawsuit Against Viltrox in China Over Z-Mount Patent: Report</b><br>Nikon has reportedly filed a lawsuit against Chinese lens manufacturer Viltrox, alleging intellectual property infringement related to the company's Z-mount lens technology. [Read More]<br><a href=\"https://petapixel.com/2026/01/21/nikon-files-lawsuit-against-viltrox-in-china-over-z-mount-patent-report/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/nikon-files-lawsuit-against-viltrox-in-china-over-z-mount-patent-report/",
    "topic": "photo",
    "date": "2026-01-21T15:45:55.000Z"
  },
  {
    "title": "GlamBOT Photographer Faces Backlash Over ‘Rude Emails’ to Bride Who Tried to Book Famed Camera",
    "q": "glambot photographer faces backlash over ‘rude emails’ to bride who tried to book famed camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>GlamBOT Photographer Faces Backlash Over ‘Rude Emails’ to Bride Who Tried to Book Famed Camera</b><br>The photographer behind the GlamBOT -- the high-speed camera that captures slow-motion videos on award-show red carpets -- has come under fire after alleged emails surfaced in which he questioned whether a bride could afford to book the ca…<br><a href=\"https://petapixel.com/2026/01/21/glambot-photographer-faces-backlash-over-rude-emails-to-bride-who-tried-to-book-famed-camera/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/glambot-photographer-faces-backlash-over-rude-emails-to-bride-who-tried-to-book-famed-camera/",
    "topic": "photo",
    "date": "2026-01-21T14:58:54.000Z"
  },
  {
    "title": "Solar Storm Turbocharges Aurora Lights in Dazzling Photos From Space and Earth",
    "q": "solar storm turbocharges aurora lights in dazzling photos from space and earth camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Solar Storm Turbocharges Aurora Lights in Dazzling Photos From Space and Earth</b><br>A Russian cosmonaut has captured dazzling aurora lights from onboard the International Space Station -- as a large coronal mass ejection (CME) supercharged auroras around the globe this week. [Read More]<br><a href=\"https://petapixel.com/2026/01/21/solar-storm-turbocharges-aurora-lights-in-dazzling-photos-from-space-and-earth/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/solar-storm-turbocharges-aurora-lights-in-dazzling-photos-from-space-and-earth/",
    "topic": "photo",
    "date": "2026-01-21T13:33:27.000Z"
  },
  {
    "title": "Photographer at the Scene of Deadly Train Crash in Spain Discovers Vital Clue",
    "q": "photographer at the scene of deadly train crash in spain discovers vital clue camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer at the Scene of Deadly Train Crash in Spain Discovers Vital Clue</b><br>Attending the scene of a fatal accident is one of the more harrowing aspects of a press photographer's job, as they don't know what they will find upon arrival. [Read More]<br><a href=\"https://petapixel.com/2026/01/21/photographer-at-the-scene-of-deadly-train-crash-in-spain-discovers-vital-clue/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/21/photographer-at-the-scene-of-deadly-train-crash-in-spain-discovers-vital-clue/",
    "topic": "photo",
    "date": "2026-01-21T10:49:51.000Z"
  },
  {
    "title": "These are the photo projects that have kept you inspired and learning",
    "q": "these are the photo projects that have kept you inspired and learning camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>These are the photo projects that have kept you inspired and learning</b><br>Photo: Community member NiVoak For our most recent Question of the Week, we asked about a topic that's near and dear to my heart: photography projects. We wondered what projects you are taking on to spark creativity and move your photograp…<br><a href=\"https://www.dpreview.com/articles/8158109343/these-are-the-photo-projects-that-have-kept-you-inspired-and-learning\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8158109343/these-are-the-photo-projects-that-have-kept-you-inspired-and-learning",
    "topic": "photo",
    "date": "2026-01-21T16:46:00.000Z"
  },
  {
    "title": "Nikon focuses on licensees as it files patent case against Viltrox",
    "q": "nikon focuses on licensees as it files patent case against viltrox camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon focuses on licensees as it files patent case against Viltrox</b><br>Viltrox has released a range of high-end lenses for Nikon Z-mount, including the 85mm F1.4 Pro. These appear to have been released without a license from Nikon. Photo: Viltrox Nikon has responded to reports of it taking legal action agains…<br><a href=\"https://www.dpreview.com/news/0506855771/nikon-viltrox-patent-battle\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0506855771/nikon-viltrox-patent-battle",
    "topic": "photo",
    "date": "2026-01-21T00:02:00.000Z"
  },
  {
    "title": "Adobe Premiere gets a cleaner name and some new tricks",
    "q": "adobe premiere gets a cleaner name and some new tricks camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe Premiere gets a cleaner name and some new tricks</b><br>Image: Adobe Adobe has announced Premiere 26, the latest version of its video editing software that brings a useful feature out of beta, adds support for the R3D NE Raw files that Nikon introduced with the video-focused ZR and comes with a…<br><a href=\"https://www.dpreview.com/news/7068552137/adobe-premiere-26-object-selection-launch-rebrand-r3d-ne\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7068552137/adobe-premiere-26-object-selection-launch-rebrand-r3d-ne",
    "topic": "photo",
    "date": "2026-01-20T14:00:00.000Z"
  },
  {
    "title": "Tamron 70-180mm F2.8 Di III VC VXD G2 sample gallery and impressions",
    "q": "tamron 70-180mm f2.8 di iii vc vxd g2 sample gallery and impressions camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Tamron 70-180mm F2.8 Di III VC VXD G2 sample gallery and impressions</b><br>When you use DPReview links to buy products, the site may earn a commission. Nikon Z8 | Tamron 70-180mm F2.8 | 180mm | F4 | 1/200 sec | ISO 125 Photos: Mitchell Clark Late last year, Tamron announced that it was bringing its venerable 70-1…<br><a href=\"https://www.dpreview.com/samples/0257901751/tamron-70-180mm-f2-8-di-iii-vc-vxd-g2-sample-gallery\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/samples/0257901751/tamron-70-180mm-f2-8-di-iii-vc-vxd-g2-sample-gallery",
    "topic": "photo",
    "date": "2026-01-19T14:00:00.000Z"
  },
  {
    "title": "Our \"Silly Signs\" photo challenge is now open for submissions",
    "q": "our \"silly signs\" photo challenge is now open for submissions camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Our \"Silly Signs\" photo challenge is now open for submissions</b><br>I took this photo while touring Astoria, Oregon, solely to explore the sites featured in the 1985 movie The Goonies. The photo depicts the driveway sign leading up to the house where some of the Goonies kids lived. Photo: Mathew Anderson O…<br><a href=\"https://www.dpreview.com/articles/5396766660/january-2026-photo-challenge-is-open-for-submissions\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5396766660/january-2026-photo-challenge-is-open-for-submissions",
    "topic": "photo",
    "date": "2026-01-18T14:27:00.000Z"
  },
  {
    "title": "Important settings to change on any new camera",
    "q": "important settings to change on any new camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Important settings to change on any new camera</b><br>Photo: Abby Ferguson Getting a new camera is always exciting, even if it's only new to you. So much so that it can be tempting to jump right into using it without much, if any, setup. However, despite the urge to get started right away, it…<br><a href=\"https://www.dpreview.com/articles/2640531041/important-settings-to-change-on-any-new-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2640531041/important-settings-to-change-on-any-new-camera",
    "topic": "photo",
    "date": "2026-01-18T14:00:00.000Z"
  },
  {
    "title": "Do photographers need the fastest external SSD? We tested three to find out",
    "q": "do photographers need the fastest external ssd? we tested three to find out camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do photographers need the fastest external SSD? We tested three to find out</b><br>We put the USB 3.2 Gen 2 Samsung T7 Shield, USB4 SanDisk Extreme Pro and Thunderbolt 5 OWC Envoy Ultra head-to-head. Photo: Mitchell Clark These days, there are an overwhelming number of options when it comes to buying an external SSD to e…<br><a href=\"https://www.dpreview.com/reviews/usb-4-thunderbolt-5-ssd-owc-sandisk-speeds-roundup\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/usb-4-thunderbolt-5-ssd-owc-sandisk-speeds-roundup",
    "topic": "photo",
    "date": "2026-01-17T14:00:00.000Z"
  },
  {
    "title": "From whales to coral reefs, this photo contest showcases underwater excellence",
    "q": "from whales to coral reefs, this photo contest showcases underwater excellence camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>From whales to coral reefs, this photo contest showcases underwater excellence</b><br>2025 DPG Masters Underwater Imaging Competition DivePhotoGuide (DPG) has announced the winners of its Masters Underwater Imaging Competition 2025. The contest consists of nine image categories, including wide angle, macro, over-under, comp…<br><a href=\"https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5414056642/2025-dpg-masters-underwater-imaging-competition",
    "topic": "photo",
    "date": "2026-01-16T15:16:00.000Z"
  },
  {
    "title": "Timed-to-perfection moments from the World Sports Photography Awards",
    "q": "timed-to-perfection moments from the world sports photography awards camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Timed-to-perfection moments from the World Sports Photography Awards</b><br>2026 World Sports Photography Awards The winners of the 2026 World Sports Photography Awards have been announced, highlighting impeccable timing, dramatic lighting and memorable moments. The contest showcases work from sports photographers…<br><a href=\"https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9194435721/timed-to-perfection-moments-from-the-2026-world-sports-photography-awards",
    "topic": "photo",
    "date": "2026-01-15T18:55:00.000Z"
  },
  {
    "title": "Sony a7 V video studio scene: what do you really need?",
    "q": "sony a7 v video studio scene: what do you really need? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony a7 V video studio scene: what do you really need?</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Mitchell Clark We've taken a look at how the Sony a7 V performs when it comes to stills, now it's time to turn our attention to video. The company's latest…<br><a href=\"https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4979409121/sony-a7-v-video-studio-scene",
    "topic": "photo",
    "date": "2026-01-15T14:00:00.000Z"
  },
  {
    "title": " Would I be mad to quit Photoshop after 20 years – or is this the smartest move to make? I just can't decide! ",
    "q": " would i be mad to quit photoshop after 20 years – or is this the smartest move to make? i just can't decide!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Would I be mad to quit Photoshop after 20 years – or is this the smartest move to make? I just can't decide! </b><br>Life after Adobe: Why I’m seriously considering Affinity for my photo editing<br><a href=\"https://www.digitalcameraworld.com/photography/photo-editing/would-i-be-mad-to-quit-photoshop-after-20-years-or-is-this-the-smartest-move-to-make-i-just-cant-decide\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photo-editing/would-i-be-mad-to-quit-photoshop-after-20-years-or-is-this-the-smartest-move-to-make-i-just-cant-decide",
    "topic": "photo",
    "date": "2026-01-21T17:45:00.000Z"
  },
  {
    "title": " This charming, cheap retro compact is all the evidence I need – I think the twin-lens reflex camera needs to make a comeback ",
    "q": " this charming, cheap retro compact is all the evidence i need – i think the twin-lens reflex camera needs to make a comeback  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This charming, cheap retro compact is all the evidence I need – I think the twin-lens reflex camera needs to make a comeback </b><br>Retro cameras have made a comeback. Why not the twin-lens reflex camera?<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/this-charming-cheap-retro-compact-is-all-the-evidence-i-need-i-think-the-twin-lens-reflex-camera-needs-to-make-a-comeback\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/this-charming-cheap-retro-compact-is-all-the-evidence-i-need-i-think-the-twin-lens-reflex-camera-needs-to-make-a-comeback",
    "topic": "photo",
    "date": "2026-01-21T17:11:53.000Z"
  },
  {
    "title": " A clever, mechanical take on the amazing XPan camera – without the $4,000 price tag ",
    "q": " a clever, mechanical take on the amazing xpan camera – without the $4,000 price tag  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> A clever, mechanical take on the amazing XPan camera – without the $4,000 price tag </b><br>This photographer 3D-printed his own XPan-style film camera<br><a href=\"https://www.digitalcameraworld.com/cameras/film-cameras/a-clever-mechanical-take-on-the-xpan-without-the-usd4-000-price-tag\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/film-cameras/a-clever-mechanical-take-on-the-xpan-without-the-usd4-000-price-tag",
    "topic": "photo",
    "date": "2026-01-21T16:50:00.000Z"
  },
  {
    "title": " The smartphone decimated the camera industry. But now Canon says the industry has finally settled, as trends push point-and-shoots like this PowerShot compact out of stock ",
    "q": " the smartphone decimated the camera industry. but now canon says the industry has finally settled, as trends push point-and-shoots like this powershot compact out of stock  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The smartphone decimated the camera industry. But now Canon says the industry has finally settled, as trends push point-and-shoots like this PowerShot compact out of stock </b><br>In a new report, Canon says that the camera industry has finally \"settled\" from the impact of the smartphone<br><a href=\"https://www.digitalcameraworld.com/cameras/the-smartphone-decimated-the-camera-industry-but-now-canon-says-the-industry-has-finally-settled-as-trends-push-point-and-shoots-like-this-powershot-compact-out-of-stock\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/the-smartphone-decimated-the-camera-industry-but-now-canon-says-the-industry-has-finally-settled-as-trends-push-point-and-shoots-like-this-powershot-compact-out-of-stock",
    "topic": "photo",
    "date": "2026-01-21T16:42:32.000Z"
  },
  {
    "title": " Brooklyn Beckham photo book backlash hasn’t aged well –was ‘brand Beckham’ to blame or the braying public?  ",
    "q": " brooklyn beckham photo book backlash hasn’t aged well –was ‘brand beckham’ to blame or the braying public?   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Brooklyn Beckham photo book backlash hasn’t aged well –was ‘brand Beckham’ to blame or the braying public?  </b><br>I always hated the backlash to Brooklyn’s photo book. Sure, I think the timing and execution were all wrong, but critics and armchair warriors were unnecessarily harsh on a teenage photographer finding his voice<br><a href=\"https://www.digitalcameraworld.com/photography/books/brooklyn-beckham-photo-book-backlash-hasnt-aged-well-was-brand-beckham-to-blame-or-the-braying-public\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/books/brooklyn-beckham-photo-book-backlash-hasnt-aged-well-was-brand-beckham-to-blame-or-the-braying-public",
    "topic": "photo",
    "date": "2026-01-21T15:56:48.000Z"
  },
  {
    "title": " YouTube is adding support for still photos, as CEO says Shorts will gain support for image posts in 2026 ",
    "q": " youtube is adding support for still photos, as ceo says shorts will gain support for image posts in 2026  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> YouTube is adding support for still photos, as CEO says Shorts will gain support for image posts in 2026 </b><br>In a list of features coming in 2026, YouTube CEO Neal Mohan says that image posts are coming to Shorts<br><a href=\"https://www.digitalcameraworld.com/tech/social-media/youtube-is-adding-support-for-still-photos-as-ceo-says-shorts-will-gain-support-for-image-posts-in-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/social-media/youtube-is-adding-support-for-still-photos-as-ceo-says-shorts-will-gain-support-for-image-posts-in-2026",
    "topic": "photo",
    "date": "2026-01-21T15:24:38.000Z"
  },
  {
    "title": "How to Photograph a Meteor Shower: The Complete Guide",
    "q": "how to photograph a meteor shower: the complete guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Photograph a Meteor Shower: The Complete Guide</b><br>If you're looking for something exciting to do this weekend, then you should check out this year's Perseid Meteor Shower! One of the strongest, most impressive meteor showers every year, the Perseids always deliver at least a handful of tr…<br><a href=\"https://www.slrlounge.com/how-to-photograph-a-meteor-shower-the-complete-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-photograph-a-meteor-shower-the-complete-guide/",
    "topic": "photo",
    "date": "2026-01-21T18:35:47.000Z"
  },
  {
    "title": "DxO PhotoLab 9 Review | Precision RAW Editing, Refined by AI",
    "q": "dxo photolab 9 review | precision raw editing, refined by ai camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO PhotoLab 9 Review | Precision RAW Editing, Refined by AI</b><br>DxO PhotoLab has always occupied a slightly different lane than Lightroom or Capture One. Instead of focusing first on catalog management or creative presets, DxO’s reputation has been built on something more fundamental: getting the best …<br><a href=\"https://www.slrlounge.com/dxo-photolab-9-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-photolab-9-review/",
    "topic": "photo",
    "date": "2026-01-21T18:00:00.000Z"
  },
  {
    "title": "Photography Studio Management Software Guide (Updated)",
    "q": "photography studio management software guide (updated) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photography Studio Management Software Guide (Updated)</b><br>Finding the right Studio Management Software is critical for photography and videography businesses of all sizes and genres. The right software will help you do the following: Keep your leads organized Automate critical tasks, reminders an…<br><a href=\"https://www.slrlounge.com/photography-studio-management-software-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photography-studio-management-software-guide/",
    "topic": "photo",
    "date": "2026-01-20T20:53:31.000Z"
  },
  {
    "title": "High Angle Photography – Ideas to Try Some “From Above” Photos",
    "q": "high angle photography – ideas to try some “from above” photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>High Angle Photography – Ideas to Try Some “From Above” Photos</b><br>High angle photography is a technique used by photographers to capture stunning aerial shots that reveal scenes from perspectives impossible to achieve at eye level. This approach involves taking photographs from an elevated vantage point,…<br><a href=\"https://www.slrlounge.com/high-angle-photography-ideas-to-try-some-from-above-photos-from-cooph/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/high-angle-photography-ideas-to-try-some-from-above-photos-from-cooph/",
    "topic": "photo",
    "date": "2026-01-19T20:51:31.000Z"
  },
  {
    "title": "Black and White Landscape Photos and Tips to Inspire Your Adventures",
    "q": "black and white landscape photos and tips to inspire your adventures camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Black and White Landscape Photos and Tips to Inspire Your Adventures</b><br>Looking for inspiration for photographing your next road trip (or walk around the block)? Check out our curated list of black and white landscape photos!<br><a href=\"https://www.slrlounge.com/10-black-and-white-landscape-photos-to-inspire-your-adventures/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/10-black-and-white-landscape-photos-to-inspire-your-adventures/",
    "topic": "photo",
    "date": "2026-01-19T20:45:29.000Z"
  },
  {
    "title": "Sitting Pose Tips, Ideas and Common Mistakes",
    "q": "sitting pose tips, ideas and common mistakes camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sitting Pose Tips, Ideas and Common Mistakes</b><br>You can have the best, most perfectly prepared subject with phenomenal hair, makeup and styling and have gorgeous light at your disposal, but bad or mediocre posing will make it all moot. Even an experienced model who knows how to work the…<br><a href=\"https://www.slrlounge.com/how-to-fix-sitting-posing-mistakes/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-fix-sitting-posing-mistakes/",
    "topic": "photo",
    "date": "2026-01-18T20:38:58.000Z"
  },
  {
    "title": "SmallRig x Potato Jet TRIBEX SE Tripod Review",
    "q": "smallrig x potato jet tribex se tripod review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>SmallRig x Potato Jet TRIBEX SE Tripod Review</b><br>A fast, field-ready tripod built for landscape and hybrid shooters Let’s clear this up right from the start.The SmallRig x Potato Jet TRIBEX SE is not a studio portrait, product or still life tripod. It isn’t trying to be, and judging it b…<br><a href=\"https://photofocus.com/reviews/smallrig-x-potato-jet-tribex-se-tripod-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/smallrig-x-potato-jet-tribex-se-tripod-review/",
    "topic": "photo",
    "date": "2026-01-21T13:30:00.000Z"
  },
  {
    "title": "Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits ",
    "q": "creative color shifts | using nik collection’s color efex for dramatic portraits  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Creative Color Shifts | Using Nik Collection’s Color Efex for Dramatic Portraits </b><br>Explore creative colour shifts in still life photography using Nik Collection’s Color Efex Pro. In this video, I show how to use colour grading, film-inspired filters, and local contrast tools to create dramatic, moody still life images wi…<br><a href=\"https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/creative-color-shifts-using-nik-collections-color-efex-for-dramatic-portraits/",
    "topic": "photo",
    "date": "2026-01-20T14:00:00.000Z"
  },
  {
    "title": "Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity",
    "q": "removing distractions in lightroom vs luminar, photolab and affinity camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distractions in Lightroom Vs Luminar, PhotoLab and Affinity</b><br>In this beginner-friendly editing comparison, I walk photographers through one of the most common frustrations: removing unwanted people and distractions from photos, without needing to touch Photoshop. Using a real-world example from a bu…<br><a href=\"https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distractions-in-lightroom-vs-luminar-photolab-and-affinity/",
    "topic": "photo",
    "date": "2026-01-19T14:00:00.000Z"
  },
  {
    "title": "A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light",
    "q": "a coastal wake-up call: variable nd filters vs real-world light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>A Coastal Wake-Up Call: Variable ND Filters vs Real-World Light</b><br>What I Loved in the Studio, and What Caught Me Out on the Coast After spending time with the K&F CONCEPT Ultra-Low Reflection Variable ND Filter in the studio, I was genuinely impressed. Long exposures behaved beautifully, reflections were…<br><a href=\"https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/shooting-photography/a-coastal-wake-up-call-variable-nd-filters-vs-real-world-light/",
    "topic": "photo",
    "date": "2026-01-18T14:00:00.000Z"
  },
  {
    "title": "Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more",
    "q": "removing noise | comparison lightroom vs pure raw, neo, topaz denoise & more camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Noise | Comparison Lightroom Vs Pure Raw, Neo, Topaz Denoise & more</b><br>High ISO noise can creep into even the best portrait sessions, especially when you’re shooting in dark interiors, low light locations, or pushing your camera beyond its comfort zone, and in this video I break down exactly how to deal with …<br><a href=\"https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-noise-comparison-lightroom-vs-pure-raw-neo-topaz-denoise-more/",
    "topic": "photo",
    "date": "2026-01-14T14:00:00.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "DJI’s Mic Mini is a big upgrade over your phone’s mic, and it&#8217;s on sale for $60",
    "q": "dji’s mic mini is a big upgrade over your phone’s mic, and it&#8217;s on sale for $60 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>DJI’s Mic Mini is a big upgrade over your phone’s mic, and it&#8217;s on sale for $60</b><br>DJI’s Mic Mini makes vlogging on the go a little easier. If you want better audio than your phone can deliver while creating content on the go but a high-end wireless mic isn’t in the budget, DJI’s Mic Mini is worth a look. It’ll improve y…<br><a href=\"https://www.theverge.com/tech/864942/dji-mac-mini-starlink-mini-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/864942/dji-mac-mini-starlink-mini-deal-sale",
    "topic": "it",
    "date": "2026-01-21T16:21:26.000Z"
  },
  {
    "title": "This midrange Android phone also runs Windows and Linux",
    "q": "this midrange android phone also runs windows and linux windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This midrange Android phone also runs Windows and Linux</b><br>Nex Computer runs both Android and this Windows Phone-esque mobile UI that they made in-house. Nex Computer, a company that makes hardware designed to turn your phone into a laptop, is working on something new: the NexPhone. It's a midrang…<br><a href=\"https://www.theverge.com/tech/864595/nexphone-android-linux-windows-11\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/864595/nexphone-android-linux-windows-11",
    "topic": "it",
    "date": "2026-01-21T16:00:00.000Z"
  },
  {
    "title": "I tested a bunch of Switch 2 screen protectors, and these are the best",
    "q": "i tested a bunch of switch 2 screen protectors, and these are the best windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tested a bunch of Switch 2 screen protectors, and these are the best</b><br>This is what a Switch 2 looks like with a glossy glass protector attached to its screen. | Image: Cameron Faulkner/The Verge A glass screen protector is one of a few essential accessories that I strongly recommend to every Switch 2 owner. …<br><a href=\"https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/reviews/694948/best-switch-2-glass-screen-protector-glossy-matte",
    "topic": "it",
    "date": "2026-01-21T14:50:19.000Z"
  },
  {
    "title": " Driving theory test cheats are using Bluetooth earpieces and hidden phones to pass — and after my recent nightmare, I’m not surprised ",
    "q": " driving theory test cheats are using bluetooth earpieces and hidden phones to pass — and after my recent nightmare, i’m not surprised  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Driving theory test cheats are using Bluetooth earpieces and hidden phones to pass — and after my recent nightmare, I’m not surprised </b><br>The number of learner drivers caught cheating in their driving tests has skyrocketed in the UK as candidates face long waiting times.<br><a href=\"https://www.techradar.com/vehicle-tech/driving-theory-test-cheats-are-using-bluetooth-earpieces-and-hidden-phones-to-pass-and-after-my-recent-nightmare-im-not-surprised\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/vehicle-tech/driving-theory-test-cheats-are-using-bluetooth-earpieces-and-hidden-phones-to-pass-and-after-my-recent-nightmare-im-not-surprised",
    "topic": "it",
    "date": "2026-01-21T17:43:47.000Z"
  },
  {
    "title": " Anthropic's official Git MCP server had some worrying security flaws - this is what happened next ",
    "q": " anthropic's official git mcp server had some worrying security flaws - this is what happened next  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Anthropic's official Git MCP server had some worrying security flaws - this is what happened next </b><br>Bugs could be chained for devastating effect, but Anthropic stepped up.<br><a href=\"https://www.techradar.com/pro/security/anthropics-official-git-mcp-server-had-some-worrying-security-flaws-this-is-what-happened-next\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/anthropics-official-git-mcp-server-had-some-worrying-security-flaws-this-is-what-happened-next",
    "topic": "it",
    "date": "2026-01-21T17:30:00.000Z"
  },
  {
    "title": " Netflix says a big mobile app redesign is coming – and subscribers are bracing themselves for another UI nightmare ",
    "q": " netflix says a big mobile app redesign is coming – and subscribers are bracing themselves for another ui nightmare  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Netflix says a big mobile app redesign is coming – and subscribers are bracing themselves for another UI nightmare </b><br>There's a new Netflix update coming to mobile, and it's bringing a new vertical feed to your account.<br><a href=\"https://www.techradar.com/streaming/netflix/netflix-says-a-big-mobile-app-redesign-is-coming-and-subscribers-are-bracing-themselves-for-another-ui-nightmare\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/streaming/netflix/netflix-says-a-big-mobile-app-redesign-is-coming-and-subscribers-are-bracing-themselves-for-another-ui-nightmare",
    "topic": "it",
    "date": "2026-01-21T17:00:00.000Z"
  },
  {
    "title": "Volvo's New EX60 Is Here and It Might Be the Brand's Most Important EV Yet",
    "q": "volvo's new ex60 is here and it might be the brand's most important ev yet windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Volvo's New EX60 Is Here and It Might Be the Brand's Most Important EV Yet</b><br>The midsize SUV debuts a new dedicated electric vehicle platform, dashboard tech powered by Google Gemini and Apple Music with Dolby Atmos preinstalled.<br><a href=\"https://www.cnet.com/roadshow/news/volvo-new-ex60-electric-suv-debut/\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/roadshow/news/volvo-new-ex60-electric-suv-debut/",
    "topic": "it",
    "date": "2026-01-21T17:32:00.000Z"
  },
  {
    "title": " Jensen Huang says Nvidia has dethroned Apple as TSMC’s largest customer — rumor suggests that the chip fab is increasing its prices for Cupertino ",
    "q": " jensen huang says nvidia has dethroned apple as tsmc’s largest customer — rumor suggests that the chip fab is increasing its prices for cupertino  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Jensen Huang says Nvidia has dethroned Apple as TSMC’s largest customer — rumor suggests that the chip fab is increasing its prices for Cupertino </b><br>Nvidia CEO Jensen Huang confirmed in a podcast that his company has overtaken Apple as TSMC's biggest customer, once again becoming its top client after more than 20 years.<br><a href=\"https://www.tomshardware.com/tech-industry/semiconductors/jensen-huang-says-nvidia-has-dethroned-apple-as-tsmcs-largest-customer-rumor-suggests-that-the-chip-fab-is-increasing-its-prices-for-cupertino\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/jensen-huang-says-nvidia-has-dethroned-apple-as-tsmcs-largest-customer-rumor-suggests-that-the-chip-fab-is-increasing-its-prices-for-cupertino",
    "topic": "it",
    "date": "2026-01-21T15:54:53.000Z"
  },
  {
    "title": " Steam client allegedly continues sharing your status with your friends even if you set it ‘Offline,’ report claims — setting is a ‘UI illusion’ and your friends still receive real-time updates when you log on or log off ",
    "q": " steam client allegedly continues sharing your status with your friends even if you set it ‘offline,’ report claims — setting is a ‘ui illusion’ and your friends still receive real-time updates when you log on or log off  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Steam client allegedly continues sharing your status with your friends even if you set it ‘Offline,’ report claims — setting is a ‘UI illusion’ and your friends still receive real-time updates when you log on or log off </b><br>An anonymous blog claims that your Steam client continues broadcasting your log-on and log-off times, regardless of your privacy status. Your friends' clients just hide your profile, but your log data is still stored on the devices of othe…<br><a href=\"https://www.tomshardware.com/tech-industry/cyber-security/steam-client-allegedly-continues-sharing-your-status-with-your-friends-even-if-you-set-it-offline-report-claims-setting-is-a-ui-illusion-and-your-friends-still-receive-real-time-updates-when-you-log-on-or-log-off\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/cyber-security/steam-client-allegedly-continues-sharing-your-status-with-your-friends-even-if-you-set-it-offline-report-claims-setting-is-a-ui-illusion-and-your-friends-still-receive-real-time-updates-when-you-log-on-or-log-off",
    "topic": "it",
    "date": "2026-01-21T15:41:36.000Z"
  },
  {
    "title": " Creality K1C 3D printer price plummets to $399 for a fast, fully enclosed Core XY machine — $160 saving nets you a beginner-friendly printer packed with prosumer features ",
    "q": " creality k1c 3d printer price plummets to $399 for a fast, fully enclosed core xy machine — $160 saving nets you a beginner-friendly printer packed with prosumer features  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Creality K1C 3D printer price plummets to $399 for a fast, fully enclosed Core XY machine — $160 saving nets you a beginner-friendly printer packed with prosumer features </b><br>A $160 saving can be had right now on this Creality K1C 3D printer, fully enclosed and capable of fast printing, and available for just $399 right now, just $30 off its Black Friday pricing.<br><a href=\"https://www.tomshardware.com/3d-printing/creality-k1c-3d-printer-price-plummets-to-usd399-for-a-fast-fully-enclosed-core-xy-machine-usd160-saving-nets-you-a-beginner-friendly-printer-packed-with-prosumer-features\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/3d-printing/creality-k1c-3d-printer-price-plummets-to-usd399-for-a-fast-fully-enclosed-core-xy-machine-usd160-saving-nets-you-a-beginner-friendly-printer-packed-with-prosumer-features",
    "topic": "it",
    "date": "2026-01-21T13:57:16.000Z"
  },
  {
    "title": " Microsoft CEO says AI needs to have a wider impact or else it risks quickly losing ‘social permission’ — also says that the technology should benefit more people to avoid a bubble ",
    "q": " microsoft ceo says ai needs to have a wider impact or else it risks quickly losing ‘social permission’ — also says that the technology should benefit more people to avoid a bubble  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft CEO says AI needs to have a wider impact or else it risks quickly losing ‘social permission’ — also says that the technology should benefit more people to avoid a bubble </b><br>Microsoft CEO Satya Nadella discusses AI's wider impact and what it needs to do to not be a bubble.<br><a href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-ceo-says-ai-needs-to-have-a-wider-impact-or-else-it-risks-quickly-losing-social-permission-also-says-that-the-technology-should-benefit-more-people-to-avoid-a-bubble\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-ceo-says-ai-needs-to-have-a-wider-impact-or-else-it-risks-quickly-losing-social-permission-also-says-that-the-technology-should-benefit-more-people-to-avoid-a-bubble",
    "topic": "it",
    "date": "2026-01-21T13:26:41.000Z"
  },
  {
    "title": "Debian vs. Arch vs. Fedora: Which Linux distro base is right for you",
    "q": "debian vs. arch vs. fedora: which linux distro base is right for you windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Debian vs. Arch vs. Fedora: Which Linux distro base is right for you</b><br>If you're just now coming over to Linux, you might have noticed there are a lot of distributions to choose from. One of your first choices will be what base you want to use. Here's a bit of help.<br><a href=\"https://www.zdnet.com/article/debian-vs-arch-vs-fedora-based-linux-distros/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/debian-vs-arch-vs-fedora-based-linux-distros/",
    "topic": "it",
    "date": "2026-01-21T18:22:58.000Z"
  },
  {
    "title": "This Linux project proves you can bring back Windows 8 - but not why you should",
    "q": "this linux project proves you can bring back windows 8 - but not why you should windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This Linux project proves you can bring back Windows 8 - but not why you should</b><br>The new project not only proves that there's little you can't do with Linux, but might also make you question why someone would want to do this.<br><a href=\"https://www.zdnet.com/article/windows-8-linux-ui-project/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/windows-8-linux-ui-project/",
    "topic": "it",
    "date": "2026-01-21T17:58:00.000Z"
  },
  {
    "title": " Windows 11 apps like Notepad, Snipping Tool, and the Xbox Ally Armoury Crate aren't loading and throwing up a \"Check your account\" box — what is error code 0x803f8001? Here's what we know.  ",
    "q": " windows 11 apps like notepad, snipping tool, and the xbox ally armoury crate aren't loading and throwing up a \"check your account\" box — what is error code 0x803f8001? here's what we know.   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 apps like Notepad, Snipping Tool, and the Xbox Ally Armoury Crate aren't loading and throwing up a \"Check your account\" box — what is error code 0x803f8001? Here's what we know.  </b><br>Windows 11 is currently a minefield as a 0x803f8001 error blocks core apps. If your PC is refusing to open Notepad, you aren't alone.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-11-apps-like-notepad-arent-loading-what-is-error-code-0x803f8001-and-how-d\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/windows-11-apps-like-notepad-arent-loading-what-is-error-code-0x803f8001-and-how-d",
    "topic": "it",
    "date": "2026-01-21T16:15:41.000Z"
  },
  {
    "title": " NexDock is building a new Windows phone that you can buy in 2026 — Meet the NexPhone with Windows 11 ",
    "q": " nexdock is building a new windows phone that you can buy in 2026 — meet the nexphone with windows 11  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> NexDock is building a new Windows phone that you can buy in 2026 — Meet the NexPhone with Windows 11 </b><br>NexPhone is NexDock's first smartphone that runs Android, Linux, and Windows 11. The device is expected to go on sale later this year for $549.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/nexdock-is-building-a-new-windows-phone-that-you-can-buy-in-2026-meet-the-nexphone-with-windows-11\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/nexdock-is-building-a-new-windows-phone-that-you-can-buy-in-2026-meet-the-nexphone-with-windows-11",
    "topic": "it",
    "date": "2026-01-21T16:00:00.000Z"
  },
  {
    "title": " The Xbox PC app is now rolling out publicly for Windows Arm PCs — Microsoft Prism now supports \"85%\" of Xbox Game Pass titles ",
    "q": " the xbox pc app is now rolling out publicly for windows arm pcs — microsoft prism now supports \"85%\" of xbox game pass titles  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The Xbox PC app is now rolling out publicly for Windows Arm PCs — Microsoft Prism now supports \"85%\" of Xbox Game Pass titles </b><br>Microsoft's Prism translation layer just got a beefy update. After a few months in testing, the Xbox PC store is now available on Windows Arm devices.<br><a href=\"https://www.windowscentral.com/gaming/xbox/the-xbox-pc-app-is-now-rolling-out-publicly-for-windows-arm-pcs\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/the-xbox-pc-app-is-now-rolling-out-publicly-for-windows-arm-pcs",
    "topic": "it",
    "date": "2026-01-21T15:57:32.000Z"
  },
  {
    "title": " Microsoft finally kills the \"Save as JPG\" chore — Windows 11 backgrounds get a modern brain ",
    "q": " microsoft finally kills the \"save as jpg\" chore — windows 11 backgrounds get a modern brain  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft finally kills the \"Save as JPG\" chore — Windows 11 backgrounds get a modern brain </b><br>Stop opening Paint just to fix your wallpaper. Windows 11 Build 26220 finally treats WebP files like real images, letting you set web-saved art as your background instantly.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-finally-kills-the-save-as-jpg-chore-windows-11-backgrounds-get-a-modern-brain\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-finally-kills-the-save-as-jpg-chore-windows-11-backgrounds-get-a-modern-brain",
    "topic": "it",
    "date": "2026-01-21T15:54:44.000Z"
  },
  {
    "title": " Satya Nadella says Microsoft could lose \"social permission\" to burn electricity for AI unless it offers something useful — \"That, to me, is ultimately the goal\" ",
    "q": " satya nadella says microsoft could lose \"social permission\" to burn electricity for ai unless it offers something useful — \"that, to me, is ultimately the goal\"  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Satya Nadella says Microsoft could lose \"social permission\" to burn electricity for AI unless it offers something useful — \"That, to me, is ultimately the goal\" </b><br>Microsoft CEO Satya Nadella says employees need to learn AI skills and companies should integrate the technology as a \"cognitive amplifier\" or risk losing \"social permission\" to burn electricity on it.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/satya-nadella-microsoft-could-lose-social-permission-to-burn-electricity-for-ai\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/satya-nadella-microsoft-could-lose-social-permission-to-burn-electricity-for-ai",
    "topic": "it",
    "date": "2026-01-21T12:14:11.000Z"
  },
  {
    "title": " Microsoft CEO Satya Nadella says AI needs to prove its worth in the real world, or it could lose public support — he's already frustrated with \"slop\" memes ",
    "q": " microsoft ceo satya nadella says ai needs to prove its worth in the real world, or it could lose public support — he's already frustrated with \"slop\" memes  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft CEO Satya Nadella says AI needs to prove its worth in the real world, or it could lose public support — he's already frustrated with \"slop\" memes </b><br>Microsoft CEO Satya Nadella warns that AI could potentially lose public support unless it is used to deliver tangible, real-world impact.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsoft-ceo-satya-nadella-says-ai-needs-to-prove-its-worth\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsoft-ceo-satya-nadella-says-ai-needs-to-prove-its-worth",
    "topic": "it",
    "date": "2026-01-21T10:57:47.000Z"
  },
  {
    "title": "Microsoft shares workaround for Outlook freezes after Windows update",
    "q": "microsoft shares workaround for outlook freezes after windows update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft shares workaround for Outlook freezes after Windows update</b><br>Microsoft shared a temporary workaround for customers experiencing Outlook freezes after installing this month's Windows security updates. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-workaround-for-outlook-freezes-after-windows-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-shares-workaround-for-outlook-freezes-after-windows-update/",
    "topic": "it",
    "date": "2026-01-21T15:12:59.000Z"
  },
  {
    "title": "Hackers exploit security testing apps to breach Fortune 500 firms",
    "q": "hackers exploit security testing apps to breach fortune 500 firms windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Hackers exploit security testing apps to breach Fortune 500 firms</b><br>Threat actors are exploiting misconfigured web applications used for security training and internal penetration testing, such as DVWA, OWASP Juice Shop, Hackazon, and bWAPP, to gain access to cloud environments of Fortune 500 companies and…<br><a href=\"https://www.bleepingcomputer.com/news/security/hackers-exploit-security-testing-apps-to-breach-fortune-500-firms/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/hackers-exploit-security-testing-apps-to-breach-fortune-500-firms/",
    "topic": "it",
    "date": "2026-01-21T14:00:00.000Z"
  },
  {
    "title": "Tesla hacked, 37 zero-days demoed at Pwn2Own Automotive 2026",
    "q": "tesla hacked, 37 zero-days demoed at pwn2own automotive 2026 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Tesla hacked, 37 zero-days demoed at Pwn2Own Automotive 2026</b><br>Security researchers have hacked the Tesla Infotainment System and earned $516,500 after exploiting 37 zero-days on the first day of the Pwn2Own Automotive 2026 competition. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/tesla-hacked-37-zero-days-demoed-at-pwn2own-automotive-2026/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/tesla-hacked-37-zero-days-demoed-at-pwn2own-automotive-2026/",
    "topic": "it",
    "date": "2026-01-21T12:16:15.000Z"
  },
  {
    "title": "Microsoft 365, Office apps, and Microsoft Teams are down right now",
    "q": "microsoft 365, office apps, and microsoft teams are down right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft 365, Office apps, and Microsoft Teams are down right now</b><br>The offline versions of Office apps are still fine, if you don't open cloud files.<br><a href=\"https://www.howtogeek.com/microsoft-365-office-apps-and-microsoft-teams-are-down-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-365-office-apps-and-microsoft-teams-are-down-right-now/",
    "topic": "it",
    "date": "2026-01-21T17:31:23.000Z"
  },
  {
    "title": "Saving files is currently broken on Windows 11 and Windows 10",
    "q": "saving files is currently broken on windows 11 and windows 10 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Saving files is currently broken on Windows 11 and Windows 10</b><br>Saving to OneDrive might crash your Windows apps.<br><a href=\"https://www.howtogeek.com/saving-files-is-currently-broken-on-windows-11-and-windows-10/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/saving-files-is-currently-broken-on-windows-11-and-windows-10/",
    "topic": "it",
    "date": "2026-01-21T17:09:29.000Z"
  },
  {
    "title": "WinGet is Windows' best-kept secret—here's what it can do for you",
    "q": "winget is windows' best-kept secret—here's what it can do for you windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>WinGet is Windows' best-kept secret—here's what it can do for you</b><br>You need to start using Windows' overlooked package manager.<br><a href=\"https://www.howtogeek.com/winget-is-windows-best-kept-secret-heres-what-it-can-do-for-you/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/winget-is-windows-best-kept-secret-heres-what-it-can-do-for-you/",
    "topic": "it",
    "date": "2026-01-21T16:30:16.000Z"
  },
  {
    "title": "Twister OS brings my Raspberry Pi 5 so much closer to replacing my daily driver",
    "q": "twister os brings my raspberry pi 5 so much closer to replacing my daily driver windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Twister OS brings my Raspberry Pi 5 so much closer to replacing my daily driver</b><br>Turning the Raspberry Pi 5 into a practical desktop with smart defaults, useful tools, and a smoother daily workflow.<br><a href=\"https://www.xda-developers.com/twister-os-brings-raspberry-pi-5-closer-replacing-daily-driver/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/twister-os-brings-raspberry-pi-5-closer-replacing-daily-driver/",
    "topic": "it",
    "date": "2026-01-21T18:01:20.000Z"
  },
  {
    "title": "I tried Dim instead of Jellyfin for my home server, and it was a mistake",
    "q": "i tried dim instead of jellyfin for my home server, and it was a mistake windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tried Dim instead of Jellyfin for my home server, and it was a mistake</b><br>I tried Dim as a Jellyfin alternative, but its web-first experience clashed with my Apple TV setup, making watching feel like work.<br><a href=\"https://www.xda-developers.com/dim-vs-jellyfin-home-media-server-hated-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/dim-vs-jellyfin-home-media-server-hated-it/",
    "topic": "it",
    "date": "2026-01-21T17:30:20.000Z"
  },
  {
    "title": "The Xbox app is now available on Arm-based Windows PCs",
    "q": "the xbox app is now available on arm-based windows pcs windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Xbox app is now available on Arm-based Windows PCs</b><br>The architecture’s reputation for not being great for gaming is starting to change.<br><a href=\"https://www.xda-developers.com/xbox-app-now-available-on-arm-based-windows-pcs/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/xbox-app-now-available-on-arm-based-windows-pcs/",
    "topic": "it",
    "date": "2026-01-21T17:08:15.000Z"
  },
  {
    "title": "Windows Phone is so back - The NexPhone is a device that dual-boots Android and Windows",
    "q": "windows phone is so back - the nexphone is a device that dual-boots android and windows windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows Phone is so back - The NexPhone is a device that dual-boots Android and Windows</b><br>The NexPhone is a unique smartphone that dual-boots Windows and Android, with the ability to run desktop Linux when docked. It's designed to be your only computer, and it's coming in Q3 for $549.<br><a href=\"https://www.xda-developers.com/windows-phone-back-nexphone/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-phone-back-nexphone/",
    "topic": "it",
    "date": "2026-01-21T16:01:19.000Z"
  },
  {
    "title": "6 free tools you can use to automate your Windows PC",
    "q": "6 free tools you can use to automate your windows pc windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>6 free tools you can use to automate your Windows PC</b><br>If you're tired of repetitive tasks that waste your time, these tools can cut back on the frustrations while using your Windows PC.<br><a href=\"https://www.xda-developers.com/free-tools-automate-your-windows-pc-make-it-smarter/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/free-tools-automate-your-windows-pc-make-it-smarter/",
    "topic": "it",
    "date": "2026-01-21T14:30:20.000Z"
  }
]