[
  {
    "title": "Ball Strikes SkyCam in Two Separate NFL Games",
    "q": "Ball Strikes SkyCam in Two Separate NFL Games PetaPixel",
    "a": "<b>Ball Strikes SkyCam in Two Separate NFL Games</b><br>The SkyCam interfered in not one but two NFL games this weekend as the ball struck the cable-suspended camera system in separate games. [Read More]<br><a href=\"https://petapixel.com/2025/10/06/ball-strikes-skycam-in-two-separate-nfl-games/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "How a Mobile Photography Darkroom Empowers Vulnerable Children",
    "q": "How a Mobile Photography Darkroom Empowers Vulnerable Children PetaPixel",
    "a": "<b>How a Mobile Photography Darkroom Empowers Vulnerable Children</b><br>The Sirkhane Darkroom a mobile photography darkroom, brings education, passion, and most importantly, hope, to overlooked communities in Turkey where children face limited access to education and safety, especially in t…<br><a href=\"https://petapixel.com/2025/10/05/how-a-mobile-photography-darkroom-empowers-vulnerable-children/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Save Up to 30% on SmallRig Gear This Week on Amazon",
    "q": "Save Up to 30% on SmallRig Gear This Week on Amazon PetaPixel",
    "a": "<b>Save Up to 30% on SmallRig Gear This Week on Amazon</b><br>To celebrate the arrival of autumn, SmallRig is offering up to 30% off over 400 products on Amazon from October 7 to 8. [Read More]<br><a href=\"https://petapixel.com/2025/10/05/save-up-to-30-on-smallrig-gear-this-week-on-amazon/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Use Light More Creatively: Exposure Is More Than Just Correcting for Light",
    "q": "Use Light More Creatively: Exposure Is More Than Just Correcting for Light PetaPixel",
    "a": "<b>Use Light More Creatively: Exposure Is More Than Just Correcting for Light</b><br>There’s much more to exposure than just correcting for light. It’s one of the most powerful tools you can use creatively. [Read More]<br><a href=\"https://petapixel.com/2025/10/04/use-light-more-creatively-exposure-is-more-than-just-correcting-for-light/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Camera Makers Need to Lean Into Their Brand Colors Again",
    "q": "Camera Makers Need to Lean Into Their Brand Colors Again PetaPixel",
    "a": "<b>Camera Makers Need to Lean Into Their Brand Colors Again</b><br>When Nikon added the gold ring to the lens mount of its 28-135mm f/4 PZ earlier this year, I was ecstatic. Finally, Nikon was leaning into its brand color. I was saddened to learn it would only do this on select product…<br><a href=\"https://petapixel.com/2025/10/03/camera-makers-need-to-lean-into-their-brand-colors-again/\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge",
    "q": "Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Can you capture the magic of fall? Get ready for our \"Fall Follies\" photo challenge</b><br>Fall colors are on full display in Canada's Northwest Territories. I captured this photo along the Ingraham Trail several km outside Yellowknife, NTW. Although the primary purpose of my trip was to photograph the aurora…<br><a href=\"https://www.dpreview.com/articles/9275549403/october-2025-editors-photo-challenge-announced\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography",
    "q": "Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Inside Canon's HQ: we found out why Canon wants to build the Porsche 911 of photography</b><br>Go Tokura, Executive Vice President, Head of Imaging Group, Chief Executive of Imaging Business Operations Photo: Richard Butler Full disclosure: I've just returned from a trip to Japan paid for by Canon. Our usual poli…<br><a href=\"https://www.dpreview.com/articles/5354325480/a-visit-to-canon-in-japan-and-why-it-wants-to-be-the-porsche-911-of-photography\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Pastel landscapes and monochrome portraits shine at the Film Photography Awards",
    "q": "Pastel landscapes and monochrome portraits shine at the Film Photography Awards Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Pastel landscapes and monochrome portraits shine at the Film Photography Awards</b><br>2025 Analog Sparks International Film Photography Awards This Film Friday, we are highlighting the Analog Sparks 2025 International Film Photography Awards, showcasing diverse analog work from around the globe. This mar…<br><a href=\"https://www.dpreview.com/articles/4903665536/pastel-landscapes-and-monochrome-portraits-shine-at-the-film-photography-awards\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "What is a histogram, and how do you use it?",
    "q": "What is a histogram, and how do you use it? Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>What is a histogram, and how do you use it?</b><br>Photo: Mitchell Clark No matter what type(s) of photography you like to pursue, mastering exposure is key to creating successful images. While it can be tempting to use your camera's screen to judge exposure, that displ…<br><a href=\"https://www.dpreview.com/learn/6774050105/what-is-a-histogram-and-how-do-you-use-it\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Sony 100mm F2.8 Macro GM sample gallery: now with teleconverter shots",
    "q": "Sony 100mm F2.8 Macro GM sample gallery: now with teleconverter shots Articles: Digital Photography Review (dpreview.com)",
    "a": "<b>Sony 100mm F2.8 Macro GM sample gallery: now with teleconverter shots</b><br>When you use DPReview links to buy products, the site may earn a commission. Sony a7R V | Sony FE 100mm F2.8 Macro GM | F4| 1/100 sec | ISO 1600 Processed with Capture One Earlier this week, Sony announced the FE 100mm …<br><a href=\"https://www.dpreview.com/samples/7351256194/sony-100mm-f2p8-macro-gm-sample-gallery\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " PlayStation Plus players get a Halloween treat in the form of my favorite horror game of the decade so far ",
    "q": " PlayStation Plus players get a Halloween treat in the form of my favorite horror game of the decade so far   Latest from TechRadar ",
    "a": "<b> PlayStation Plus players get a Halloween treat in the form of my favorite horror game of the decade so far </b><br>Trick & Treat: Alan Wake 2 is free for PlayStation Plus players this month, and you need to play it while you can.<br><a href=\"https://www.techradar.com/gaming/playstation/playstation-plus-players-get-a-halloween-treat-in-the-form-of-my-favorite-horror-game-of-the-decade-so-far\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Haven’t seen Monster: The Ed Gein Story on Netflix yet? Watch out for this shocking moment ",
    "q": " Haven’t seen Monster: The Ed Gein Story on Netflix yet? Watch out for this shocking moment   Latest from TechRadar ",
    "a": "<b> Haven’t seen Monster: The Ed Gein Story on Netflix yet? Watch out for this shocking moment </b><br>As Monster: The Ed Gein story dominates Netflix charts, I think its accuracy is the least of our concerns.<br><a href=\"https://www.techradar.com/streaming/netflix/havent-seen-monster-the-ed-gein-story-on-netflix-yet-watch-out-for-this-shocking-moment\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Save early with 5 office chair deals I'd buy before Amazon's mini-Prime Day sale even starts ",
    "q": " Save early with 5 office chair deals I'd buy before Amazon's mini-Prime Day sale even starts   Latest from TechRadar ",
    "a": "<b> Save early with 5 office chair deals I'd buy before Amazon's mini-Prime Day sale even starts </b><br>These are the 5 office chairs you'll want to check out before Amazon's mini-Prime Day sales start.<br><a href=\"https://www.techradar.com/pro/save-early-with-5-office-chair-deals-id-buy-before-amazons-mini-prime-day-sale-even-starts\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " I've found the 33 best deals from the Amazon Prime Big Deal Days sale in the UK – freebies, Kindles, TVs, appliances, and more ",
    "q": " I've found the 33 best deals from the Amazon Prime Big Deal Days sale in the UK – freebies, Kindles, TVs, appliances, and more   Latest from TechRadar ",
    "a": "<b> I've found the 33 best deals from the Amazon Prime Big Deal Days sale in the UK – freebies, Kindles, TVs, appliances, and more </b><br>I'm sharing all of the best early deals from the second Amazon Prime Day sale of the year right here.<br><a href=\"https://www.techradar.com/live/news/prime-big-deal-days-25-uk-live\" target=\"_blank\">Read more</a>"
  },
  {
    "title": " Should you buy the rumored M5 iPad Pro? A new report has just muddied the waters about one key upgrade ",
    "q": " Should you buy the rumored M5 iPad Pro? A new report has just muddied the waters about one key upgrade   Latest from TechRadar ",
    "a": "<b> Should you buy the rumored M5 iPad Pro? A new report has just muddied the waters about one key upgrade </b><br>A fresh report says the M5 iPad Pro will definitely have two front-facing cameras, but questions remain.<br><a href=\"https://www.techradar.com/tablets/ipad-pro/should-you-buy-the-rumored-m5-ipad-pro-a-new-report-has-just-muddied-the-waters-about-one-key-upgrade\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "AMD teams up with OpenAI to challenge Nvidia&#8217;s AI chip dominance",
    "q": "AMD teams up with OpenAI to challenge Nvidia&#8217;s AI chip dominance The Verge",
    "a": "<b>AMD teams up with OpenAI to challenge Nvidia&#8217;s AI chip dominance</b><br>AMD is partnering with OpenAI to provide six gigawatts worth of processors for AI data centers, a move that challenges Nvidia’s AI chip market dominance. The five-year agreement aims to help OpenAI bolster its infrastru…<br><a href=\"https://www.theverge.com/news/792650/amd-openai-five-year-ai-chip-agreement\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Sora provides better control over videos featuring your AI self",
    "q": "Sora provides better control over videos featuring your AI self The Verge",
    "a": "<b>Sora provides better control over videos featuring your AI self</b><br>A frame from a Sora 2-generated video. Sora now lets you rein in your AI doubles, giving you more say on how and where deepfake versions of you make an appearance on the app. The update lands as OpenAI hurries to show i…<br><a href=\"https://www.theverge.com/news/792638/sora-provides-better-control-over-videos-featuring-your-ai-self\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "While you were partying with your Steam Deck, GPD studied the cord",
    "q": "While you were partying with your Steam Deck, GPD studied the cord The Verge",
    "a": "<b>While you were partying with your Steam Deck, GPD studied the cord</b><br>I know, it’s “studied the blade,” but you got it, right? Handheld makers are throwing paint at the wall to see what sticks. They apparently can't compete with the Steam Deck on price, so they're trying giant handhelds, …<br><a href=\"https://www.theverge.com/games/791460/gpd-win-5-corded-handhelds\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Sam Altman and Jony Ive&#8217;s secret device won&#8217;t be &#8216;your weird AI girlfriend&#8217;",
    "q": "Sam Altman and Jony Ive&#8217;s secret device won&#8217;t be &#8216;your weird AI girlfriend&#8217; The Verge",
    "a": "<b>Sam Altman and Jony Ive&#8217;s secret device won&#8217;t be &#8216;your weird AI girlfriend&#8217;</b><br>The goal is to develop a similar AI-assistant experience to Siri, “but better.” OpenAI and designer Jony Ive are trying to solve a number of technical challenges before releasing their mysterious AI gadget, according to…<br><a href=\"https://www.theverge.com/news/792635/openai-jony-ive-ai-device-voice-personality-issues\" target=\"_blank\">Read more</a>"
  },
  {
    "title": "Jane Goodall’s death triggered the premiere of Netflix’s new show",
    "q": "Jane Goodall’s death triggered the premiere of Netflix’s new show The Verge",
    "a": "<b>Jane Goodall’s death triggered the premiere of Netflix’s new show</b><br>For the last several years Netflix has been quietly banking episodes of a new show called Famous Last Words, interviews with famous people entering their twilight years. The catch is that episodes will only air after th…<br><a href=\"https://www.theverge.com/news/792477/jane-goodall-netflix-famous-last-words\" target=\"_blank\">Read more</a>"
  }
]