[
  {
    "title": "‘Pole to Pole With Will Smith’ Breaks New Scientific and Photographic Ground",
    "q": "‘pole to pole with will smith’ breaks new scientific and photographic ground camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>‘Pole to Pole With Will Smith’ Breaks New Scientific and Photographic Ground</b><br>In National Geographics new series, \"Pole to Pole With Will Smith,\" viewers follow Smith and world-renowned experts on an adventure across the globe, starting at the South Pole and concluding in the season finale at the North Pole with sto…<br><a href=\"https://petapixel.com/2026/01/13/pole-to-pole-with-will-smith-breaks-new-scientific-and-photographic-ground/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/pole-to-pole-with-will-smith-breaks-new-scientific-and-photographic-ground/",
    "topic": "photo",
    "date": "2026-01-13T21:57:49.000Z"
  },
  {
    "title": "DxO Modules Now Support Over 110,000 Camera and Lens Combos",
    "q": "dxo modules now support over 110,000 camera and lens combos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO Modules Now Support Over 110,000 Camera and Lens Combos</b><br>DxO Labs has released 326 new modules for its photo editing applications, including support for the latest gear from Canon, Nikon, Sony, Fujifilm, Hasselblad, Leica, and more. The additions bring the total number of camera and lens combina…<br><a href=\"https://petapixel.com/2026/01/13/dxo-modules-now-support-over-110000-camera-and-lens-combos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/dxo-modules-now-support-over-110000-camera-and-lens-combos/",
    "topic": "photo",
    "date": "2026-01-13T19:53:50.000Z"
  },
  {
    "title": "Iconic Oscar Wilde Portrait by Legendary Photographer Sarony to Be Sold at Auction",
    "q": "iconic oscar wilde portrait by legendary photographer sarony to be sold at auction camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Iconic Oscar Wilde Portrait by Legendary Photographer Sarony to Be Sold at Auction</b><br>An iconic 1882 photograph of Oscar Wilde, taken by renowned New York photographer Napoleon Sarony, is set to be sold at auction next month. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/iconic-oscar-wilde-portrait-by-legendary-photographer-sarony-to-be-sold-at-auction/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/iconic-oscar-wilde-portrait-by-legendary-photographer-sarony-to-be-sold-at-auction/",
    "topic": "photo",
    "date": "2026-01-13T18:56:16.000Z"
  },
  {
    "title": "Webb Space Telescope’s Special Aperture Turns One Sensor Into Seven",
    "q": "webb space telescope’s special aperture turns one sensor into seven camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Webb Space Telescope’s Special Aperture Turns One Sensor Into Seven</b><br>NASA's James Webb Space Telescope used its sophisticated aperture mechanism to capture unprecedented images of the heart of the Circinus Galaxy, providing astronomers with data unlike anything previously obtained and completely upending th…<br><a href=\"https://petapixel.com/2026/01/13/webb-space-telescopes-special-aperture-turns-one-sensor-into-seven/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/webb-space-telescopes-special-aperture-turns-one-sensor-into-seven/",
    "topic": "photo",
    "date": "2026-01-13T17:24:40.000Z"
  },
  {
    "title": "Photographer Sues Canadian Police Over Protest Arrest Case That Could Reshape Press Freedom",
    "q": "photographer sues canadian police over protest arrest case that could reshape press freedom camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Sues Canadian Police Over Protest Arrest Case That Could Reshape Press Freedom</b><br>A photographer and the news outlet that sent her to cover a protest are suing the Canadian police over her arrest in a case that could redefine who counts as a journalist in an era where \"anyone with a cellphone\" can be considered media. […<br><a href=\"https://petapixel.com/2026/01/13/photographer-sues-canadian-police-over-protest-arrest-case-that-could-reshape-press-freedom/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/photographer-sues-canadian-police-over-protest-arrest-case-that-could-reshape-press-freedom/",
    "topic": "photo",
    "date": "2026-01-13T15:56:12.000Z"
  },
  {
    "title": "Photographer Tells Story Behind Iconic Deftones Album Cover",
    "q": "photographer tells story behind iconic deftones album cover camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Tells Story Behind Iconic Deftones Album Cover</b><br>You might not have heard the album Around the Fur by 1990s alternative metal band Deftones, but there is a good chance you've seen the photo on the cover. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/photographer-tells-story-behind-iconic-deftones-album-cover/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/photographer-tells-story-behind-iconic-deftones-album-cover/",
    "topic": "photo",
    "date": "2026-01-13T15:07:09.000Z"
  },
  {
    "title": "Helmet Camera Captures Moment Skier and Dog are Swept Away by Avalanche",
    "q": "helmet camera captures moment skier and dog are swept away by avalanche camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Helmet Camera Captures Moment Skier and Dog are Swept Away by Avalanche</b><br>A skier filmed the terrifying moment she and her dog were swept up in a sudden avalanche in the Pyrenees Mountains of Andorra. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/helmet-camera-captures-moment-skier-and-dog-are-swept-away-by-avalanche/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/helmet-camera-captures-moment-skier-and-dog-are-swept-away-by-avalanche/",
    "topic": "photo",
    "date": "2026-01-13T15:00:51.000Z"
  },
  {
    "title": "This Battery and Card Case Looks Like a Fujifilm Camera and I Love It",
    "q": "this battery and card case looks like a fujifilm camera and i love it camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Battery and Card Case Looks Like a Fujifilm Camera and I Love It</b><br>A Chinese design account, PerceBound, shared a clever 3D-printed Fujifilm camera-themed battery and memory card case. It's a silly, but great idea. [Read More]<br><a href=\"https://petapixel.com/2026/01/13/this-battery-and-card-case-looks-like-a-fujifilm-camera-and-i-love-it/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2026/01/13/this-battery-and-card-case-looks-like-a-fujifilm-camera-and-i-love-it/",
    "topic": "photo",
    "date": "2026-01-13T14:53:34.000Z"
  },
  {
    "title": "Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor",
    "q": "eric fossum earns the prestigious draper prize for pioneering the cmos image sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Eric Fossum earns the prestigious Draper Prize for pioneering the CMOS image sensor</b><br>Image: Draper Eric Fossum, the inventor of the modern CMOS image sensor and a longtime friend of DPReview, was recently awarded the 2026 Charles Stark Draper Prize for Engineering. The award, which is granted every two years by the Nationa…<br><a href=\"https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4794852228/eric-fossum-earns-the-prestigious-draper-prize-for-pioneering-the-cmos-image-sensor",
    "topic": "photo",
    "date": "2026-01-13T20:10:00.000Z"
  },
  {
    "title": "Apple’s new Creative Cloud competitor lets you edit photos, music and video",
    "q": "apple’s new creative cloud competitor lets you edit photos, music and video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Apple’s new Creative Cloud competitor lets you edit photos, music and video</b><br>Image: Apple Apple has announced a new app bundle for creatives dubbed Apple Creator Studio. The subscription serves as somewhat of an alternative to Adobe's Creative Cloud, as it includes apps for photo, video and music editing, plus Appl…<br><a href=\"https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3752934620/apple-s-new-creative-cloud-competitor-lets-you-edit-photos-music-and-video",
    "topic": "photo",
    "date": "2026-01-13T18:31:00.000Z"
  },
  {
    "title": "Will SD cards remain forever stuck in the past?",
    "q": "will sd cards remain forever stuck in the past? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Will SD cards remain forever stuck in the past?</b><br>With no sign of faster SD cards, the CFexpress format is currently coming out on top. Photo: Richard Butler This year's CES trade show came and went with no apparent progress for the SD memory card format, despite higher speeds and capacit…<br><a href=\"https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2569088486/will-sd-cards-remain-forever-stuck-in-the-past",
    "topic": "photo",
    "date": "2026-01-13T15:00:00.000Z"
  },
  {
    "title": "Portrait of Britain: Celebrating the faces that define a nation",
    "q": "portrait of britain: celebrating the faces that define a nation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Portrait of Britain: Celebrating the faces that define a nation</b><br>Portrait of Britain Vol. 8 Winners The British Journal of Photography has announced the winners of Portrait of Britain Vol. 8. The contest, which began in 2016, aims to celebrate the diverse mosaic of individuals who make up Great Britain …<br><a href=\"https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5348491116/portrait-of-britain-celebrating-the-faces-that-define-a-nation",
    "topic": "photo",
    "date": "2026-01-12T21:48:00.000Z"
  },
  {
    "title": "DPReview Reader's Choice Awards 2025: Product of the Year",
    "q": "dpreview reader's choice awards 2025: product of the year camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DPReview Reader's Choice Awards 2025: Product of the Year</b><br>When you use DPReview links to buy products, the site may earn a commission. Product of the Year 2025: the results The final round of voting has closed, and it's time to reveal the winners of our 2025 Readers' Choice Awards! Beginning in D…<br><a href=\"https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5935478172/dpreview-readers-choice-awards-2025-product-of-the-year",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Finding your way out of a creative drought with photo projects",
    "q": "finding your way out of a creative drought with photo projects camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Finding your way out of a creative drought with photo projects</b><br>An image from my third 365 project, taken in 2012. Photo: Abby Ferguson Every photographer inevitably goes through periods where they hit a wall. That wall can come from all kinds of things, including a lack of inspiration, growth stagnati…<br><a href=\"https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/2773392396/finding-your-way-out-of-a-creative-drought-with-photo-projects",
    "topic": "photo",
    "date": "2026-01-11T15:00:00.000Z"
  },
  {
    "title": "Announcing our January 2026 photo challenge: \"Silly Signs\"",
    "q": "announcing our january 2026 photo challenge: \"silly signs\" camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Announcing our January 2026 photo challenge: \"Silly Signs\"</b><br>I came across this sign in a park in St. Petersburg, Russia, many years ago. It says, \"Attention! Keep an eye on your things.\" While the message is serious and a good reminder to tourists, I always thought the illustration was creative and…<br><a href=\"https://www.dpreview.com/articles/0843676549/january-2026-editors-photo-challenge-announced\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0843676549/january-2026-editors-photo-challenge-announced",
    "topic": "photo",
    "date": "2026-01-11T14:00:00.000Z"
  },
  {
    "title": "Photographing Mongolia in winter: part 1",
    "q": "photographing mongolia in winter: part 1 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Mongolia in winter: part 1</b><br>The Khongor Sand Dunes in Mongolia, partially covered by snow and ice. DJI Mavic 2 Pro | ISO 100 | 1/200 sec | F8 Photo: Erez Marom Today, I'd like to talk about my experience shooting landscapes and wildlife in Mongolia. Known for its rem…<br><a href=\"https://www.dpreview.com/articles/6654015450/photographing-mongolia-in-winter-part-1\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/6654015450/photographing-mongolia-in-winter-part-1",
    "topic": "photo",
    "date": "2026-01-10T14:00:00.000Z"
  },
  {
    "title": "The weird way to get a \"free\" X half",
    "q": "the weird way to get a \"free\" x half camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The weird way to get a \"free\" X half</b><br>When you use DPReview links to buy products, the site may earn a commission. More practically, the camera is also $200 off at most retailers, too. Photo: Richard Butler UPDATE Jan. 12: This deal no longer appears to be active on Adorama's …<br><a href=\"https://www.dpreview.com/articles/7840103808/x-half-adorama-sale-free-with-x-t5\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7840103808/x-half-adorama-sale-free-with-x-t5",
    "topic": "photo",
    "date": "2026-01-09T20:07:00.000Z"
  },
  {
    "title": "The best photo and video gear from CES 2026",
    "q": "the best photo and video gear from ces 2026 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best photo and video gear from CES 2026</b><br>Image: Consumer Technology Association (CTA) Today marks the end of the Consumer Electronics Show (CES), the annual trade show that showcases innovative technology and devices. While photography once played a more prominent role at the eve…<br><a href=\"https://www.dpreview.com/news/9310455701/ces-2026-roundup-camera-accessories-photography-videography\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9310455701/ces-2026-roundup-camera-accessories-photography-videography",
    "topic": "photo",
    "date": "2026-01-09T14:00:00.000Z"
  },
  {
    "title": " AU$1,500,000 up for grabs in world's richest photography awards as 2026 HIPA contest theme is revealed! ",
    "q": " au$1,500,000 up for grabs in world's richest photography awards as 2026 hipa contest theme is revealed!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> AU$1,500,000 up for grabs in world's richest photography awards as 2026 HIPA contest theme is revealed! </b><br>HIPA 2026 photo contest opens for entries and is looking for images on the theme of Family<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/au-aud1-500-000-up-for-grabs-in-worlds-richest-photography-awards-as-2026-hipa-contest-theme-is-revealed\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/au-aud1-500-000-up-for-grabs-in-worlds-richest-photography-awards-as-2026-hipa-contest-theme-is-revealed",
    "topic": "photo",
    "date": "2026-01-13T22:40:19.000Z"
  },
  {
    "title": " The US has temporarily eased up on the drone ban, but the exemption list leaves aerial photographers behind ",
    "q": " the us has temporarily eased up on the drone ban, but the exemption list leaves aerial photographers behind  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The US has temporarily eased up on the drone ban, but the exemption list leaves aerial photographers behind </b><br>The US drone ban has been updated to ease off on pre-approved \"Blue List\" models and partially US-made drones<br><a href=\"https://www.digitalcameraworld.com/drones/the-us-has-temporarily-eased-up-on-the-drone-ban-but-the-exemption-list-leaves-aerial-photographers-behind\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/drones/the-us-has-temporarily-eased-up-on-the-drone-ban-but-the-exemption-list-leaves-aerial-photographers-behind",
    "topic": "photo",
    "date": "2026-01-13T17:02:40.000Z"
  },
  {
    "title": " $1,000,000 up for grabs in world's richest photography awards as 2026 HIPA contest theme is revealed! ",
    "q": " $1,000,000 up for grabs in world's richest photography awards as 2026 hipa contest theme is revealed!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> $1,000,000 up for grabs in world's richest photography awards as 2026 HIPA contest theme is revealed! </b><br>HIPA 2026 photo contest opens for entries and is looking for images on the theme of Family<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/usd1-000-000-up-for-grabs-in-worlds-richest-photography-awards-as-latest-hipa-contest-theme-is-revealed\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/usd1-000-000-up-for-grabs-in-worlds-richest-photography-awards-as-latest-hipa-contest-theme-is-revealed",
    "topic": "photo",
    "date": "2026-01-13T16:34:46.000Z"
  },
  {
    "title": " A white Fujifilm X Half appears overseas, as the US is giving black ones away free and UK prices drop… what's going on? ",
    "q": " a white fujifilm x half appears overseas, as the us is giving black ones away free and uk prices drop… what's going on?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> A white Fujifilm X Half appears overseas, as the US is giving black ones away free and UK prices drop… what's going on? </b><br>Fujifilm's compact camera is back in the spotlight: a white edition lands in Asia, US buyers get the black one free with an X-T5, and UK prices are lower than ever<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/a-white-fujifilm-x-half-appears-overseas-as-the-us-is-giving-black-ones-away-free-and-uk-prices-drop-whats-going-on\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/a-white-fujifilm-x-half-appears-overseas-as-the-us-is-giving-black-ones-away-free-and-uk-prices-drop-whats-going-on",
    "topic": "photo",
    "date": "2026-01-13T15:35:59.000Z"
  },
  {
    "title": " The Thypoch Ksana 21mm f/3.5 is built for photographers who miss character in their lenses ",
    "q": " the thypoch ksana 21mm f/3.5 is built for photographers who miss character in their lenses  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Thypoch Ksana 21mm f/3.5 is built for photographers who miss character in their lenses </b><br>Why Thypoch’s Ksana 21mm isbBuilt for photographers who miss character<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/the-thypoch-ksana-21mm-f-3-5-is-built-for-photographers-who-miss-character-in-their-lenses\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/the-thypoch-ksana-21mm-f-3-5-is-built-for-photographers-who-miss-character-in-their-lenses",
    "topic": "photo",
    "date": "2026-01-13T13:22:49.000Z"
  },
  {
    "title": " Kodak has the best-selling compact camera of the year – and it explains everything about 2025  ",
    "q": " kodak has the best-selling compact camera of the year – and it explains everything about 2025   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Kodak has the best-selling compact camera of the year – and it explains everything about 2025  </b><br>This budget compact camera is Japan's best-selling model in 2025, beating premium rivals and highlighting Kodak's dominance of the compact camera comeback<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/kodak-has-the-best-selling-compact-camera-of-the-year-and-it-explains-everything-about-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/kodak-has-the-best-selling-compact-camera-of-the-year-and-it-explains-everything-about-2025",
    "topic": "photo",
    "date": "2026-01-13T13:15:59.000Z"
  },
  {
    "title": " Just released, and already Japan's best-selling camera – leaving 100MP flagship far behind ",
    "q": " just released, and already japan's best-selling camera – leaving 100mp flagship far behind  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Just released, and already Japan's best-selling camera – leaving 100MP flagship far behind </b><br>Fujifilm and Sony's latest releases storm Japan's sales charts, flipping the rankings almost overnight<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/just-released-and-already-japans-best-selling-camera-leaving-100mp-flagship-far-behind\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/just-released-and-already-japans-best-selling-camera-leaving-100mp-flagship-far-behind",
    "topic": "photo",
    "date": "2026-01-13T12:42:04.000Z"
  },
  {
    "title": " This award-winning 'reaction' shot proves there's a lot more to sports photography than the action itself ",
    "q": " this award-winning 'reaction' shot proves there's a lot more to sports photography than the action itself  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This award-winning 'reaction' shot proves there's a lot more to sports photography than the action itself </b><br>Aftermath of women's boxing bout bags Bosnian photographer a category win in 14th season of HIPA awards<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/this-award-winning-reaction-shot-proves-tha-theres-a-lot-more-to-sports-photography-than-the-action-itself\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/this-award-winning-reaction-shot-proves-tha-theres-a-lot-more-to-sports-photography-than-the-action-itself",
    "topic": "photo",
    "date": "2026-01-13T09:13:40.000Z"
  },
  {
    "title": "How to Design a Photo Album | A Step by Step Guide",
    "q": "how to design a photo album | a step by step guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Design a Photo Album | A Step by Step Guide</b><br>Whether you’re a professional or a hobbyist, printing is an important aspect of photography. Instead of images lost in clouds, hard drives, or social media, printing your photography into wall art or albums makes your photography tangible.…<br><a href=\"https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-design-a-photo-album-a-step-by-step-guide/",
    "topic": "photo",
    "date": "2026-01-11T06:50:45.000Z"
  },
  {
    "title": "An Introduction to Posing Female Models",
    "q": "an introduction to posing female models camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>An Introduction to Posing Female Models</b><br>Working with agency models is a highly coveted and sought after goal for many aspiring fashion and beauty photographers. While there are many models who know their angles, the reality is that many of the agency models you are likely to tes…<br><a href=\"https://www.slrlounge.com/three-simple-poses-photographing-female-models/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/three-simple-poses-photographing-female-models/",
    "topic": "photo",
    "date": "2026-01-10T06:38:31.000Z"
  },
  {
    "title": "Photographer Insurance Guide",
    "q": "photographer insurance guide camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Insurance Guide</b><br>Let’s face it, photography is not a cheap venture to get into. Regardless of whether you’re a professional or a hobbyist, buying and keeping your gear up-to-date can be very expensive. Because of this, it’s incredibly important to keep you…<br><a href=\"https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/photographer-insurance-guide-companies-and-options/",
    "topic": "photo",
    "date": "2026-01-09T06:37:32.000Z"
  },
  {
    "title": "15 Tips for Teaching Photography Workshops",
    "q": "15 tips for teaching photography workshops camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>15 Tips for Teaching Photography Workshops</b><br>Hosting a photography workshop may not be the easiest way to earn additional income, but it can prove rewarding when done right. Should you choose to teach one, follow these 15 tips to help ensure that your workshop is a success!<br><a href=\"https://www.slrlounge.com/tips-for-a-photography-workshop/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tips-for-a-photography-workshop/",
    "topic": "photo",
    "date": "2026-01-08T06:35:30.000Z"
  },
  {
    "title": "Nikon Announces the NIKKOR Z 24-105mm f/4-7.1: A Compact Full-Frame Zoom Built for Everyday Versatility",
    "q": "nikon announces the nikkor z 24-105mm f/4-7.1: a compact full-frame zoom built for everyday versatility camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon Announces the NIKKOR Z 24-105mm f/4-7.1: A Compact Full-Frame Zoom Built for Everyday Versatility</b><br>Nikon has officially announced the NIKKOR Z 24-105mm f/4-7.1, a new standard zoom lens for its full-frame Z-mount system. Priced at $549.95 and scheduled to ship in mid-January 2026, the lens targets photographers and hybrid shooters seeki…<br><a href=\"https://www.slrlounge.com/nikon-announces-the-nikkor-z-24-105mm-f-4-7-1-a-compact-full-frame-zoom-built-for-everyday-versatility/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/nikon-announces-the-nikkor-z-24-105mm-f-4-7-1-a-compact-full-frame-zoom-built-for-everyday-versatility/",
    "topic": "photo",
    "date": "2026-01-07T17:23:31.000Z"
  },
  {
    "title": "Neewer Z3 Flash Review – Big Power, Big Feel",
    "q": "neewer z3 flash review – big power, big feel camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Z3 Flash Review – Big Power, Big Feel</b><br>The first thing you notice about the Neewer Z3 Flash is its sheer size and weight. There’s no easing into it. At just over 600g with the battery, this is a chunky speedlite, and for someone like me with cranky hands, it’s not my favourite …<br><a href=\"https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-z3-flash-review-big-power-big-feel/",
    "topic": "photo",
    "date": "2026-01-12T14:00:00.000Z"
  },
  {
    "title": "Review: Hohem iSteady MT3 Pro gimbal",
    "q": "review: hohem isteady mt3 pro gimbal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Hohem iSteady MT3 Pro gimbal</b><br>Hohem’s new iSteady MT3 Pro gimbal has AI tracking and is lightweight yet carries heavier mirrorless and DSLR cameras easily. With its introduction at the 2026 Consumer Electronics Show in Las Vegas, the iSteady MT3 brings filmmakers pro l…<br><a href=\"https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/hohems-new-isteady-mt3-pro-gimbal-has-ai-tracking-and-is-lightweight-yet-carries-heavier-mirrorless-and-dslr-cameras-easily/",
    "topic": "photo",
    "date": "2026-01-06T17:00:00.000Z"
  },
  {
    "title": "Review: Neewer TL90C RGB Tube Light Stick",
    "q": "review: neewer tl90c rgb tube light stick camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer TL90C RGB Tube Light Stick</b><br>This flowing light stick from Neewer is seriously fun to use in the studio. Because it’s fully app-controlled, you can play with colour and effects without ever touching the light, which makes experimenting a breeze. It’s powerful, flexibl…<br><a href=\"https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-tl90c-rgb-tube-light-stick/",
    "topic": "photo",
    "date": "2025-12-19T14:00:00.000Z"
  },
  {
    "title": "Review – Ulanzi Mini Mic A200",
    "q": "review – ulanzi mini mic a200 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review – Ulanzi Mini Mic A200</b><br>Wireless microphone units are getting smaller and more powerful with each iteration. Ulanzi sent me the Mini Mic A200 to check out. The box that this system is packed in is smaller than many units when they have been stripped down. Looking…<br><a href=\"https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-ulanzi-mini-mic-a200/",
    "topic": "photo",
    "date": "2025-12-18T14:00:00.000Z"
  },
  {
    "title": "Huion KeyDial Remote K40 Review",
    "q": "huion keydial remote k40 review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion KeyDial Remote K40 Review</b><br>The Huion KeyDial Remote K40 is one of those little computer gadgets you don’t realise you need until you try it, then suddenly your whole workflow feels smoother. It is essentially a compact shortcut controller with a tactile dial, a stac…<br><a href=\"https://photofocus.com/reviews/huion-keydial-remote-k40-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-keydial-remote-k40-review/",
    "topic": "photo",
    "date": "2025-12-15T22:00:00.000Z"
  },
  {
    "title": "NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!",
    "q": "neewer basics fl10 photography flashlight: fun, versatile, inexpensive! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NEEWER BASICS FL10 Photography Flashlight: Fun, versatile, inexpensive!</b><br>An inexpensive but sturdy four-color flashlight with continuous brightness control, mounts, shaped gobos, and the ability to zoom the light? We couldn’t wait to use the NEEWER Basics FL10 flashlight for, well, all sorts of applications! No…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-basics-fl10-photography-flashlight-fun-versatile-inexpensive/",
    "topic": "photo",
    "date": "2025-12-15T19:00:00.000Z"
  },
  {
    "title": "Godox all-in-one Outdoor Flash, AD300Pro II",
    "q": "godox all-in-one outdoor flash, ad300pro ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox all-in-one Outdoor Flash, AD300Pro II</b><br>The Godox AD300ProII redefines portable power for outdoor creators. Packing 300 Ws into a compact 1.2 kg body, it offers fast recycling, approximately 350 full-power flashes per charge, and full wireless TTL/manual support across major cam…<br><a href=\"https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-all-in-one-outdoor-flash-ad300pro-ii/",
    "topic": "photo",
    "date": "2025-12-15T02:50:05.000Z"
  },
  {
    "title": "Removing Distraction and Color Grading in Lightroom Classic",
    "q": "removing distraction and color grading in lightroom classic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Removing Distraction and Color Grading in Lightroom Classic</b><br>In this video, I’m taking you through a full Lightroom Classic editing workflow using the new Remove tool, restorative masking and colour grading to clean up and enhance a portrait from our Lavender Dreams workshop. I’ll show you how to re…<br><a href=\"https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/software/removing-distraction-and-color-grading-in-lightroom-classic/",
    "topic": "photo",
    "date": "2025-12-10T14:00:00.000Z"
  },
  {
    "title": "Review: NEEWER Z160 Retro Camera Flash",
    "q": "review: neewer z160 retro camera flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: NEEWER Z160 Retro Camera Flash</b><br>THE NEEWER Z160 Retro Camera Flash is a fun, versatile, cool-looking compact and affordable on-camera flash aimed at beginner photographers. It could not be easier to use! It’s also surprisingly useful for a variety of applications. Note: …<br><a href=\"https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-z160-retro-camera-flash/",
    "topic": "photo",
    "date": "2025-12-09T19:00:00.000Z"
  },
  {
    "title": "Inside the White House shitposting machine",
    "q": "inside the white house shitposting machine windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Inside the White House shitposting machine</b><br>Screens at the White House display AI-modified videos of House Minority Leader Hakeem Jeffries (D-NY) and U.S. Senate Minority Leader Chuck Schumer (D-NY) that were shared on social media by President Donald Trump. | Credit: Alex Wong/Gett…<br><a href=\"https://www.theverge.com/column/861476/trump-memes-venezuela-ice-shooting\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/column/861476/trump-memes-venezuela-ice-shooting",
    "topic": "it",
    "date": "2026-01-13T23:27:00.000Z"
  },
  {
    "title": "WeatherTech founder might be the newest US consumer protection official",
    "q": "weathertech founder might be the newest us consumer protection official windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>WeatherTech founder might be the newest US consumer protection official</b><br>President Donald Trump made an unconventional pick for his nomination to the Federal Trade Commission: WeatherTech founder and CEO David MacNeil. MacNeil founded the company, which makes weather-resistant car floor mats, in 1989, according…<br><a href=\"https://www.theverge.com/news/861560/weathertech-founder-david-macneil-federal-trade-commission\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/861560/weathertech-founder-david-macneil-federal-trade-commission",
    "topic": "it",
    "date": "2026-01-13T22:28:00.000Z"
  },
  {
    "title": "I tested several cases for the Switch 2 and these are the best",
    "q": "i tested several cases for the switch 2 and these are the best windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I tested several cases for the Switch 2 and these are the best</b><br>Our picks include carrying cases and ones you can leave on during handheld and docked play. | Image: The Verge, Getty Images You might find it kind of sad to put your hard-earned Switch 2 into a protective case. To me, it’s freeing. Sure, …<br><a href=\"https://www.theverge.com/reviews/691319/best-switch-2-cases\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/reviews/691319/best-switch-2-cases",
    "topic": "it",
    "date": "2026-01-13T21:25:05.000Z"
  },
  {
    "title": "The best phone to buy right now",
    "q": "the best phone to buy right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best phone to buy right now</b><br>Haven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable…<br><a href=\"https://www.theverge.com/22163811/best-phone\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/22163811/best-phone",
    "topic": "it",
    "date": "2026-01-13T20:51:53.000Z"
  },
  {
    "title": "The best noise-canceling headphones to buy right now",
    "q": "the best noise-canceling headphones to buy right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best noise-canceling headphones to buy right now</b><br>Whether you’re wearing them for the morning commute, while traveling, or if you’re simply trying to find some peace and quiet while working at home, noise-canceling headphones are a more essential piece of kit nowadays than ever before. An…<br><a href=\"https://www.theverge.com/21345733/best-noise-canceling-headphones\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21345733/best-noise-canceling-headphones",
    "topic": "it",
    "date": "2026-01-13T20:25:49.000Z"
  },
  {
    "title": " iLife and iWork strike back — Apple’s putting all of its creative and productivity apps under one subscription, Apple Creator Studio, and it’s multiplatform across macOS, iOS, and iPadOS ",
    "q": " ilife and iwork strike back — apple’s putting all of its creative and productivity apps under one subscription, apple creator studio, and it’s multiplatform across macos, ios, and ipados  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> iLife and iWork strike back — Apple’s putting all of its creative and productivity apps under one subscription, Apple Creator Studio, and it’s multiplatform across macOS, iOS, and iPadOS </b><br>Similar to iLife and iWork in years past, Apple is once again bundling its creative and productivity apps under one roof. Apple Creator Studio offers access to its premium apps at a single price and introduces new AI-powered features acros…<br><a href=\"https://www.techradar.com/computing/websites-apps/ilife-and-iwork-strike-back-apples-putting-all-of-its-creative-and-productivity-apps-under-one-subscription-apple-creator-studio-and-its-multiplatform-across-macos-ios-and-ipados\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/websites-apps/ilife-and-iwork-strike-back-apples-putting-all-of-its-creative-and-productivity-apps-under-one-subscription-apple-creator-studio-and-its-multiplatform-across-macos-ios-and-ipados",
    "topic": "it",
    "date": "2026-01-13T23:00:00.000Z"
  },
  {
    "title": " Apple's 13-inch MacBook Air M4 was crowned our best AI laptop of the year — and it's $200 off at Amazon ",
    "q": " apple's 13-inch macbook air m4 was crowned our best ai laptop of the year — and it's $200 off at amazon  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Apple's 13-inch MacBook Air M4 was crowned our best AI laptop of the year — and it's $200 off at Amazon </b><br>Apple's MacBook Air M4 was named TechRadar's best AI laptop of the year, and Amazon is offering a $200 discount, bringing the price down to $799.99.<br><a href=\"https://www.techradar.com/seasonal-sales/apples-13-inch-macbook-air-m4-was-crowned-our-best-ai-laptop-of-the-year-and-its-usd200-off-at-amazon\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/seasonal-sales/apples-13-inch-macbook-air-m4-was-crowned-our-best-ai-laptop-of-the-year-and-its-usd200-off-at-amazon",
    "topic": "it",
    "date": "2026-01-13T20:17:59.000Z"
  },
  {
    "title": " Microsoft to overhaul AI data center building with community-first approach —  says it will 'be a good neighbor' to communities, cover energy cost increases, and replenish water ",
    "q": " microsoft to overhaul ai data center building with community-first approach —  says it will 'be a good neighbor' to communities, cover energy cost increases, and replenish water  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft to overhaul AI data center building with community-first approach —  says it will 'be a good neighbor' to communities, cover energy cost increases, and replenish water </b><br>Microsoft's five-point plan focuses on electricity use, water consumption, building local jobs and training people, investing in local infrastructure, and the long-term skills development of the community surrounding its AI data centers.<br><a href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-to-overhaul-ai-data-center-building-with-community-first-approach-says-it-will-be-a-good-neighbor-to-communities-cover-energy-cost-increases-and-replenish-water\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/microsoft-to-overhaul-ai-data-center-building-with-community-first-approach-says-it-will-be-a-good-neighbor-to-communities-cover-energy-cost-increases-and-replenish-water",
    "topic": "it",
    "date": "2026-01-13T15:58:31.000Z"
  },
  {
    "title": " Trump says that AI tech companies need to ‘pay their own way’ when it comes to their electricity consumption — says major changes are coming to ensure Americans don't 'pick up the tab' for data centers ",
    "q": " trump says that ai tech companies need to ‘pay their own way’ when it comes to their electricity consumption — says major changes are coming to ensure americans don't 'pick up the tab' for data centers  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Trump says that AI tech companies need to ‘pay their own way’ when it comes to their electricity consumption — says major changes are coming to ensure Americans don't 'pick up the tab' for data centers </b><br>The U.S. President says that his team will work with various AI tech companies, starting with Microsoft, to ensure that their power demands will stop affecting the power prices that ordinary Americans pay for.<br><a href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/trump-says-that-ai-tech-companies-need-to-pay-their-own-way-when-it-comes-to-their-electricity-consumption-says-major-changes-are-coming-to-ensure-americans-dont-pick-up-the-tab-for-data-centers\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/artificial-intelligence/trump-says-that-ai-tech-companies-need-to-pay-their-own-way-when-it-comes-to-their-electricity-consumption-says-major-changes-are-coming-to-ensure-americans-dont-pick-up-the-tab-for-data-centers",
    "topic": "it",
    "date": "2026-01-13T14:05:26.000Z"
  },
  {
    "title": "Avoiding the iOS 26 update? 4 reasons iPhone users should do it - ASAP",
    "q": "avoiding the ios 26 update? 4 reasons iphone users should do it - asap windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Avoiding the iOS 26 update? 4 reasons iPhone users should do it - ASAP</b><br>Many iPhone owners may be resisting iOS 26. But this latest version does carry with it important security updates that will keep your phone protected.<br><a href=\"https://www.zdnet.com/article/ios26-upgrade-security-reasons/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/ios26-upgrade-security-reasons/",
    "topic": "it",
    "date": "2026-01-13T20:37:11.000Z"
  },
  {
    "title": " Help shape the future of Windows Central with our audience survey ",
    "q": " help shape the future of windows central with our audience survey  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Help shape the future of Windows Central with our audience survey </b><br>Your input will guide future coverage, features, and community initiatives.<br><a href=\"https://www.windowscentral.com/microsoft/windows/help-shape-the-future-of-windows-central-with-our-audience-survey\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows/help-shape-the-future-of-windows-central-with-our-audience-survey",
    "topic": "it",
    "date": "2026-01-13T20:53:33.000Z"
  },
  {
    "title": " \"If a messaging app is going to use over 400MB of RAM ... I'd at least like to be able to use all of its features\" — WhatsApp has forced a bloated web app on Windows, while keeping its new capabilities mobile‑first and out of reach for PC users ",
    "q": " \"if a messaging app is going to use over 400mb of ram ... i'd at least like to be able to use all of its features\" — whatsapp has forced a bloated web app on windows, while keeping its new capabilities mobile‑first and out of reach for pc users  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> \"If a messaging app is going to use over 400MB of RAM ... I'd at least like to be able to use all of its features\" — WhatsApp has forced a bloated web app on Windows, while keeping its new capabilities mobile‑first and out of reach for PC users </b><br>The new WhatsApp for Windows consumes more RAM than its native predecessor, yet new features like Member Tags and Text Stickers remain mobile-exclusive for now.<br><a href=\"https://www.windowscentral.com/software-apps/if-a-messaging-app-is-going-to-use-over-400mb-of-ram-id-at-least-like-to-be-able-to-use-all-of-its-features-whatsapp-has-forced-a-bloated-web-app-on-windows-while-keeping-its-best-new-features-mobile-first-and-out-of-reach-for-pc-users\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/software-apps/if-a-messaging-app-is-going-to-use-over-400mb-of-ram-id-at-least-like-to-be-able-to-use-all-of-its-features-whatsapp-has-forced-a-bloated-web-app-on-windows-while-keeping-its-best-new-features-mobile-first-and-out-of-reach-for-pc-users",
    "topic": "it",
    "date": "2026-01-13T20:22:20.000Z"
  },
  {
    "title": " Google's parent company Alphabet hits $4 trillion — Google’s AI deal with Apple pays off ",
    "q": " google's parent company alphabet hits $4 trillion — google’s ai deal with apple pays off  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Google's parent company Alphabet hits $4 trillion — Google’s AI deal with Apple pays off </b><br>Alphabet has reached a $4 trillion valuation after Apple selected Google’s Gemini to power parts of Siri, alongside strong cloud growth and continued strength in advertising revenue.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/googles-parent-company-alphabet-hits-usd4-trillion-googles-ai-deal-with-apple-pays-off\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/googles-parent-company-alphabet-hits-usd4-trillion-googles-ai-deal-with-apple-pays-off",
    "topic": "it",
    "date": "2026-01-13T19:36:50.000Z"
  },
  {
    "title": " Zorin OS 18 has reached 2 million downloads, with 1M+ Windows defections fueling one of Linux’s biggest growth stories in 2026 ",
    "q": " zorin os 18 has reached 2 million downloads, with 1m+ windows defections fueling one of linux’s biggest growth stories in 2026  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Zorin OS 18 has reached 2 million downloads, with 1M+ Windows defections fueling one of Linux’s biggest growth stories in 2026 </b><br>Zorin OS 18 has passed 2 million downloads in under three months, with around 75% coming from Windows users as Windows 10 reaches end of life and hardware limits push more people toward Linux.<br><a href=\"https://www.windowscentral.com/microsoft/windows/zorin-os-18-has-reached-2-million-downloads-with-1m-windows-defections-fueling-one-of-linuxs-biggest-growth-stories-in-2026\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows/zorin-os-18-has-reached-2-million-downloads-with-1m-windows-defections-fueling-one-of-linuxs-biggest-growth-stories-in-2026",
    "topic": "it",
    "date": "2026-01-13T17:25:50.000Z"
  },
  {
    "title": "New VoidLink malware framework targets Linux cloud servers",
    "q": "new voidlink malware framework targets linux cloud servers windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New VoidLink malware framework targets Linux cloud servers</b><br>A newly discovered advanced cloud-native Linux malware framework named VoidLink focuses on cloud environments, providing attackers with custom loaders, implants, rootkits, and plugins designed for modern infrastructures. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/new-voidlink-malware-framework-targets-linux-cloud-servers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/new-voidlink-malware-framework-targets-linux-cloud-servers/",
    "topic": "it",
    "date": "2026-01-13T22:12:20.000Z"
  },
  {
    "title": "New Windows updates replace expiring Secure Boot certificates",
    "q": "new windows updates replace expiring secure boot certificates windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>New Windows updates replace expiring Secure Boot certificates</b><br>Microsoft has started rolling out new Secure Boot certificates that will automatically install on eligible Windows 11 24H2 and 25H2 systems. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/microsoft-rolls-out-new-secure-boot-certificates-for-windows-devices/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/microsoft-rolls-out-new-secure-boot-certificates-for-windows-devices/",
    "topic": "it",
    "date": "2026-01-13T19:57:33.000Z"
  },
  {
    "title": "Microsoft releases Windows 10 KB5073724 extended security update",
    "q": "microsoft releases windows 10 kb5073724 extended security update windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft releases Windows 10 KB5073724 extended security update</b><br>Microsoft has released the KB5073724 extended security update to fix the Patch Tuesday security updates, including 3 zero-days and a fix for expiring Secure Boot certificates. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-windows-10-kb5073724-extended-security-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-releases-windows-10-kb5073724-extended-security-update/",
    "topic": "it",
    "date": "2026-01-13T18:56:21.000Z"
  },
  {
    "title": "Windows 11 KB5074109 & KB5073455 cumulative updates released",
    "q": "windows 11 kb5074109 & kb5073455 cumulative updates released windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 KB5074109 & KB5073455 cumulative updates released</b><br>Microsoft has released Windows 11 KB5074109 and KB5073455 cumulative updates for versions 25H2/24H2 and 23H2 to fix security vulnerabilities, bugs, and add new features. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5074109-and-kb5073455-cumulative-updates-released/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5074109-and-kb5073455-cumulative-updates-released/",
    "topic": "it",
    "date": "2026-01-13T18:53:24.000Z"
  },
  {
    "title": "Microsoft January 2026 Patch Tuesday fixes 3 zero-days, 114 flaws",
    "q": "microsoft january 2026 patch tuesday fixes 3 zero-days, 114 flaws windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft January 2026 Patch Tuesday fixes 3 zero-days, 114 flaws</b><br>Today is Microsoft's January 2026 Patch Tuesday with security updates for 114 flaws, including one actively exploited and two publicly disclosed zero-day vulnerabilities. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-january-2026-patch-tuesday-fixes-3-zero-days-114-flaws/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-january-2026-patch-tuesday-fixes-3-zero-days-114-flaws/",
    "topic": "it",
    "date": "2026-01-13T18:34:08.000Z"
  },
  {
    "title": "Google confirms Android bug causing volume key issues",
    "q": "google confirms android bug causing volume key issues windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Google confirms Android bug causing volume key issues</b><br>Google has confirmed a software bug that is preventing volume buttons from working correctly on Android devices with accessibility features enabled. [...]<br><a href=\"https://www.bleepingcomputer.com/news/google/google-confirms-android-bug-causing-volume-key-issues/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/google/google-confirms-android-bug-causing-volume-key-issues/",
    "topic": "it",
    "date": "2026-01-13T18:25:04.000Z"
  },
  {
    "title": "Jellyfin's Roku app has a new coat of paint",
    "q": "jellyfin's roku app has a new coat of paint windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Jellyfin's Roku app has a new coat of paint</b><br>Don't worry, it's not like Plex's Roku app update.<br><a href=\"https://www.howtogeek.com/jellyfin-on-roku-just-got-a-big-update/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/jellyfin-on-roku-just-got-a-big-update/",
    "topic": "it",
    "date": "2026-01-13T21:16:49.000Z"
  },
  {
    "title": "Don’t buy the 2TB iPhone, do this instead",
    "q": "don’t buy the 2tb iphone, do this instead windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Don’t buy the 2TB iPhone, do this instead</b><br>Skip the Apple tax when buying storage.<br><a href=\"https://www.howtogeek.com/dont-buy-the-2tb-iphone-do-this-instead/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/dont-buy-the-2tb-iphone-do-this-instead/",
    "topic": "it",
    "date": "2026-01-13T19:00:16.000Z"
  },
  {
    "title": "Wine 11 is here with big improvements for Windows apps on Linux",
    "q": "wine 11 is here with big improvements for windows apps on linux windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Wine 11 is here with big improvements for Windows apps on Linux</b><br>It's getting easier to run your favorite Windows app without being on Windows.<br><a href=\"https://www.howtogeek.com/wine-11-is-here-with-big-improvements-for-windows-apps-on-linux/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/wine-11-is-here-with-big-improvements-for-windows-apps-on-linux/",
    "topic": "it",
    "date": "2026-01-13T18:14:17.000Z"
  },
  {
    "title": "I started using Microsoft Excel with Copilot and it's been a game-changer",
    "q": "i started using microsoft excel with copilot and it's been a game-changer windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I started using Microsoft Excel with Copilot and it's been a game-changer</b><br>The ultimate duo I didn’t know I needed<br><a href=\"https://www.xda-developers.com/thought-microsoft-excel-was-enough-until-paired-it-with-copilot/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/thought-microsoft-excel-was-enough-until-paired-it-with-copilot/",
    "topic": "it",
    "date": "2026-01-13T23:00:22.000Z"
  },
  {
    "title": "Apple aims to take on Adobe with its new Creator Studio suite",
    "q": "apple aims to take on adobe with its new creator studio suite windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple aims to take on Adobe with its new Creator Studio suite</b><br>The new subscription gives you access to Final Cut Pro, Logic Pro, Pixelmator Pro, and more for $13 per month.<br><a href=\"https://www.xda-developers.com/apple-aims-to-take-on-adobe-with-its-new-creator-studio-suite/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/apple-aims-to-take-on-adobe-with-its-new-creator-studio-suite/",
    "topic": "it",
    "date": "2026-01-13T22:37:52.000Z"
  }
]