[
  {
    "title": "Panasonic Brings Update to ‘Volume Photography’ Features on Lumix S5 II",
    "q": "panasonic brings update to ‘volume photography’ features on lumix s5 ii camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic Brings Update to ‘Volume Photography’ Features on Lumix S5 II</b><br>Panasonic has announced that it is delivering an optional firmware update to the S5 II and S5 IIX that brings a host of updates designed to serve volume photographers, or photographers in fields such as school photos or other types of high…<br><a href=\"https://petapixel.com/2025/10/17/panasonic-brings-update-to-volume-photography-features-on-lumix-s5-ii/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/panasonic-brings-update-to-volume-photography-features-on-lumix-s5-ii/",
    "topic": "photo",
    "date": "2025-10-18T06:16:35.000Z"
  },
  {
    "title": "Annie Leibovitz Is the WPPI 2026 Keynote Speaker",
    "q": "annie leibovitz is the wppi 2026 keynote speaker camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Annie Leibovitz Is the WPPI 2026 Keynote Speaker</b><br>WPPI, the Wedding and Portrait Photographers International conference, is stepping up its game and is poised to put its name back in the minds of photographers as it has announced Annie Leibovitz as the 2026 keynote presenter at its show t…<br><a href=\"https://petapixel.com/2025/10/17/annie-leibovitz-is-the-wppi-2025-keynote-speaker/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/annie-leibovitz-is-the-wppi-2025-keynote-speaker/",
    "topic": "photo",
    "date": "2025-10-18T05:59:44.000Z"
  },
  {
    "title": "CRDBAG’s New Flexible Grid Divide Bends the Rules of Camera Storage",
    "q": "crdbag’s new flexible grid divide bends the rules of camera storage camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>CRDBAG’s New Flexible Grid Divide Bends the Rules of Camera Storage</b><br>Swedish company CRDBAG, best known for its camera storage solutions and accessories, has launched the Grid Divide (stylized \"GRID DIVIDE\") ecosystem, which CRDBAG calls \"the ultimate modular storage for hard cases.\" The new Grid Divide ser…<br><a href=\"https://petapixel.com/2025/10/17/crdbags-new-flexible-grid-divide-bends-the-rules-of-camera-storage/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/crdbags-new-flexible-grid-divide-bends-the-rules-of-camera-storage/",
    "topic": "photo",
    "date": "2025-10-17T19:27:32.000Z"
  },
  {
    "title": "Antique Retouching Desk Was Photoshop for 19th Century Photographers",
    "q": "antique retouching desk was photoshop for 19th century photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Antique Retouching Desk Was Photoshop for 19th Century Photographers</b><br>Photographer Markus Hofstätter, whose creative analog photography projects have been featured on PetaPixel many times, recently tried his hand at manual retouching using an antique retouching desk from the 19th century. [Read More]<br><a href=\"https://petapixel.com/2025/10/17/antique-retouching-desk-was-photoshop-for-19th-century-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/antique-retouching-desk-was-photoshop-for-19th-century-photographers/",
    "topic": "photo",
    "date": "2025-10-17T18:18:53.000Z"
  },
  {
    "title": "Can You Tell Which Photos Were Shot on a Leica – And Which on an iPhone?",
    "q": "can you tell which photos were shot on a leica – and which on an iphone? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Can You Tell Which Photos Were Shot on a Leica – And Which on an iPhone?</b><br>Smartphone cameras have taken giant leaps forward, but can they really be as good as a Leica? Photographer David Imel, who is co-host of the Waveform Podcast, recently created a fascinating test to find out. [Read More]<br><a href=\"https://petapixel.com/2025/10/17/can-you-tell-which-photos-were-shot-on-a-leica-and-which-on-an-iphone/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/can-you-tell-which-photos-were-shot-on-a-leica-and-which-on-an-iphone/",
    "topic": "photo",
    "date": "2025-10-17T16:54:01.000Z"
  },
  {
    "title": "PicSee Solves the Problem of Friends Not Sending You Photos",
    "q": "picsee solves the problem of friends not sending you photos camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PicSee Solves the Problem of Friends Not Sending You Photos</b><br>How often do people go out with friends, take a bunch of photos, and then forget to share them? It's a common problem: many people have dozens, if not hundreds, of images of their friends and family on their phones that they just never sen…<br><a href=\"https://petapixel.com/2025/10/17/picsee-solves-the-problem-of-friends-not-sending-you-photos/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/picsee-solves-the-problem-of-friends-not-sending-you-photos/",
    "topic": "photo",
    "date": "2025-10-17T16:50:19.000Z"
  },
  {
    "title": "NFL Star Goes Undercover as a Nature Photographer",
    "q": "nfl star goes undercover as a nature photographer camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>NFL Star Goes Undercover as a Nature Photographer</b><br>Wide receiver for the Minnesota Vikings Justin Jefferson has gone undercover as a nature photographer for a show on Amazon Prime. [Read More]<br><a href=\"https://petapixel.com/2025/10/17/nfl-star-goes-undercover-as-a-nature-photographer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/nfl-star-goes-undercover-as-a-nature-photographer/",
    "topic": "photo",
    "date": "2025-10-17T14:02:00.000Z"
  },
  {
    "title": "Honor’s ‘Robot Phone’ Has a Pop Out Gimbal Camera",
    "q": "honor’s ‘robot phone’ has a pop out gimbal camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Honor’s ‘Robot Phone’ Has a Pop Out Gimbal Camera</b><br>Honor has announced that it is developing a smartphone with a camera that extends from the device using a robotic arm. For now, there's only a bizarre, mostly AI-generated video of the phone but the company says it will share additional de…<br><a href=\"https://petapixel.com/2025/10/17/honors-robot-phone-has-a-pop-out-gimbal-camera/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/17/honors-robot-phone-has-a-pop-out-gimbal-camera/",
    "topic": "photo",
    "date": "2025-10-17T13:09:13.000Z"
  },
  {
    "title": "The People Who Make Your Photography Dreams a Reality",
    "q": "the people who make your photography dreams a reality camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The People Who Make Your Photography Dreams a Reality</b><br>I recently returned from an incredible trip to Canon's Tokyo headquarters and Utsunomiya lens factory. While the sights and sounds of Tokyo and Utsunomiya are undoubtedly spectacular, and I will carry these memories with me for the rest of…<br><a href=\"https://petapixel.com/2025/10/16/the-people-who-make-your-photography-dreams-a-reality/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/10/16/the-people-who-make-your-photography-dreams-a-reality/",
    "topic": "photo",
    "date": "2025-10-16T22:11:12.000Z"
  },
  {
    "title": "Honor has a wild idea for getting steady smartphone shots",
    "q": "honor has a wild idea for getting steady smartphone shots camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Honor has a wild idea for getting steady smartphone shots</b><br>Image: Honor Chinese technology startup Honor has unveiled a CGI video teaser showcasing a concept smartphone with a gimbal-mounted camera. Honor has dubbed it the \"Robot Phone\" and says it will share additional details at Mobile World Con…<br><a href=\"https://www.dpreview.com/news/3385075551/honor-robot-phone-concept-smartphone-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/3385075551/honor-robot-phone-concept-smartphone-teaser",
    "topic": "photo",
    "date": "2025-10-17T21:02:00.000Z"
  },
  {
    "title": "See the grain effect that's about to make the Nikon Zf even more retro",
    "q": "see the grain effect that's about to make the nikon zf even more retro camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>See the grain effect that's about to make the Nikon Zf even more retro</b><br>When you use DPReview links to buy products, the site may earn a commission. The ability to add a grain effect burnishes the Zf's retro credentials Photo: Richard Butler When Nikon showed us its two new DX lenses, it also let us try the Gr…<br><a href=\"https://www.dpreview.com/articles/0500232021/see-the-grain-effect-that-s-about-to-make-the-nikon-zf-even-more-retro\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0500232021/see-the-grain-effect-that-s-about-to-make-the-nikon-zf-even-more-retro",
    "topic": "photo",
    "date": "2025-10-17T14:00:00.000Z"
  },
  {
    "title": "What the FX do all the letters on Nikon's lenses mean?",
    "q": "what the fx do all the letters on nikon's lenses mean? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What the FX do all the letters on Nikon's lenses mean?</b><br>Image: Nikon While Nikon lens names may not be the most complicated out there (that award probably goes to Tamron), they still aren't short of letters and abbreviations. And while its mirrorless lenses feature more streamlined lens names t…<br><a href=\"https://www.dpreview.com/articles/5275380740/what-do-all-the-letters-mean-on-nikon-lenses\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5275380740/what-do-all-the-letters-mean-on-nikon-lenses",
    "topic": "photo",
    "date": "2025-10-17T13:00:00.000Z"
  },
  {
    "title": "Panasonic launches firmware, updates apps, gives the S9 an extra sheen and adds adventure (kits)",
    "q": "panasonic launches firmware, updates apps, gives the s9 an extra sheen and adds adventure (kits) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic launches firmware, updates apps, gives the S9 an extra sheen and adds adventure (kits)</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced a slew of updates, including firmware updates for cameras, added app features and a 'Titanium Gold' version of its S9 mir…<br><a href=\"https://www.dpreview.com/articles/9079513390/panasonic-updates-everything-s9-titanium-gold-adventure-kits-s5ii-s5iix-s1ii-s1rii-firmware\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9079513390/panasonic-updates-everything-s9-titanium-gold-adventure-kits-s5ii-s5iix-s1ii-s1rii-firmware",
    "topic": "photo",
    "date": "2025-10-16T14:00:00.000Z"
  },
  {
    "title": "Viltrox's new 50mm F1.4 Pro is light on your wallet, but heavy in your bag",
    "q": "viltrox's new 50mm f1.4 pro is light on your wallet, but heavy in your bag camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Viltrox's new 50mm F1.4 Pro is light on your wallet, but heavy in your bag</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Viltrox Sony mirrorless users now have another fast standard prime lens option thanks to Viltrox. The company has announced the AF 50mm F1.4 Pro lens, prom…<br><a href=\"https://www.dpreview.com/news/8654951917/viltrox-s-new-50mm-f1p4-pro-is-light-on-your-wallet-but-heavy-in-your-bag\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/8654951917/viltrox-s-new-50mm-f1p4-pro-is-light-on-your-wallet-but-heavy-in-your-bag",
    "topic": "photo",
    "date": "2025-10-16T13:00:00.000Z"
  },
  {
    "title": "Nikon is finally making a fast zoom for APS-C",
    "q": "nikon is finally making a fast zoom for aps-c camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon is finally making a fast zoom for APS-C</b><br>When you use DPReview links to buy products, the site may earn a commission. Nikon has announced the Nikkor Z DX 16-50mm (24-75 equiv.) F2.8 VR, its first APS-C zoom lens with a fast, constant aperture for its mirrorless Z mount. It's an i…<br><a href=\"https://www.dpreview.com/news/6644590313/nikon-announces-16-50mm-f2p8-vr-aps-c-lens\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6644590313/nikon-announces-16-50mm-f2p8-vr-aps-c-lens",
    "topic": "photo",
    "date": "2025-10-16T04:01:00.000Z"
  },
  {
    "title": "Nikon's 35mm Micro lens is made to get up close and personal",
    "q": "nikon's 35mm micro lens is made to get up close and personal camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon's 35mm Micro lens is made to get up close and personal</b><br>When you use DPReview links to buy products, the site may earn a commission. Photo: Nikon Nikon has announced the Nikkor Z DX Micro 35mm F1.7, an APS-C macro lens with a roughly 53mm equiv. focal length and the ability to focus on subjects…<br><a href=\"https://www.dpreview.com/news/9933786864/nikon-z-dx-35mm-micro-f1p7-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9933786864/nikon-z-dx-35mm-micro-f1p7-announcement",
    "topic": "photo",
    "date": "2025-10-16T04:01:00.000Z"
  },
  {
    "title": "The M5 MacBook Pro's chip might not be \"pro,\" but is that a bad thing?",
    "q": "the m5 macbook pro's chip might not be \"pro,\" but is that a bad thing? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The M5 MacBook Pro's chip might not be \"pro,\" but is that a bad thing?</b><br>Image: Apple Apple has announced a new 14-inch MacBook Pro, with the most substantial upgrade coming from the newly unveiled M5 chip. Though it's using a baseline chip, not a Pro or Max model, Apple promises a host of improvements to perfo…<br><a href=\"https://www.dpreview.com/news/0647298418/the-m5-macbook-pro-s-chip-might-not-be-pro-but-is-that-a-bad-thing\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0647298418/the-m5-macbook-pro-s-chip-might-not-be-pro-but-is-that-a-bad-thing",
    "topic": "photo",
    "date": "2025-10-15T22:01:00.000Z"
  },
  {
    "title": "The new 7Artisans 35mm F1.8 lens combines budget price with premium features",
    "q": "the new 7artisans 35mm f1.8 lens combines budget price with premium features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The new 7Artisans 35mm F1.8 lens combines budget price with premium features</b><br>Image: 7Artisans 7Artisans has released the AF 35mm F1.8 lens for full-frame Sony E, Nikon Z and Leica L mount cameras. The popular prime focal length lens comes at a budget price, yet offers features typically found on more premium models…<br><a href=\"https://www.dpreview.com/news/2574077727/the-new-7artisans-35mm-f1-8-lens-combines-budget-price-with-premium-features\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/2574077727/the-new-7artisans-35mm-f1-8-lens-combines-budget-price-with-premium-features",
    "topic": "photo",
    "date": "2025-10-15T17:51:00.000Z"
  },
  {
    "title": "Budget-friendly Laowa 200mm F2 packs telephoto reach in a lighter build",
    "q": "budget-friendly laowa 200mm f2 packs telephoto reach in a lighter build camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Budget-friendly Laowa 200mm F2 packs telephoto reach in a lighter build</b><br>Image: Laowa Laowa has officially launched its 200mm F2 AF lens for full-frame cameras. The new telephoto prime for Sony E, Nikon Z and Canon EF mounts promises pro-level quality and features yet comes in at nearly half the price of the re…<br><a href=\"https://www.dpreview.com/news/8847394144/budget-friendly-laowa-200mm-f2-packs-telephoto-reach-in-a-lighter-build\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/8847394144/budget-friendly-laowa-200mm-f2-packs-telephoto-reach-in-a-lighter-build",
    "topic": "photo",
    "date": "2025-10-15T15:37:00.000Z"
  },
  {
    "title": " These sample photos prove why the Nikkor Z DX 16-50mm f/2.8 VR is the ‘pro-grade’ Nikon zoom I've been waiting for ",
    "q": " these sample photos prove why the nikkor z dx 16-50mm f/2.8 vr is the ‘pro-grade’ nikon zoom i've been waiting for  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These sample photos prove why the Nikkor Z DX 16-50mm f/2.8 VR is the ‘pro-grade’ Nikon zoom I've been waiting for </b><br>Nikon has finally gifted serious DX Z-camera photographers a ‘holy trinity-style’ standard zoom – and the sample images have got me all excited<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/these-sample-photos-prove-why-the-nikkor-z-dx-16-50mm-f-2-8-vr-is-the-pro-grade-nikon-zoom-ive-been-waiting-for\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/these-sample-photos-prove-why-the-nikkor-z-dx-16-50mm-f-2-8-vr-is-the-pro-grade-nikon-zoom-ive-been-waiting-for",
    "topic": "photo",
    "date": "2025-10-18T12:25:00.000Z"
  },
  {
    "title": " For the love of God! Why the heck don’t cameras come with manuals anymore? ",
    "q": " for the love of god! why the heck don’t cameras come with manuals anymore?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> For the love of God! Why the heck don’t cameras come with manuals anymore? </b><br>Okay, so they’re not exactly on par with page-turning thrillers, but cameras are complicated devices, and a manual is an invaluable reference in learning how to use one<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/for-the-love-of-god-why-the-heck-dont-cameras-come-with-manuals-anymore\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/for-the-love-of-god-why-the-heck-dont-cameras-come-with-manuals-anymore",
    "topic": "photo",
    "date": "2025-10-18T09:13:00.000Z"
  },
  {
    "title": " The Fujifilm X-E5, X Half and GFX 100RF compact cameras aren't just popular – they're award-winning. Here’s why… ",
    "q": " the fujifilm x-e5, x half and gfx 100rf compact cameras aren't just popular – they're award-winning. here’s why…  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Fujifilm X-E5, X Half and GFX 100RF compact cameras aren't just popular – they're award-winning. Here’s why… </b><br>Let's take a closer look at Fujifilm's 2025 camera releases and find out exactly what makes these models so beloved<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/the-fujifilm-x-e5-x-half-and-gfx-100rf-compact-cameras-arent-just-popular-theyre-award-winning-heres-why\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/the-fujifilm-x-e5-x-half-and-gfx-100rf-compact-cameras-arent-just-popular-theyre-award-winning-heres-why",
    "topic": "photo",
    "date": "2025-10-18T06:18:00.000Z"
  },
  {
    "title": " Take advantage of these Nikon US rebates and save up to a whopping $4,800!   ",
    "q": " take advantage of these nikon us rebates and save up to a whopping $4,800!    camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Take advantage of these Nikon US rebates and save up to a whopping $4,800!   </b><br>Nikon pro cameras and lenses gets up to $500 in savings in the latest Nikon rebates<br><a href=\"https://www.digitalcameraworld.com/cameras/take-advantage-of-these-nikon-us-rebates-and-save-up-to-a-whopping-usd4-800\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/take-advantage-of-these-nikon-us-rebates-and-save-up-to-a-whopping-usd4-800",
    "topic": "photo",
    "date": "2025-10-17T16:37:16.000Z"
  },
  {
    "title": " Rod Stewart sets up camera to keep an eye on his model railroad layout as it embarks on transatlantic journey  ",
    "q": " rod stewart sets up camera to keep an eye on his model railroad layout as it embarks on transatlantic journey   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Rod Stewart sets up camera to keep an eye on his model railroad layout as it embarks on transatlantic journey  </b><br>The 'Sailing' hitmaker employed a movie set dismantling crew to painstakingly tear down his sprawling '40s-themed American railroad layout<br><a href=\"https://www.digitalcameraworld.com/cameras/security-cameras/rod-stewart-sets-up-camera-to-keep-an-eye-on-his-model-railroad-layout-as-it-embarks-on-transatlantic-journey\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/security-cameras/rod-stewart-sets-up-camera-to-keep-an-eye-on-his-model-railroad-layout-as-it-embarks-on-transatlantic-journey",
    "topic": "photo",
    "date": "2025-10-17T16:29:06.000Z"
  },
  {
    "title": " Big price drop on SanDisk Extreme Pro 512GB SDXC memory card ",
    "q": " big price drop on sandisk extreme pro 512gb sdxc memory card  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Big price drop on SanDisk Extreme Pro 512GB SDXC memory card </b><br>Get a gigabyte of storage for your camera at a new low price<br><a href=\"https://www.digitalcameraworld.com/cameras/memory-cards/big-price-drop-on-sandisk-extreme-pro-512gb-sdxc-memory-card\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/memory-cards/big-price-drop-on-sandisk-extreme-pro-512gb-sdxc-memory-card",
    "topic": "photo",
    "date": "2025-10-17T15:40:31.000Z"
  },
  {
    "title": " Lowest EVER price on the Canon EOS R50 V with a lens!This content creation camera is slashed to £799 ",
    "q": " lowest ever price on the canon eos r50 v with a lens!this content creation camera is slashed to £799  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Lowest EVER price on the Canon EOS R50 V with a lens!This content creation camera is slashed to £799 </b><br>This is an outstanding deal: the Canon EOS R50 V with Power Zoom lens is down to just £799 –it's lowest price ever!<br><a href=\"https://www.digitalcameraworld.com/cameras/video-cameras/lowest-ever-price-on-the-canon-eos-r50-v-with-a-lens-this-content-creation-camera-is-slashed-to-gbp799\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/video-cameras/lowest-ever-price-on-the-canon-eos-r50-v-with-a-lens-this-content-creation-camera-is-slashed-to-gbp799",
    "topic": "photo",
    "date": "2025-10-17T14:31:13.000Z"
  },
  {
    "title": " Crazy Canon compact camera drops to its BEST-EVER price ",
    "q": " crazy canon compact camera drops to its best-ever price  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Crazy Canon compact camera drops to its BEST-EVER price </b><br>Record FullHD video at the touch of a button with this pocket-sized space-age monocular now slashed in price<br><a href=\"https://www.digitalcameraworld.com/cameras/crazy-canon-compact-camera-drops-to-its-best-ever-price\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/crazy-canon-compact-camera-drops-to-its-best-ever-price",
    "topic": "photo",
    "date": "2025-10-17T13:46:21.000Z"
  },
  {
    "title": " The Rolleiflex queen: Why Diane Keaton will be sorely missed as a photographer ",
    "q": " the rolleiflex queen: why diane keaton will be sorely missed as a photographer  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Rolleiflex queen: Why Diane Keaton will be sorely missed as a photographer </b><br>Beyond the silver screen, Diane Keaton built up a formidable body of photographic work that deserves serious attention.<br><a href=\"https://www.digitalcameraworld.com/photography/fine-art-photography/the-rolleiflex-queen-why-diane-keaton-will-be-sorely-missed-as-a-photographer\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/fine-art-photography/the-rolleiflex-queen-why-diane-keaton-will-be-sorely-missed-as-a-photographer",
    "topic": "photo",
    "date": "2025-10-17T13:04:47.000Z"
  },
  {
    "title": " Fujifilm sweeps Good Design Awards 2025 with instant, compact cameras, lenses, and more (including the X-E5) ",
    "q": " fujifilm sweeps good design awards 2025 with instant, compact cameras, lenses, and more (including the x-e5)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Fujifilm sweeps Good Design Awards 2025 with instant, compact cameras, lenses, and more (including the X-E5) </b><br>Fujifilm is recognized for delivering user-friendly cameras and lenses that inspire creativity across all levels, from instant snapshots to cinematic work<br><a href=\"https://www.digitalcameraworld.com/photography/awards-and-competitions/fujifilm-sweeps-good-design-awards-2025-with-instant-compact-cameras-lenses-and-more-including-the-x-e5\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/awards-and-competitions/fujifilm-sweeps-good-design-awards-2025-with-instant-compact-cameras-lenses-and-more-including-the-x-e5",
    "topic": "photo",
    "date": "2025-10-17T11:52:41.000Z"
  },
  {
    "title": "Artist Feature | How Misty Huss Reinvented Picture Day",
    "q": "artist feature | how misty huss reinvented picture day camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Artist Feature | How Misty Huss Reinvented Picture Day</b><br>Laid off in 2020, Colorado-based photographer Misty Huss was sending résumés into the void when her husband stopped her mid-scroll. “You’re an excellent photographer,” he said, “Go do that!” Days later, athletic directors began calling, an…<br><a href=\"https://www.slrlounge.com/artist-feature-how-misty-huss-reinvented-picture-day/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/artist-feature-how-misty-huss-reinvented-picture-day/",
    "topic": "photo",
    "date": "2025-10-17T15:00:00.000Z"
  },
  {
    "title": "Family Photography Tips and Inspiration",
    "q": "family photography tips and inspiration camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Family Photography Tips and Inspiration</b><br>Family Photography is one of most common genres of photography for amateurs, professionals, and weekend warriors because of its universal demand. Virtually everyone in this world wants a nice photo of their family, regardless of their budg…<br><a href=\"https://www.slrlounge.com/family-photography-tips-and-inspiration/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/family-photography-tips-and-inspiration/",
    "topic": "photo",
    "date": "2025-10-16T17:02:21.000Z"
  },
  {
    "title": "Nikon Expands APS-C Z-Mount Lineup with Two Versatile Lenses: 16-50mm f/2.8 VR and 35mm f/1.7 Macro",
    "q": "nikon expands aps-c z-mount lineup with two versatile lenses: 16-50mm f/2.8 vr and 35mm f/1.7 macro camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon Expands APS-C Z-Mount Lineup with Two Versatile Lenses: 16-50mm f/2.8 VR and 35mm f/1.7 Macro</b><br>Nikon is doubling down on its commitment to DX-format mirrorless users with the launch of two new NIKKOR Z lenses: the NIKKOR Z DX 16-50mm f/2.8 VR and the NIKKOR Z DX MC 35mm f/1.7. Both are compact, affordable, and designed to offer Z50,…<br><a href=\"https://www.slrlounge.com/nikon-expands-aps-c-z-mount-lineup-with-two-versatile-lenses-16-50mm-f-2-8-vr-and-35mm-f-1-7-macro/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/nikon-expands-aps-c-z-mount-lineup-with-two-versatile-lenses-16-50mm-f-2-8-vr-and-35mm-f-1-7-macro/",
    "topic": "photo",
    "date": "2025-10-16T13:42:00.000Z"
  },
  {
    "title": "8 Rainy Day Wedding Photography Tips You Need to Know",
    "q": "8 rainy day wedding photography tips you need to know camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>8 Rainy Day Wedding Photography Tips You Need to Know</b><br>Whenever we are faced with a wedding that has even the slightest chance of rain, we are reminded of a certain Boyz II Men song, because as they so beautifully sing, “Storms will come, but tell me, baby, can you stand the rain?” The true te…<br><a href=\"https://www.slrlounge.com/8-rainy-day-wedding-photography-tips-you-need-to-know/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/8-rainy-day-wedding-photography-tips-you-need-to-know/",
    "topic": "photo",
    "date": "2025-10-15T16:35:27.000Z"
  },
  {
    "title": "8 Tips on How To Get More Photography Clients",
    "q": "8 tips on how to get more photography clients camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>8 Tips on How To Get More Photography Clients</b><br>If you’re still struggling to get enough clients, know that it doesn’t have to be this way.<br><a href=\"https://www.slrlounge.com/5-ways-get-photography-clients/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/5-ways-get-photography-clients/",
    "topic": "photo",
    "date": "2025-10-14T22:32:26.000Z"
  },
  {
    "title": "Food Photography Tips | The Basics for Getting Started",
    "q": "food photography tips | the basics for getting started camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Food Photography Tips | The Basics for Getting Started</b><br>Food photography has been booming in the recent years, with many photographers ditching portrait and wedding gigs to concentrate their whole business solely on this niche.<br><a href=\"https://www.slrlounge.com/basics-food-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/basics-food-photography/",
    "topic": "photo",
    "date": "2025-10-14T16:23:27.000Z"
  },
  {
    "title": "Best Memory Card Holders And Wallets",
    "q": "best memory card holders and wallets camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Card Holders And Wallets</b><br>Keeping your memory cards organized and safe is more important than ever. Whether you’re a professional photographer, an avid traveler, or a content creator, having a reliable memory card holder or wallet can make all the difference in pro…<br><a href=\"https://www.slrlounge.com/best-memory-card-holders-and-wallets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-card-holders-and-wallets/",
    "topic": "photo",
    "date": "2025-10-13T16:06:27.000Z"
  },
  {
    "title": "PolarPro Spectra Center Split Filter (67 mm) Review",
    "q": "polarpro spectra center split filter (67 mm) review camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PolarPro Spectra Center Split Filter (67 mm) Review</b><br>Do You Really Need Another Filter? Maybe You Do, Maybe you Don’t — Meet the PolarPro Spectra Centre Split Filter If you’re anything like me, you’ve probably got a drawer full of filters — ND, CPL, diffusion, star, you name it. So, do you r…<br><a href=\"https://photofocus.com/reviews/polarpro-spectra-center-split-filter-67-mm-review/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/polarpro-spectra-center-split-filter-67-mm-review/",
    "topic": "photo",
    "date": "2025-10-18T01:00:00.000Z"
  },
  {
    "title": "DxO PhotoLab 9.1 vs PhotoLab 8: Is the Upgrade Really Worth It?",
    "q": "dxo photolab 9.1 vs photolab 8: is the upgrade really worth it? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO PhotoLab 9.1 vs PhotoLab 8: Is the Upgrade Really Worth It?</b><br>DxO PhotoLab is DxO’s flagship RAW-development and photo editing software (non-destructive, with strong lens & camera correction capabilities, local adjustments, etc.). Over the years, its appeal has been in combining “optical corrections …<br><a href=\"https://photofocus.com/reviews/dxo-photolab-9-1-vs-photolab-8-is-the-upgrade-really-worth-it/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/dxo-photolab-9-1-vs-photolab-8-is-the-upgrade-really-worth-it/",
    "topic": "photo",
    "date": "2025-10-17T01:00:00.000Z"
  },
  {
    "title": "PGYTECH OneGo Lite Backpack Review: A Sleek Everyday Camera Bag for Creators",
    "q": "pgytech onego lite backpack review: a sleek everyday camera bag for creators camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>PGYTECH OneGo Lite Backpack Review: A Sleek Everyday Camera Bag for Creators</b><br>If you’re anything like me, you probably already have a heap of different camera bags. Do you need one more? Maybe. Or perhaps you’re still searching for that perfect balance of size, functionality, and comfort? Then you might want to chec…<br><a href=\"https://photofocus.com/reviews/bags/pgytech-onego-lite-backpack-review-a-sleek-everyday-camera-bag-for-creators/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/bags/pgytech-onego-lite-backpack-review-a-sleek-everyday-camera-bag-for-creators/",
    "topic": "photo",
    "date": "2025-10-16T01:00:00.000Z"
  },
  {
    "title": "Neewer Q6 vs Q4: Which Studio Strobe Is Right for You?",
    "q": "neewer q6 vs q4: which studio strobe is right for you? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer Q6 vs Q4: Which Studio Strobe Is Right for You?</b><br>When it comes to choosing the right studio strobe, the Neewer Q6 and Q4 are two powerful contenders that photographers often compare. Both offer excellent performance, but their differences in power, speed, battery life, and colour accurac…<br><a href=\"https://photofocus.com/photography/lighting-photography/neewer-q6-vs-q4-which-studio-strobe-is-right-for-you/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/neewer-q6-vs-q4-which-studio-strobe-is-right-for-you/",
    "topic": "photo",
    "date": "2025-10-15T12:00:00.000Z"
  },
  {
    "title": "Exciting News: DxO FilmPack 8 Has Arrived!",
    "q": "exciting news: dxo filmpack 8 has arrived! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Exciting News: DxO FilmPack 8 Has Arrived!</b><br>As someone who adores blending the magic of old-school film with the freedom of digital, I couldn’t be more excited about the release of DxO FilmPack 8. This update is a true gift for photographers who love storytelling through mood, textu…<br><a href=\"https://photofocus.com/news/exciting-news-dxo-filmpack-8-has-arrived/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/exciting-news-dxo-filmpack-8-has-arrived/",
    "topic": "photo",
    "date": "2025-10-14T23:53:50.000Z"
  },
  {
    "title": "Pro technique: Rear curtain flash sync",
    "q": "pro technique: rear curtain flash sync camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Pro technique: Rear curtain flash sync</b><br>“Talk about a challenge! Inventor of the Platypod ecosystem, Dr. T asked me to push the envelope once again knowing I like a challenge. Nice background. Continuous LED panel light for blurred movement. Rear curtain sync flash lighting the …<br><a href=\"https://photofocus.com/photography/pro-technique-rear-curtain-flash-sync/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/pro-technique-rear-curtain-flash-sync/",
    "topic": "photo",
    "date": "2025-10-08T20:00:00.000Z"
  },
  {
    "title": "The power of looking up in architecture photography",
    "q": "the power of looking up in architecture photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The power of looking up in architecture photography</b><br>When it comes to architecture photography, looking up is inevitable. Towering skyscrapers will often force you to point your camera to their height. Some buildings and architectural elements also only reveal their full effect when viewed f…<br><a href=\"https://photofocus.com/inspiration/the-power-of-looking-up-in-architecture-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/inspiration/the-power-of-looking-up-in-architecture-photography/",
    "topic": "photo",
    "date": "2025-10-08T16:00:00.000Z"
  },
  {
    "title": "Travel tips for capturing the best of fall",
    "q": "travel tips for capturing the best of fall camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Travel tips for capturing the best of fall</b><br>When the weather cools down, the days get shorter and the leaves start to change color, for me, it’s time to hit the road for some R&R and to capture some of that fall color. Whether you’re camping or staying in motels, there are some grea…<br><a href=\"https://photofocus.com/photography/shooting-photography/travel-tips-for-capturing-the-best-of-fall/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/shooting-photography/travel-tips-for-capturing-the-best-of-fall/",
    "topic": "photo",
    "date": "2025-10-07T20:00:00.000Z"
  },
  {
    "title": "Review: Neewer X11 2-in-1 Teleprompter with Monitor",
    "q": "review: neewer x11 2-in-1 teleprompter with monitor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer X11 2-in-1 Teleprompter with Monitor</b><br>Interested in an inexpensive teleprompter with a monitor for content creation, professional video presentations, live streaming, and more? Neewer recently sent us an X11 2-In-1 Teleprompter with Monitor to try, and here’s what we found. No…<br><a href=\"https://photofocus.com/reviews/review-neewer-x11-2-in-1-teleprompter-with-monitor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-x11-2-in-1-teleprompter-with-monitor/",
    "topic": "photo",
    "date": "2025-10-06T16:00:00.000Z"
  },
  {
    "title": "The best budget smartphone you can buy",
    "q": "the best budget smartphone you can buy windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best budget smartphone you can buy</b><br>You can get a great budget device these days if you know how to pick your priorities. | Image: The Verge Some of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things d…<br><a href=\"https://www.theverge.com/21420196/best-budget-smartphone-cheap\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/21420196/best-budget-smartphone-cheap",
    "topic": "it",
    "date": "2025-10-18T00:01:49.000Z"
  },
  {
    "title": "The US has a new roadmap for fusion energy, without the funds to back it up",
    "q": "the us has a new roadmap for fusion energy, without the funds to back it up windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The US has a new roadmap for fusion energy, without the funds to back it up</b><br>Guests await the beginning of a news conference at the Department of Energy headquarters to announce a breakthrough in fusion research on December 13, 2022 in Washington, DC. The officials announced that experiments at the National Ignitio…<br><a href=\"https://www.theverge.com/news/802070/nuclear-fusion-energy-ai-trump-roadmap\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/802070/nuclear-fusion-energy-ai-trump-roadmap",
    "topic": "it",
    "date": "2025-10-17T22:21:39.000Z"
  },
  {
    "title": "Ex-lidar CEO makes a bid to reclaim his company",
    "q": "ex-lidar ceo makes a bid to reclaim his company windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Ex-lidar CEO makes a bid to reclaim his company</b><br>Ex-Luminar CEO Austin Russell is trying to wrest back control of his company. | Image: Andrew J. Hawkins / The Verge Earlier this year, Luminar founder and CEO Austin Russell abruptly resigned from his position after it was revealed he was…<br><a href=\"https://www.theverge.com/news/801827/ex-lidar-ceo-makes-a-bid-to-reclaim-his-company\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/801827/ex-lidar-ceo-makes-a-bid-to-reclaim-his-company",
    "topic": "it",
    "date": "2025-10-17T18:12:29.000Z"
  },
  {
    "title": " iPad vs iPad Air: Which Apple tablet is right for you?  ",
    "q": " ipad vs ipad air: which apple tablet is right for you?   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> iPad vs iPad Air: Which Apple tablet is right for you?  </b><br>The base-model iPad is the best value it’s ever been, while the iPad Air offers incredible power – here’s our head-to-head to help you choose between Apple’s cheaper tablets.<br><a href=\"https://www.techradar.com/tablets/ipad/ipad-vs-ipad-air-which-apple-tablet-is-right-for-you\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/tablets/ipad/ipad-vs-ipad-air-which-apple-tablet-is-right-for-you",
    "topic": "it",
    "date": "2025-10-18T10:30:00.000Z"
  },
  {
    "title": " What is Windows 10 IoT Enterprise LTSC 2021 and why does it expire in 2032 and not in 2025? ",
    "q": " what is windows 10 iot enterprise ltsc 2021 and why does it expire in 2032 and not in 2025?  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> What is Windows 10 IoT Enterprise LTSC 2021 and why does it expire in 2032 and not in 2025? </b><br>Windows 10 end of life may be here, but Windows 10 IoT Enterprise LTSC 2021 has support until 2032.<br><a href=\"https://www.techradar.com/computing/windows/what-is-windows-10-iot-enterprise-ltsc-2021-and-why-does-it-expire-in-2032-and-not-in-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/what-is-windows-10-iot-enterprise-ltsc-2021-and-why-does-it-expire-in-2032-and-not-in-2025",
    "topic": "it",
    "date": "2025-10-18T10:23:00.000Z"
  },
  {
    "title": " How to plan a smooth Windows 10 to Windows 11 migration - even if you missed the October 14th deadline ",
    "q": " how to plan a smooth windows 10 to windows 11 migration - even if you missed the october 14th deadline  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> How to plan a smooth Windows 10 to Windows 11 migration - even if you missed the October 14th deadline </b><br>Windows 11 offers superior productivity and efficiency gains, and its not too late to make the switch from Windows 10 now that it has reached end of life.<br><a href=\"https://www.techradar.com/computing/windows/how-to-plan-a-smooth-windows-10-to-windows-11-migration-even-if-you-missed-the-october-14th-deadline\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/windows/how-to-plan-a-smooth-windows-10-to-windows-11-migration-even-if-you-missed-the-october-14th-deadline",
    "topic": "it",
    "date": "2025-10-18T09:00:00.000Z"
  },
  {
    "title": "Premier League Soccer: Livestream Man City vs. Everton From Anywhere",
    "q": "premier league soccer: livestream man city vs. everton from anywhere windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Premier League Soccer: Livestream Man City vs. Everton From Anywhere</b><br>Can the Toffees stop goal machine Erling Haaland?<br><a href=\"https://www.cnet.com/tech/services-and-software/premier-league-soccer-livestream-man-city-vs-everton-from-anywhere/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/premier-league-soccer-livestream-man-city-vs-everton-from-anywhere/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-10-18T11:00:07.000Z"
  },
  {
    "title": "Here's Where to Find Delicious and Easy Recipes on Your iPhone Now",
    "q": "here's where to find delicious and easy recipes on your iphone now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Here's Where to Find Delicious and Easy Recipes on Your iPhone Now</b><br>Apple News Plus and some Apple One subscribers can access recipes and more at no additional cost.<br><a href=\"https://www.cnet.com/tech/services-and-software/heres-where-to-find-delicious-and-easy-recipes-on-your-iphone-now/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/heres-where-to-find-delicious-and-easy-recipes-on-your-iphone-now/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-10-18T10:00:03.000Z"
  },
  {
    "title": " Intel Foundry secures contract to build Microsoft's Maia 2 next-gen AI processor on 18A/18A-P node, claims report — could be first step in ongoing partnership ",
    "q": " intel foundry secures contract to build microsoft's maia 2 next-gen ai processor on 18a/18a-p node, claims report — could be first step in ongoing partnership  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Intel Foundry secures contract to build Microsoft's Maia 2 next-gen AI processor on 18A/18A-P node, claims report — could be first step in ongoing partnership </b><br>Intel Foundry will reportedly produce Microsoft's next-generation Maia processor for AI applications on its 18A process technology, which could mark a big win for the company both in terms of earnings and goodwill.<br><a href=\"https://www.tomshardware.com/tech-industry/semiconductors/intel-foundry-secures-contract-to-build-microsofts-maia-2-next-gen-ai-processor-on-18a-18a-p-node-claims-report-could-be-first-step-in-ongoing-partnership\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-foundry-secures-contract-to-build-microsofts-maia-2-next-gen-ai-processor-on-18a-18a-p-node-claims-report-could-be-first-step-in-ongoing-partnership",
    "topic": "it",
    "date": "2025-10-17T16:44:37.000Z"
  },
  {
    "title": " Micron is preparing to exit China’s data center memory market completely, report claims — Beijing banned company's chips from 'critical information infrastructure' in 2023  ",
    "q": " micron is preparing to exit china’s data center memory market completely, report claims — beijing banned company's chips from 'critical information infrastructure' in 2023   windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Micron is preparing to exit China’s data center memory market completely, report claims — Beijing banned company's chips from 'critical information infrastructure' in 2023  </b><br>Micron is reportedly preparing to halt sales of server memory chips to data centers in mainland China, after its business there failed to recover from a 2023 cybersecurity ban.<br><a href=\"https://www.tomshardware.com/pc-components/ram/reports-suggest-micron-is-preparing-to-exit-chinas-data-center-memory-market\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/pc-components/ram/reports-suggest-micron-is-preparing-to-exit-chinas-data-center-memory-market",
    "topic": "it",
    "date": "2025-10-17T14:59:32.000Z"
  },
  {
    "title": "Every product Apple launched this week: M5 MacBook Pro, iPad, $3,500 Vision Pro, more",
    "q": "every product apple launched this week: m5 macbook pro, ipad, $3,500 vision pro, more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Every product Apple launched this week: M5 MacBook Pro, iPad, $3,500 Vision Pro, more</b><br>Apple has unveiled three new Pro devices with an all-new chipset that focuses on AI compute performance. Here's what to know.<br><a href=\"https://www.zdnet.com/article/every-product-apple-launched-this-week-m5-macbook-pro-ipad-3500-vision-pro-more/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/every-product-apple-launched-this-week-m5-macbook-pro-ipad-3500-vision-pro-more/",
    "topic": "it",
    "date": "2025-10-18T11:00:31.000Z"
  },
  {
    "title": "5 apps I always install on every new Windows PC - and why they're essential",
    "q": "5 apps i always install on every new windows pc - and why they're essential windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>5 apps I always install on every new Windows PC - and why they're essential</b><br>For productivity, entertainment, and simply a better user experience, look to these services that don't cost a thing.<br><a href=\"https://www.zdnet.com/article/5-apps-i-always-install-on-every-new-windows-pc-and-why-theyre-essential/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/5-apps-i-always-install-on-every-new-windows-pc-and-why-theyre-essential/",
    "topic": "it",
    "date": "2025-10-18T08:00:34.000Z"
  },
  {
    "title": "Are high-end Windows laptops worth buying? I tested one from Dell, and it made a statement",
    "q": "are high-end windows laptops worth buying? i tested one from dell, and it made a statement windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Are high-end Windows laptops worth buying? I tested one from Dell, and it made a statement</b><br>The latest Dell 14 Premium picks up where the XPS model left off, as a sleek and modern workstation for professionals and power users.<br><a href=\"https://www.zdnet.com/article/are-high-end-windows-laptops-worth-buying-i-tested-one-from-dell-and-it-made-a-statement/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/are-high-end-windows-laptops-worth-buying-i-tested-one-from-dell-and-it-made-a-statement/",
    "topic": "it",
    "date": "2025-10-17T18:48:00.000Z"
  },
  {
    "title": " “I saw numerous records marked as confidential” — 40 billion unencrypted records exposed by marketing firm, raising serious security concerns ",
    "q": " “i saw numerous records marked as confidential” — 40 billion unencrypted records exposed by marketing firm, raising serious security concerns  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> “I saw numerous records marked as confidential” — 40 billion unencrypted records exposed by marketing firm, raising serious security concerns </b><br>Cybersecurity expert Jeremiah Fowler discovered a trove of 40 billion records totaling 13TB sitting unencrypted and open. They stem from Netcore, an AI-powered marketing platform working with more than 6,500 worldwide brands.<br><a href=\"https://www.windowscentral.com/hardware/storage/13tb-40-billion-records-data-leak-netcore\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/storage/13tb-40-billion-records-data-leak-netcore",
    "topic": "it",
    "date": "2025-10-17T14:57:09.000Z"
  },
  {
    "title": " How Anthropic's Claude AI now enhances Outlook, Teams, and OneDrive — here's what you need to know ",
    "q": " how anthropic's claude ai now enhances outlook, teams, and onedrive — here's what you need to know  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> How Anthropic's Claude AI now enhances Outlook, Teams, and OneDrive — here's what you need to know </b><br>Announced today is a new integration featuring Anthropic's Claude AI and Microsoft 365 apps, including SharePoint, OneDrive, Outlook, and Teams. Here's how it works and how you can give it a shot.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/anthropic-claude-ai-microsoft-365-connect\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/anthropic-claude-ai-microsoft-365-connect",
    "topic": "it",
    "date": "2025-10-17T13:50:39.000Z"
  },
  {
    "title": " Microsoft is reportedly moving Surface and Xbox production — no prizes for guessing why ",
    "q": " microsoft is reportedly moving surface and xbox production — no prizes for guessing why  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is reportedly moving Surface and Xbox production — no prizes for guessing why </b><br>Microsoft is reportedly planning to move Surface production out of China by 2026 and is also encouraging Xbox production to be shifted overseas. The move comes amid escalating U.S.–China trade tensions, with new tariffs, port fees, and exp…<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-is-reportedly-moving-surface-and-xbox-production-no-prizes-for-guessing-why\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-is-reportedly-moving-surface-and-xbox-production-no-prizes-for-guessing-why",
    "topic": "it",
    "date": "2025-10-17T11:53:29.000Z"
  },
  {
    "title": "ConnectWise fixes Automate bug allowing AiTM update attacks",
    "q": "connectwise fixes automate bug allowing aitm update attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>ConnectWise fixes Automate bug allowing AiTM update attacks</b><br>ConnectWise released a security update to address vulnerabilities, one of them with critical severity, in Automate product that could expose sensitive communications to interception and modification. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/connectwise-fixes-automate-bug-allowing-aitm-update-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/connectwise-fixes-automate-bug-allowing-aitm-update-attacks/",
    "topic": "it",
    "date": "2025-10-17T19:29:22.000Z"
  },
  {
    "title": "Microsoft lifts more safeguard holds blocking Windows 11 updates",
    "q": "microsoft lifts more safeguard holds blocking windows 11 updates windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft lifts more safeguard holds blocking Windows 11 updates</b><br>Microsoft has removed two more compatibility holds preventing customers from installing Windows 11 24H2 via Windows Update. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-lifts-more-safeguard-holds-blocking-windows-11-updates/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-lifts-more-safeguard-holds-blocking-windows-11-updates/",
    "topic": "it",
    "date": "2025-10-17T17:22:16.000Z"
  },
  {
    "title": "Microsoft fixes highest-severity ASP.NET Core flaw ever",
    "q": "microsoft fixes highest-severity asp.net core flaw ever windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft fixes highest-severity ASP.NET Core flaw ever</b><br>Earlier this week, Microsoft patched a vulnerability that was flagged with the \"highest ever\" severity rating received by an ASP.NET Core security flaw. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-highest-severity-aspnet-core-flaw-ever/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-highest-severity-aspnet-core-flaw-ever/",
    "topic": "it",
    "date": "2025-10-17T15:35:49.000Z"
  },
  {
    "title": "Microsoft fixes Windows bug breaking localhost HTTP connections",
    "q": "microsoft fixes windows bug breaking localhost http connections windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft fixes Windows bug breaking localhost HTTP connections</b><br>Microsoft has fixed a known issue breaking HTTP/2 localhost (127.0.0.1) connections and IIS websites after installing recent Windows security updates. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-bug-breaking-localhost-http-connections/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-windows-bug-breaking-localhost-http-connections/",
    "topic": "it",
    "date": "2025-10-17T13:58:27.000Z"
  },
  {
    "title": "Over 266,000 F5 BIG-IP instances exposed to remote attacks",
    "q": "over 266,000 f5 big-ip instances exposed to remote attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Over 266,000 F5 BIG-IP instances exposed to remote attacks</b><br>Internet security nonprofit Shadowserver Foundation has found more than 266,000 F5 BIG-IP instances exposed online after the security breach disclosed by cybersecurity company F5 this week. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/over-266-000-f5-big-ip-instances-exposed-to-remote-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/over-266-000-f5-big-ip-instances-exposed-to-remote-attacks/",
    "topic": "it",
    "date": "2025-10-17T12:16:23.000Z"
  },
  {
    "title": "Windows 11 updates break localhost (127.0.0.1) HTTP/2 connections",
    "q": "windows 11 updates break localhost (127.0.0.1) http/2 connections windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 updates break localhost (127.0.0.1) HTTP/2 connections</b><br>Microsoft's October Windows 11 updates have broken the \"localhost\" functionality, making applications that connect back to 127.0.0.1 over HTTP/2 no longer function properly. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/windows-11-updates-break-localhost-127001-http-2-connections/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-updates-break-localhost-127001-http-2-connections/",
    "topic": "it",
    "date": "2025-10-16T22:25:46.000Z"
  },
  {
    "title": "4 Reasons Doom Emacs Should Be Your Next Programming Project",
    "q": "4 reasons doom emacs should be your next programming project windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>4 Reasons Doom Emacs Should Be Your Next Programming Project</b><br>Programmers should never shy away from a difficult challenge, especially ones so rewarding.<br><a href=\"https://www.howtogeek.com/reasons-why-doom-emacs-should-be-your-next-project/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/reasons-why-doom-emacs-should-be-your-next-project/",
    "topic": "it",
    "date": "2025-10-18T11:00:15.000Z"
  },
  {
    "title": "How to Use the UNIQUE Function in Microsoft Excel",
    "q": "how to use the unique function in microsoft excel windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How to Use the UNIQUE Function in Microsoft Excel</b><br>Extract distinct values from a dataset.<br><a href=\"https://www.howtogeek.com/microsoft-excel-unique-function-how-to-use/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/microsoft-excel-unique-function-how-to-use/",
    "topic": "it",
    "date": "2025-10-17T22:00:16.000Z"
  },
  {
    "title": "Apple's New M5 Chip Might Actually Be Pretty Good",
    "q": "apple's new m5 chip might actually be pretty good windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple's New M5 Chip Might Actually Be Pretty Good</b><br>If this is true, it's pretty promising.<br><a href=\"https://www.howtogeek.com/apple-new-m5-chip-might-actually-be-pretty-good/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/apple-new-m5-chip-might-actually-be-pretty-good/",
    "topic": "it",
    "date": "2025-10-17T21:35:43.000Z"
  },
  {
    "title": "I replaced Docker Desktop with a new dashboard and I won’t go back",
    "q": "i replaced docker desktop with a new dashboard and i won’t go back windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I replaced Docker Desktop with a new dashboard and I won’t go back</b><br>I realized it's not Docker I don't like, it's the official tools for using it on Windows<br><a href=\"https://www.xda-developers.com/hated-docker-until-found-this-dashboard-replacement/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/hated-docker-until-found-this-dashboard-replacement/",
    "topic": "it",
    "date": "2025-10-18T09:00:20.000Z"
  },
  {
    "title": "Microsoft is finally adding dark mode to the folder and Run windows, and they're looking slick",
    "q": "microsoft is finally adding dark mode to the folder and run windows, and they're looking slick windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft is finally adding dark mode to the folder and Run windows, and they're looking slick</b><br>Vampires, rejoice.<br><a href=\"https://www.xda-developers.com/microsoft-finally-adding-dark-mode-folderrun-windows/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/microsoft-finally-adding-dark-mode-folderrun-windows/",
    "topic": "it",
    "date": "2025-10-18T04:53:45.000Z"
  }
]