[
  {
    "title": "18 Gift Ideas for Photographers for All Budgets",
    "q": "18 gift ideas for photographers for all budgets camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>18 Gift Ideas for Photographers for All Budgets</b><br>The holiday season is not far off, and photographers may be thinking about what they want as a gift. Here are some gift ideas for photographers of all levels of experience and budgets. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/",
    "topic": "photo",
    "date": "2025-11-29T18:00:37.000Z"
  },
  {
    "title": "Camp Snap 8 (CS-8) Review: Pretty But Preposterous",
    "q": "camp snap 8 (cs-8) review: pretty but preposterous camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Camp Snap 8 (CS-8) Review: Pretty But Preposterous</b><br>The original Camp Snap camera was released a while back and became an unexpected hit. This digital camera was extremely limited and lacked an LCD screen in an attempt to bring the fun back to photography. Now Camp Snap is bringing this phi…<br><a href=\"https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/",
    "topic": "photo",
    "date": "2025-11-29T15:01:05.000Z"
  },
  {
    "title": "113 Years Ago, the US Tried to Outlaw Fake Photographs",
    "q": "113 years ago, the us tried to outlaw fake photographs camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>113 Years Ago, the US Tried to Outlaw Fake Photographs</b><br>It’s easy to imagine that anxiety over manipulated images began with Photoshop or AI, but photographers have been wrestling with the problem almost since the birth of the medium. More than a century ago (113 years back to be exact), the U.…<br><a href=\"https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "This New Astrophotography Camera Has a 44MP Full-Frame Sensor",
    "q": "this new astrophotography camera has a 44mp full-frame sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This New Astrophotography Camera Has a 44MP Full-Frame Sensor</b><br>ZWO has announced a new 44-megapixel full-frame camera designed specifically for astrophotography, and its specs are impressive. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/",
    "topic": "photo",
    "date": "2025-11-28T22:03:46.000Z"
  },
  {
    "title": "The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’",
    "q": "the five most shocking claims made by netflix’s ‘the stringer’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’</b><br>Finally the day has come: The Stringer: The Man Who Took the Photo, a film about who really took the famous Napalm Girl photo during the Vietnam War, has dropped on Netflix meaning anyone with a subscription can now see what the fuss is al…<br><a href=\"https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/",
    "topic": "photo",
    "date": "2025-11-28T22:00:20.000Z"
  },
  {
    "title": "Sony Releases Major Firmware Updates for a7R V and a7 IV",
    "q": "sony releases major firmware updates for a7r v and a7 iv camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Sony Releases Major Firmware Updates for a7R V and a7 IV</b><br>Sony has issued significant new firmware updates for two of its most widely used full-frame mirrorless cameras, bringing the a7R V to Version 4.00 and the a7 IV to Version 6.00. The updates expand focus control options, add new video workf…<br><a href=\"https://petapixel.com/2025/11/28/sony-releases-major-firmware-updates-for-a7r-v-and-a7-iv/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/sony-releases-major-firmware-updates-for-a7r-v-and-a7-iv/",
    "topic": "photo",
    "date": "2025-11-28T19:03:25.000Z"
  },
  {
    "title": "This Free Calculator Figures Out Your Anamorphic Aspect Ratios",
    "q": "this free calculator figures out your anamorphic aspect ratios camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Free Calculator Figures Out Your Anamorphic Aspect Ratios</b><br>Anamorphic lenses are a regular part of many cinematographers' kits, especially as new anamorphic lenses become more affordable and more cameras include more video recording features that help anamorphic optics shine. However, it can be ch…<br><a href=\"https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-free-calculator-figures-out-your-anamorphic-aspect-ratios/",
    "topic": "photo",
    "date": "2025-11-28T18:22:43.000Z"
  },
  {
    "title": "The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now",
    "q": "the 10 best deals on full-frame mirrorless cameras right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The 10 Best Deals on Full-Frame Mirrorless Cameras Right Now</b><br>We already have a deep-dive article about all the best deals on cameras for Black Friday and Cyber Monday, but some of the deals are so good that they warrant a bit more attention. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-10-best-deals-on-full-frame-mirrorless-cameras-right-now/",
    "topic": "photo",
    "date": "2025-11-28T17:31:02.000Z"
  },
  {
    "title": "Do you need to learn Manual mode right away?",
    "q": "do you need to learn manual mode right away? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do you need to learn Manual mode right away?</b><br>Photo: Abby Ferguson If you're a beginner photographer who spends any time on the internet, chances are you've been bombarded with content saying that you need to learn Manual mode immediately. It's a frequent refrain that \"real\" photograp…<br><a href=\"https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": "2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation",
    "q": "2025 royal photographic society awards reveal groundbreaking winners in art, science and innovation camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>2025 Royal Photographic Society awards reveal groundbreaking winners in art, science and innovation</b><br>Photos from left to right: Omar Victor Diop, Susan Derges HonFRPS and Jaskirt Dhaliwal-Boora The Royal Photographic Society has announced the recipients of its 2025 Awards. The contest highlights significant contributions across both the a…<br><a href=\"https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1899671180/2025-royal-photographic-society-awards-reveal-groundbreaking-winners-in-art-science-and-innovation",
    "topic": "photo",
    "date": "2025-11-24T15:55:00.000Z"
  },
  {
    "title": " This is \"probably the best 70-200mm zoom in the world\" –and now you can save over £900 on it ",
    "q": " this is \"probably the best 70-200mm zoom in the world\" –and now you can save over £900 on it  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This is \"probably the best 70-200mm zoom in the world\" –and now you can save over £900 on it </b><br>The Nikon Z 70-200mm f/2.8 VR S is a top-tier telephoto, known for its steep price tag, but with this deal, you get it for just under £1,700<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/this-is-probably-the-best-70-200mm-zoom-in-the-world-and-now-you-can-save-over-gbp900-on-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/this-is-probably-the-best-70-200mm-zoom-in-the-world-and-now-you-can-save-over-gbp900-on-it",
    "topic": "photo",
    "date": "2025-11-29T16:20:00.000Z"
  },
  {
    "title": " These Canon camera settings are my secret sauce for nailing great photos of weddings ",
    "q": " these canon camera settings are my secret sauce for nailing great photos of weddings  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> These Canon camera settings are my secret sauce for nailing great photos of weddings </b><br>Modern mirrorless features make it easier than ever to take top shots of happy couples tying the knot<br><a href=\"https://www.digitalcameraworld.com/photography/wedding-photography/these-canon-camera-settings-are-my-secret-sauce-for-nailing-great-photos-of-weddings\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/wedding-photography/these-canon-camera-settings-are-my-secret-sauce-for-nailing-great-photos-of-weddings",
    "topic": "photo",
    "date": "2025-11-29T15:08:00.000Z"
  },
  {
    "title": " \"Photography has the power to protect remote cultures… and I'm on a mission to use it!\" – Why this photographer captures portraits, and the gear he trusts ",
    "q": " \"photography has the power to protect remote cultures… and i'm on a mission to use it!\" – why this photographer captures portraits, and the gear he trusts  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> \"Photography has the power to protect remote cultures… and I'm on a mission to use it!\" – Why this photographer captures portraits, and the gear he trusts </b><br>Tribal traditions are under threat from globalization, and Terrence Mendoza has sworn to record them before they disappear, working with two full-frame cameras, wide-angle and zoom lenses<br><a href=\"https://www.digitalcameraworld.com/photography/travel-photography/photography-has-the-power-to-protect-remote-cultures-and-im-on-a-mission-to-use-it-why-this-photographer-captures-portraits-and-the-gear-he-trusts\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/travel-photography/photography-has-the-power-to-protect-remote-cultures-and-im-on-a-mission-to-use-it-why-this-photographer-captures-portraits-and-the-gear-he-trusts",
    "topic": "photo",
    "date": "2025-11-29T13:26:00.000Z"
  },
  {
    "title": " Sony A7 III camera is now just £899! ",
    "q": " sony a7 iii camera is now just £899!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Sony A7 III camera is now just £899! </b><br>Want a full-frame Sony camera for under a grand? The Sony A7 III, now available for £899 at Wex - beating the price we saw in the Prime sale<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/our-long-time-favorite-sony-a7-iii-camera-is-now-at-lowest-price-ever\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/our-long-time-favorite-sony-a7-iii-camera-is-now-at-lowest-price-ever",
    "topic": "photo",
    "date": "2025-11-29T12:51:22.000Z"
  },
  {
    "title": " Trendy cameras rarely go on sale. But the DJI Osmo Pocket 3 is the definition of trendy, and it just dropped by $270 ",
    "q": " trendy cameras rarely go on sale. but the dji osmo pocket 3 is the definition of trendy, and it just dropped by $270  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Trendy cameras rarely go on sale. But the DJI Osmo Pocket 3 is the definition of trendy, and it just dropped by $270 </b><br>The DJI Osmo Pocket 3 is at its lowest price in months, with a $270 discount on the popular video camera for Black Friday<br><a href=\"https://www.digitalcameraworld.com/cameras/video-cameras/trendy-cameras-rarely-go-on-sale-but-the-dji-osmo-pocket-3-is-the-definition-of-trendy-and-it-just-dropped-by-usd270\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/video-cameras/trendy-cameras-rarely-go-on-sale-but-the-dji-osmo-pocket-3-is-the-definition-of-trendy-and-it-just-dropped-by-usd270",
    "topic": "photo",
    "date": "2025-11-29T11:10:25.000Z"
  },
  {
    "title": " Save 40% on Photography & Video Show tickets – for Black Friday weekend only! ",
    "q": " save 40% on photography & video show tickets – for black friday weekend only!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Save 40% on Photography & Video Show tickets – for Black Friday weekend only! </b><br>The UK's biggest and best show on all things photography and videography is just around the corner – and you can save a packet on the entry price with this deal<br><a href=\"https://www.digitalcameraworld.com/photography/trade-shows/save-40-percent-on-photography-and-video-show-tickets-for-black-friday-weekend-only\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/trade-shows/save-40-percent-on-photography-and-video-show-tickets-for-black-friday-weekend-only",
    "topic": "photo",
    "date": "2025-11-29T10:30:00.000Z"
  },
  {
    "title": " Street Photography: A History in 100 Iconic Photographs by David Gibson review  ",
    "q": " street photography: a history in 100 iconic photographs by david gibson review   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Street Photography: A History in 100 Iconic Photographs by David Gibson review  </b><br>An inspiring overview of the evolution of street photography, David Gibson’s book is both a visual history and a practical prompt for photographers looking to deepen their craft.<br><a href=\"https://www.digitalcameraworld.com/photography/books/street-photography-a-history-in-100-iconic-photographs-by-david-gibson-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/books/street-photography-a-history-in-100-iconic-photographs-by-david-gibson-review",
    "topic": "photo",
    "date": "2025-11-29T10:00:00.000Z"
  },
  {
    "title": " I hate traveling with heavy camera gear. This is my favorite compact camera for travel (and it is now at lowest price ever) ",
    "q": " i hate traveling with heavy camera gear. this is my favorite compact camera for travel (and it is now at lowest price ever)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I hate traveling with heavy camera gear. This is my favorite compact camera for travel (and it is now at lowest price ever) </b><br>The OM System Tough TG-7 is my go-to compact for travel – if I didn't already have it, I'd be snapping up this deal<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/i-hate-traveling-with-heavy-camera-gear-this-is-my-favorite-compact-camera-for-travel-and-it-is-now-at-lowest-price-ever\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/i-hate-traveling-with-heavy-camera-gear-this-is-my-favorite-compact-camera-for-travel-and-it-is-now-at-lowest-price-ever",
    "topic": "photo",
    "date": "2025-11-29T09:18:06.000Z"
  },
  {
    "title": " Using Canon's 800mm f/11 supertele lens is out of this world…but I've found limitations that bring me back to Earth ",
    "q": " using canon's 800mm f/11 supertele lens is out of this world…but i've found limitations that bring me back to earth  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Using Canon's 800mm f/11 supertele lens is out of this world…but I've found limitations that bring me back to Earth </b><br>Canon’s RF 800mm f/11 mega-telephoto lens is a unique proposition – but as I discovered, it’s not without limitations<br><a href=\"https://www.digitalcameraworld.com/features/using-canons-800mm-f11-supertele-lens-is-out-of-this-world-but-ive-found-limitations-that-bring-me-back-to-earth\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/features/using-canons-800mm-f11-supertele-lens-is-out-of-this-world-but-ive-found-limitations-that-bring-me-back-to-earth",
    "topic": "photo",
    "date": "2025-11-29T07:18:00.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Best Memory Cards for Photographers",
    "q": "best memory cards for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Cards for Photographers</b><br>People tend to focus more on cameras and lenses when discussing camera gear. Those are exciting, fun purchases! However, once a new photographer find themselves out taking photos, the next piece of gear takes center stage, and becomes infi…<br><a href=\"https://www.slrlounge.com/best-memory-cards-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-cards-for-photographers/",
    "topic": "photo",
    "date": "2025-11-26T23:41:26.000Z"
  },
  {
    "title": "TourBox Elite Plus Review | A Versatile New Creative Controller",
    "q": "tourbox elite plus review | a versatile new creative controller camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>TourBox Elite Plus Review | A Versatile New Creative Controller</b><br>Over the last few years, we’ve seen an explosion of various innovations that streamline creative workflows. From photographers and illustrators to video editors and animators, everyone is looking for this combination: speed and precision. …<br><a href=\"https://www.slrlounge.com/tourbox-elite-plus-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tourbox-elite-plus-review/",
    "topic": "photo",
    "date": "2025-11-26T16:00:00.000Z"
  },
  {
    "title": "DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools",
    "q": "dxo’s black friday deals take up to 50% off flagship photo editing tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools</b><br>DxO is rolling out its annual Black Friday sale with significant discounts across its full software lineup, offering up to 50% off both new licenses and upgrades. The promotion runs from November 18 through December 2, 2025. The sale spans…<br><a href=\"https://www.slrlounge.com/dxo-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-26T13:00:26.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "The Super Mario Galaxy bundle for the Switch is still 20 percent off",
    "q": "the super mario galaxy bundle for the switch is still 20 percent off windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Super Mario Galaxy bundle for the Switch is still 20 percent off</b><br>Nintendo launched its $69.99 Super Mario Galaxy double pack for the Switch (complete with a free Switch 2 update) in October, but you can get the cartridge containing both games for $54.99 ($15 off) — the lowest price yet — at Woot. To see…<br><a href=\"https://www.theverge.com/gadgets/832513/black-friday-super-mario-galaxy-bundle-switch-deal-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/832513/black-friday-super-mario-galaxy-bundle-switch-deal-sale-2025",
    "topic": "it",
    "date": "2025-11-29T18:11:04.000Z"
  },
  {
    "title": "These are my picks for the best Black Friday deals on Garmin watches",
    "q": "these are my picks for the best black friday deals on garmin watches windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These are my picks for the best Black Friday deals on Garmin watches</b><br>The Epix Pro is 50 percent off! Every deals holiday, I break my brain and eyeballs scrolling through endless lists of smartwatch models so you don’t have to. Garmin has a ton of deals for Black Friday and Cyber Monday, but there are only a…<br><a href=\"https://www.theverge.com/gadgets/833297/best-garmin-watch-black-friday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833297/best-garmin-watch-black-friday-deal-sale",
    "topic": "it",
    "date": "2025-11-29T18:00:00.000Z"
  },
  {
    "title": "Black Friday deals are still going strong on Apple AirTags, iPads, and more",
    "q": "black friday deals are still going strong on apple airtags, ipads, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Black Friday deals are still going strong on Apple AirTags, iPads, and more</b><br>The Apple Watch Series 11 is only a few months old, but it’s already $60 off. If you’re planning to gift an Apple device this holiday season — or treat yourself — now’s the time to start shopping. Black Friday may be over, but the discount…<br><a href=\"https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025",
    "topic": "it",
    "date": "2025-11-29T17:56:58.000Z"
  },
  {
    "title": "The 195 Black Friday deals you can still get",
    "q": "the 195 black friday deals you can still get windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The 195 Black Friday deals you can still get</b><br>Black Friday is technically a thing of the past, but many of the best deals we told you about yesterday — including deep discounts on the AirPods Pro 3, the Pixel Watch 4, and the latest Kindle Paperwhite — are still kicking for now. In so…<br><a href=\"https://www.theverge.com/gadgets/832641/black-friday-2025-best-deals-tech-gadgets-still-available\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/832641/black-friday-2025-best-deals-tech-gadgets-still-available",
    "topic": "it",
    "date": "2025-11-29T17:08:02.000Z"
  },
  {
    "title": "One of the world’s fastest power banks got a Black Friday discount",
    "q": "one of the world’s fastest power banks got a black friday discount windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>One of the world’s fastest power banks got a Black Friday discount</b><br>The Rapid Power Pro power bank is currently $149 ($30 off). The Desktop Charger that lets its recharging speeds soar to 320W isn’t discounted, though. | Image: Thomas Ricker / The Verge Ecoflow’s Rapid Pro power bank is one of the most pow…<br><a href=\"https://www.theverge.com/gadgets/833299/ecoflow-rapid-pro-power-bank-black-friday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833299/ecoflow-rapid-pro-power-bank-black-friday-deal-sale",
    "topic": "it",
    "date": "2025-11-29T17:00:00.000Z"
  },
  {
    "title": "Logitech’s Casa is a must-have if you use a laptop — and it’s $30 off",
    "q": "logitech’s casa is a must-have if you use a laptop — and it’s $30 off windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Logitech’s Casa is a must-have if you use a laptop — and it’s $30 off</b><br>If you’re someone who’s constantly on the move, yet you want the tools to help you feel comfortable anywhere you post up to do work, I have a recommendation: Logitech’s Casa. It’s a compact (and sleek) kit of accessories that can give you …<br><a href=\"https://www.theverge.com/gadgets/833260/logitech-casa-laptop-accessories-black-friday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833260/logitech-casa-laptop-accessories-black-friday-deal-sale",
    "topic": "it",
    "date": "2025-11-29T15:30:00.000Z"
  },
  {
    "title": "What&#8217;s on your desk, Sarah Smithers?",
    "q": "what&#8217;s on your desk, sarah smithers? windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>What&#8217;s on your desk, Sarah Smithers?</b><br>This custom-built desk is only part of a fascinating (if crowded) office space. As senior editorial coordinator, Sarah Smithers wears a lot of hats here at The Verge. “The simplest way to put it,” she says, “is that I handle our operations…<br><a href=\"https://www.theverge.com/gadgets/826412/desk-apple-dog-plants\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/826412/desk-apple-dog-plants",
    "topic": "it",
    "date": "2025-11-29T15:00:00.000Z"
  },
  {
    "title": "Skylight’s smart calendars are up to $120 off for Black Friday",
    "q": "skylight’s smart calendars are up to $120 off for black friday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Skylight’s smart calendars are up to $120 off for Black Friday</b><br>Skylight’s 27-inch Calendar Max is on sale for $499.99. Keeping track of multiple people’s schedules is tough, especially if the folks you live with have different calendars for work, school, personal appointments, and extracurriculars. Sk…<br><a href=\"https://www.theverge.com/gadgets/831893/skylight-calendar-black-friday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/831893/skylight-calendar-black-friday-deal-sale",
    "topic": "it",
    "date": "2025-11-29T14:41:49.000Z"
  },
  {
    "title": " Sorry, ChatGPT and Gemini can't improve on my mom's handwritten Apple Pie recipe ",
    "q": " sorry, chatgpt and gemini can't improve on my mom's handwritten apple pie recipe  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Sorry, ChatGPT and Gemini can't improve on my mom's handwritten Apple Pie recipe </b><br>A handwritten recipe turns out to be better than anything the most popular AI can produce.<br><a href=\"https://www.techradar.com/ai-platforms-assistants/sorry-chatgpt-and-gemini-cant-improve-on-my-moms-handwritten-apple-pie-recipe\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/ai-platforms-assistants/sorry-chatgpt-and-gemini-cant-improve-on-my-moms-handwritten-apple-pie-recipe",
    "topic": "it",
    "date": "2025-11-29T16:00:00.000Z"
  },
  {
    "title": "I'm a Digital Nomad and These Are the 6 VPN Rules I Swear By",
    "q": "i'm a digital nomad and these are the 6 vpn rules i swear by windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I'm a Digital Nomad and These Are the 6 VPN Rules I Swear By</b><br>Two cybersecurity professionals shared their top six tips for frequent travelers or digital nomads, like me, to safely protect client data and personal privacy while working as a digital nomad.<br><a href=\"https://www.cnet.com/tech/services-and-software/im-a-digital-nomad-and-these-are-the-6-vpn-rules-i-swear-by/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/im-a-digital-nomad-and-these-are-the-6-vpn-rules-i-swear-by/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-29T16:33:30.000Z"
  },
  {
    "title": " Data corruption hobbles Airbus fleet, firm orders immediate software fix for 6,000 planes due to data corruption from intense sun radiation ",
    "q": " data corruption hobbles airbus fleet, firm orders immediate software fix for 6,000 planes due to data corruption from intense sun radiation  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Data corruption hobbles Airbus fleet, firm orders immediate software fix for 6,000 planes due to data corruption from intense sun radiation </b><br>Airbus has instructed airlines worldwide to implement an urgent software update on roughly 6,000 A320-family aircraft after investigators traced an October in-flight incident to corrupted flight-control data.<br><a href=\"https://www.tomshardware.com/tech-industry/airbus-orders-immediate-software-fix-for-6000-a320-jets\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/airbus-orders-immediate-software-fix-for-6000-a320-jets",
    "topic": "it",
    "date": "2025-11-29T14:18:36.000Z"
  },
  {
    "title": " Microsoft and Crocs release limited-edition Xbox-themed footwear for $80 — black Classic Clogs with Xbox-style controller charms ",
    "q": " microsoft and crocs release limited-edition xbox-themed footwear for $80 — black classic clogs with xbox-style controller charms  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft and Crocs release limited-edition Xbox-themed footwear for $80 — black Classic Clogs with Xbox-style controller charms </b><br>Nothing screams \"I'm a gamer!\" more than these Xbox Classic Clogs.<br><a href=\"https://www.tomshardware.com/video-games/xbox/microsoft-and-crocs-release-limited-edition-xbox-themed-footwear-for-usd80-black-classic-clogs-with-xbox-style-controller-charms\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/video-games/xbox/microsoft-and-crocs-release-limited-edition-xbox-themed-footwear-for-usd80-black-classic-clogs-with-xbox-style-controller-charms",
    "topic": "it",
    "date": "2025-11-29T13:39:11.000Z"
  },
  {
    "title": "I found the best Black Friday iPad deals you can still shop: Apple discounts up to 25% tracked live",
    "q": "i found the best black friday ipad deals you can still shop: apple discounts up to 25% tracked live windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Black Friday iPad deals you can still shop: Apple discounts up to 25% tracked live</b><br>Don't miss a chance to score still-live Black Friday iPad deals in real time, so you can find the best price on an iPad, iPad Air, iPad Pro, and more.<br><a href=\"https://www.zdnet.com/article/black-friday-ipad-deals-amazon-walmart-best-buy-11-29/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-ipad-deals-amazon-walmart-best-buy-11-29/",
    "topic": "it",
    "date": "2025-11-29T18:18:00.000Z"
  },
  {
    "title": "We found the 100+ best Black Friday deals up to 75% off from Amazon, Walmart, & more still live",
    "q": "we found the 100+ best black friday deals up to 75% off from amazon, walmart, & more still live windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>We found the 100+ best Black Friday deals up to 75% off from Amazon, Walmart, & more still live</b><br>Black Friday is over, but Cyber Monday is on the way, and nearly every major retailer is still offering big discounts on items from LG, Apple, Garmin, Samsung, and more.<br><a href=\"https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-29/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-deals-2025-amazon-best-buy-hulu-11-29/",
    "topic": "it",
    "date": "2025-11-29T18:17:00.000Z"
  },
  {
    "title": "I found the best Apple Watch deals still live for Black Friday 2025",
    "q": "i found the best apple watch deals still live for black friday 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I found the best Apple Watch deals still live for Black Friday 2025</b><br>Shop these exceptional Black Friday deals on Apple Watches, including the new Series 11 and SE 3, before they're gone.<br><a href=\"https://www.zdnet.com/article/black-friday-apple-watch-deals-amazon-best-buy-walmart-11-29/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/black-friday-apple-watch-deals-amazon-best-buy-walmart-11-29/",
    "topic": "it",
    "date": "2025-11-29T17:43:57.000Z"
  },
  {
    "title": " Add Windows Hello face unlock to your Windows 11 PC for just $46 this Black Friday and Cyber Monday — eradicate your password with a webcam once and for all ",
    "q": " add windows hello face unlock to your windows 11 pc for just $46 this black friday and cyber monday — eradicate your password with a webcam once and for all  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Add Windows Hello face unlock to your Windows 11 PC for just $46 this Black Friday and Cyber Monday — eradicate your password with a webcam once and for all </b><br>Upgrade your Windows 11 PC with this Lenovo Performance FHD Webcam for Black Friday, which supports Windows Hello face unlock and 1080p video recording for just $45.99.<br><a href=\"https://www.windowscentral.com/accessories/cameras/lenovo-performance-fhd-webcam-black-friday-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/accessories/cameras/lenovo-performance-fhd-webcam-black-friday-2025",
    "topic": "it",
    "date": "2025-11-29T15:44:53.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "Public GitLab repositories exposed more than 17,000 secrets",
    "q": "public gitlab repositories exposed more than 17,000 secrets windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Public GitLab repositories exposed more than 17,000 secrets</b><br>After scanning all 5.6 million public repositories on GitLab Cloud, a security engineer discovered more than 17,000 exposed secrets across over 2,800 unique domains. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/",
    "topic": "it",
    "date": "2025-11-28T17:43:02.000Z"
  },
  {
    "title": "3 unique RSS reader apps for Windows to try this weekend",
    "q": "3 unique rss reader apps for windows to try this weekend windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>3 unique RSS reader apps for Windows to try this weekend</b><br>You're not at the mercy of the algorithm for your news.<br><a href=\"https://www.howtogeek.com/unique-rss-reader-apps-for-windows/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/unique-rss-reader-apps-for-windows/",
    "topic": "it",
    "date": "2025-11-29T17:00:14.000Z"
  },
  {
    "title": "5 Linux apps you should install on day one",
    "q": "5 linux apps you should install on day one windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>5 Linux apps you should install on day one</b><br>Installing Linux is only half the job—you've got to set it up to accommodate your workflow as well.<br><a href=\"https://www.howtogeek.com/apps-you-should-install-on-day-one-of-installing-linux/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/apps-you-should-install-on-day-one-of-installing-linux/",
    "topic": "it",
    "date": "2025-11-29T16:15:14.000Z"
  },
  {
    "title": "I replaced my Linux Xfce menu with this and never looked back",
    "q": "i replaced my linux xfce menu with this and never looked back windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I replaced my Linux Xfce menu with this and never looked back</b><br>I grew weary of Xfce's menu bar's constraints, and this lightweight, customizable drop-in proved the perfect answer to that frustration.<br><a href=\"https://www.xda-developers.com/replaced-linux-xfce-menu-never-looked-back/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/replaced-linux-xfce-menu-never-looked-back/",
    "topic": "it",
    "date": "2025-11-29T17:30:17.000Z"
  },
  {
    "title": "This free program is all I need to make my Windows desktop perfect",
    "q": "this free program is all i need to make my windows desktop perfect windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This free program is all I need to make my Windows desktop perfect</b><br>Bid adieu to cluttered widget boards and hello to customizable desktop bliss with this must-have app for Windows users.<br><a href=\"https://www.xda-developers.com/widget-launcher-makes-my-windows-desktop-perfect/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/widget-launcher-makes-my-windows-desktop-perfect/",
    "topic": "it",
    "date": "2025-11-29T17:00:17.000Z"
  },
  {
    "title": "I used a modern-day 250MB Linux OS, and it was a real struggle",
    "q": "i used a modern-day 250mb linux os, and it was a real struggle windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I used a modern-day 250MB Linux OS, and it was a real struggle</b><br>This no-bloat life isn't for me.<br><a href=\"https://www.xda-developers.com/i-used-modern-day-250mb-linux-os-real-struggle/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/i-used-modern-day-250mb-linux-os-real-struggle/",
    "topic": "it",
    "date": "2025-11-29T16:45:17.000Z"
  },
  {
    "title": "4 Windows taskbar mods I wish were native OS features",
    "q": "4 windows taskbar mods i wish were native os features windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>4 Windows taskbar mods I wish were native OS features</b><br>A whole lot of nostalgia<br><a href=\"https://www.xda-developers.com/windows-taskbar-mods-native-features/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/windows-taskbar-mods-native-features/",
    "topic": "it",
    "date": "2025-11-29T16:31:17.000Z"
  }
]