[
  {
    "title": "Greeting",
    "q": "hi hello hey good morning good evening whats up how are you greetings",
    "a": "Hey there 👋 I'm H3samBot — your Photo & Tech assistant! I can help you with photography tips, camera settings, lighting setups, or IT and Windows fixes. What do you want to learn today?"
  },
  {
    "title": "Fast action / sports shutter",
    "q": "best shutter for sports freeze motion football basketball",
    "a": "Use 1/1000s as a safe starting point (1/2000s for very fast plays). Shoot in Shutter Priority mode, enable Auto ISO, and set continuous AF (AI-Servo or AF-C)."
  },
  {
    "title": "Portrait lighting basics",
    "q": "portrait lighting soft light window reflector 45 degrees rembrandt",
    "a": "Place a soft light 45° to your subject and slightly above eye level. Use a reflector to fill shadows. For portraits, try f/2–f/4 around 1/125s and raise ISO before lowering shutter speed."
  },
  {
    "title": "Golden hour tip",
    "q": "golden hour best time outdoor photos color temperature warm",
    "a": "Golden hour is the first hour after sunrise and the last hour before sunset. Set white balance around 5200–6000K for natural tones, or lower for warmer colors."
  },
  {
    "title": "Windows high CPU",
    "q": "windows high cpu usage fix task manager background apps startup",
    "a": "Press Ctrl+Shift+Esc → sort by CPU to find the culprit. Disable heavy startup apps under Settings → Apps → Startup. Update drivers, scan for malware, and use the Balanced power plan."
  },
  {
    "title": "Linux disk space",
    "q": "linux check disk usage which folders big du df clean apt",
    "a": "Run: <code>sudo du -h --max-depth=1 / | sort -hr | head</code>. For an overview: <code>df -h</code>. Clean caches: <code>sudo apt autoremove && sudo apt clean</code>."
  },
  {
    "title": "Exposure triangle",
    "q": "aperture shutter iso triangle explain exposure settings photography basics",
    "a": "Aperture controls depth of field, shutter speed freezes or blurs motion, and ISO affects brightness and noise. For sharp low-light portraits: f/2–f/2.8, 1/125s, Auto ISO."
  },
  {
    "title": "Camera settings for portraits",
    "q": "best camera settings for portraits portrait photos blurry background aperture for portraits",
    "a": "Use a wide aperture (f/1.8–f/2.8) for nice background blur, low ISO for sharpness, and soft natural light. Keep shutter speed around 1/125s to avoid motion blur."
  },
  {
    "title": "Difference between SSD and HDD",
    "q": "ssd vs hdd difference between ssd and hdd faster storage drive",
    "a": "SSDs are much faster and more reliable than HDDs since they use flash memory (no moving parts). HDDs are cheaper but slower, louder, and less durable."
  },
  {
    "title": "Lighting tips for indoor photography",
    "q": "indoor lighting tips photo lighting how to take good photos inside",
    "a": "Use soft, diffused light — bounce your flash off the ceiling or use a ring light or softbox. Avoid harsh direct light to reduce shadows and reflections."
  },
  {
    "title": "Fix Wi-Fi not working on PC",
    "q": "wifi not working windows fix wifi connection laptop no internet network issue",
    "a": "Restart the adapter: open Command Prompt and run <code>netsh winsock reset</code>, then reboot. Also ensure Airplane Mode is off and drivers are up to date."
  },
  {
    "title": "Studio lighting setup",
    "q": "studio lighting setup softbox key light fill light background light photography",
    "a": "Use a 3-point setup: Key light (main light at 45°), Fill light (softer on the opposite side), and Back/Background light for separation. Adjust intensity for contrast."
  },
  {
    "title": "Windows screenshot shortcut",
    "q": "how to take screenshot windows snip shortcut print screen capture",
    "a": "Press Windows+Shift+S to open Snip & Sketch. Drag to select the area, and it copies instantly. Paste it into Paint, Word, or anywhere you need."
  },
  {
    "title": "Check your Windows version",
    "q": "windows version check command system info os version details",
    "a": "Open Command Prompt and type <code>systeminfo | findstr /B /C:\"OS Name\" /C:\"OS Version\"</code>. It shows your exact build and edition."
  },
  {
    "title": "Best lens for portraits",
    "q": "best lens for portraits photography 50mm 85mm shallow depth",
    "a": "A 50mm f/1.8 or 85mm f/1.8 lens is ideal for portraits — both produce natural perspective and strong background separation. Use wide apertures for smooth bokeh."
  },
  {
    "title": "Focus modes explained",
    "q": "camera focus mode af c af s ai servo manual focus photography settings",
    "a": "AF-S (Single) locks focus once — great for still subjects. AF-C (Continuous) tracks movement — perfect for action. Manual focus gives full control for static setups."
  }
]
