[
  {
    "title": "Canon Faces Lawsuit Over Wi-Fi in Cameras and Printers",
    "q": "canon faces lawsuit over wi-fi in cameras and printers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon Faces Lawsuit Over Wi-Fi in Cameras and Printers</b><br>Canon Inc. and its U.S. subsidiary, Canon USA, are facing a new patent infringement lawsuit filed by Irish company Malikie Innovations Ltd. The suit alleges that Canon’s cameras, printers, and companion mobile app use Wi-Fi technology cove…<br><a href=\"https://petapixel.com/2025/11/18/canon-faces-lawsuit-over-wi-fi-in-cameras-and-printers/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/canon-faces-lawsuit-over-wi-fi-in-cameras-and-printers/",
    "topic": "photo",
    "date": "2025-11-18T23:22:18.000Z"
  },
  {
    "title": "Chris Niccolls and Jordan Drake Return to The Camera Store (For One Day)",
    "q": "chris niccolls and jordan drake return to the camera store (for one day) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Chris Niccolls and Jordan Drake Return to The Camera Store (For One Day)</b><br>Chris Niccolls and Jordan Drake are returning to The Camera Store (TCS), where their career started! For one day only and in celebration of reaching 250,000 subscribers, the duo are heading back behind the counter to reprise their old role…<br><a href=\"https://petapixel.com/2025/11/18/chris-niccolls-and-jordan-drake-return-to-the-camera-store-for-one-day/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/chris-niccolls-and-jordan-drake-return-to-the-camera-store-for-one-day/",
    "topic": "photo",
    "date": "2025-11-18T22:56:08.000Z"
  },
  {
    "title": "Zeniko Launches $50 Universal Dual Dial Retro Mini Flash",
    "q": "zeniko launches $50 universal dual dial retro mini flash camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Zeniko Launches $50 Universal Dual Dial Retro Mini Flash</b><br>Zeniko has introduced the ZA12 Dual Dial Retro Mini Flash, a compact lighting solution designed for photographers seeking portable illumination. According to Zeniko, the flash delivers even, powerful light using the company’s optical techn…<br><a href=\"https://petapixel.com/2025/11/18/zeniko-launches-50-universal-dual-dial-retro-mini-flash/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/zeniko-launches-50-universal-dual-dial-retro-mini-flash/",
    "topic": "photo",
    "date": "2025-11-18T21:04:58.000Z"
  },
  {
    "title": "Celebrities Are Changing How Pro Sports Photographers Work",
    "q": "celebrities are changing how pro sports photographers work camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Celebrities Are Changing How Pro Sports Photographers Work</b><br>Photographer Tammy Ljungblad has worked at The Kansas City Star for 36 years. She has never seen anything like the impact of megastar Taylor Swift on NFL games at Arrowhead Stadium and the broader Kansas City community. [Read More]<br><a href=\"https://petapixel.com/2025/11/18/celebrities-are-changing-how-pro-sports-photographers-work/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/celebrities-are-changing-how-pro-sports-photographers-work/",
    "topic": "photo",
    "date": "2025-11-18T19:45:36.000Z"
  },
  {
    "title": "Fujifilm’s New F-Log2 and F-Log2C Film Simulation LUTs Look Fantastic",
    "q": "fujifilm’s new f-log2 and f-log2c film simulation luts look fantastic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm’s New F-Log2 and F-Log2C Film Simulation LUTs Look Fantastic</b><br>With surprising lack of fanfare, Fujifilm has released its promised GFX Eterna 55 Look-Up Tables (LUTs) based on 10 different Film Simulations. These 3D LUTs work with F-Log2 and F-Log2C, meaning that filmmakers using any recent Fujifilm c…<br><a href=\"https://petapixel.com/2025/11/18/fujifilms-new-f-log2-and-f-log2c-film-simulation-luts-look-fantastic/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/fujifilms-new-f-log2-and-f-log2c-film-simulation-luts-look-fantastic/",
    "topic": "photo",
    "date": "2025-11-18T19:09:33.000Z"
  },
  {
    "title": "OnePlus 15 Review: Camera Conundrum",
    "q": "oneplus 15 review: camera conundrum camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>OnePlus 15 Review: Camera Conundrum</b><br>As a Chinese brand, OnePlus skips the number 14 for cultural reasons, though after using the OnePlus 15 and its camera, I’m more likely to suggest the previous model was the lucky one. As a phone, the device is very impressive thanks to it…<br><a href=\"https://petapixel.com/2025/11/18/oneplus-15-review-camera-conundrum/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/oneplus-15-review-camera-conundrum/",
    "topic": "photo",
    "date": "2025-11-18T17:39:38.000Z"
  },
  {
    "title": "Top 10 ProMaster Gifts Under $100",
    "q": "top 10 promaster gifts under $100 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Top 10 ProMaster Gifts Under $100</b><br>From stocking stuffers to picture perfect presents, ProMaster is making gift giving easy this holiday season! This list of 10 ProMaster products under $100 has something for everyone on your list, from beginner photographers and content cr…<br><a href=\"https://petapixel.com/2025/11/18/top-10-promaster-gifts-under-100/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/top-10-promaster-gifts-under-100/",
    "topic": "photo",
    "date": "2025-11-18T16:51:24.000Z"
  },
  {
    "title": "Judge Orders US Agency to Stop Blurring and Hiding Public Photos of Bycatch in Fisheries",
    "q": "judge orders us agency to stop blurring and hiding public photos of bycatch in fisheries camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Judge Orders US Agency to Stop Blurring and Hiding Public Photos of Bycatch in Fisheries</b><br>A judge has ordered a U.S. government agency to stop blurring, pixelating, and blacking out public photos of animals accidentally caught while fishing for other species. [Read More]<br><a href=\"https://petapixel.com/2025/11/18/judge-orders-us-agency-to-stop-blurring-and-hiding-public-photos-of-bycatch-in-fisheries/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/18/judge-orders-us-agency-to-stop-blurring-and-hiding-public-photos-of-bycatch-in-fisheries/",
    "topic": "photo",
    "date": "2025-11-18T16:24:19.000Z"
  },
  {
    "title": "Deep-sea sharks and nuclear breakthroughs: see National Geographic's 2025 pictures of the year",
    "q": "deep-sea sharks and nuclear breakthroughs: see national geographic's 2025 pictures of the year camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Deep-sea sharks and nuclear breakthroughs: see National Geographic's 2025 pictures of the year</b><br>National Geographic Pictures of the Year 2025 National Geographic has revealed the Pictures of the Year 2025, highlighting images by Nat Geo photographers that inspired and defined the past year. This year's showcase features 25 images tha…<br><a href=\"https://www.dpreview.com/articles/3871724524/national-geographic-2025-pictures-of-the-year\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3871724524/national-geographic-2025-pictures-of-the-year",
    "topic": "photo",
    "date": "2025-11-18T18:36:00.000Z"
  },
  {
    "title": "Canon EOS R6 III vs EOS R6 II: is it worth $500 more?",
    "q": "canon eos r6 iii vs eos r6 ii: is it worth $500 more? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III vs EOS R6 II: is it worth $500 more?</b><br>When you use DPReview links to buy products, the site may earn a commission. Canon announced the EOS R6 III, its latest-generation enthusiast full frame camera, earlier this month, but to some, the news of what the company was doing with t…<br><a href=\"https://www.dpreview.com/articles/4416527199/canon-eos-r6-iii-vs-ii-500-dollar-difference-generation\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4416527199/canon-eos-r6-iii-vs-ii-500-dollar-difference-generation",
    "topic": "photo",
    "date": "2025-11-18T14:00:00.000Z"
  },
  {
    "title": "Aperture moves: DJI's Osmo Action 6 opens up more creative flexibility",
    "q": "aperture moves: dji's osmo action 6 opens up more creative flexibility camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aperture moves: DJI's Osmo Action 6 opens up more creative flexibility</b><br>Image: DJI Hot on the heels of launching an entry-level drone and smartphone gimbal, DJI has announced yet another new product: the Osmo Action 6. The company's latest action camera promises to up the ante with a larger, custom-designed sq…<br><a href=\"https://www.dpreview.com/news/0154530156/dji-osmo-action-6-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/0154530156/dji-osmo-action-6-announcement",
    "topic": "photo",
    "date": "2025-11-18T12:00:00.000Z"
  },
  {
    "title": "Fujifilm just made its most famous film simulations more flexible for video",
    "q": "fujifilm just made its most famous film simulations more flexible for video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fujifilm just made its most famous film simulations more flexible for video</b><br>Owners of cameras like the X-H2S will be getting a more flexible way to use the company's famed Film Simulations. Fujifilm has made several of its well-regarded Film Simulation color modes available as standardized LUT (Look Up Table) file…<br><a href=\"https://www.dpreview.com/news/1984031538/fujifilm-film-simulations-luts-eterna-55\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/1984031538/fujifilm-film-simulations-luts-eterna-55",
    "topic": "photo",
    "date": "2025-11-18T04:47:00.000Z"
  },
  {
    "title": "Canon EOS R6 III vs EOS R5 II: how much of a difference is there?",
    "q": "canon eos r6 iii vs eos r5 ii: how much of a difference is there? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III vs EOS R5 II: how much of a difference is there?</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III's specs have prompted some people to wonder if its more expensive sibling is worth the extra. Photo: Mitchell Clark The Canon EOS R6 III take…<br><a href=\"https://www.dpreview.com/articles/4301209158/canon-eos-r6-iii-vs-canon-eos-r5-ii-comparison\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/4301209158/canon-eos-r6-iii-vs-canon-eos-r5-ii-comparison",
    "topic": "photo",
    "date": "2025-11-17T15:00:00.000Z"
  },
  {
    "title": "Our compact camera photo challenge is now open for submissions!",
    "q": "our compact camera photo challenge is now open for submissions! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Our compact camera photo challenge is now open for submissions!</b><br>I captured this photo of a trio of metal sunflower sculptures while testing the Canon Powershot G9 X II back in 2017. I enjoyed the way these man-made objects blended into the natural environment. Photo: Dale Baskin Our November Editors' p…<br><a href=\"https://www.dpreview.com/articles/5250328118/our-november-2025-photo-challenge-is-open-for-submissions\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5250328118/our-november-2025-photo-challenge-is-open-for-submissions",
    "topic": "photo",
    "date": "2025-11-16T08:00:00.000Z"
  },
  {
    "title": "How the Canon EOS R6 III stacks up to its peers",
    "q": "how the canon eos r6 iii stacks up to its peers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How the Canon EOS R6 III stacks up to its peers</b><br>When you use DPReview links to buy products, the site may earn a commission. Canon brought an FSI sensor to a partially Stacked party. Last week, Canon announced the EOS R6 III, an update to its enthusiast-tier full-frame mirrorless camera…<br><a href=\"https://www.dpreview.com/articles/8549806488/canon-eos-r6iii-vs-nikon-z6iii-panasonic-s1ii-sony-a7iv-comparison-full-frame-enthusiast\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8549806488/canon-eos-r6iii-vs-nikon-z6iii-panasonic-s1ii-sony-a7iv-comparison-full-frame-enthusiast",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Insta360 is turning the Ace Pro 2 into an instant camera",
    "q": "insta360 is turning the ace pro 2 into an instant camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Insta360 is turning the Ace Pro 2 into an instant camera</b><br>The new Pocket Printer in the Flash Print Bundle turns the Ace Pro 2 into an instant camera. Image: Insta360 Insta360 has unveiled four more accessory bundles for its Leica co-branded Ace Pro 2 action camera, along with updated firmware. T…<br><a href=\"https://www.dpreview.com/news/5157611970/insta360-ace-pro-2-accessory-bundle-updates\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/5157611970/insta360-ace-pro-2-accessory-bundle-updates",
    "topic": "photo",
    "date": "2025-11-14T20:20:00.000Z"
  },
  {
    "title": "This just in: filming with antique cameras is hard",
    "q": "this just in: filming with antique cameras is hard camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This just in: filming with antique cameras is hard</b><br>A VistaVision camera on the set of Bugonia. Image: Variety / Focus Features What are you willing to put up with to get the exact aesthetic you're looking for? For some Hollywood directors like Yorgos Lanthimos or Paul Thomas Anderson, the …<br><a href=\"https://www.dpreview.com/opinion/7849094139/vistavison-filming-issues-hollywood-analogue\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/opinion/7849094139/vistavison-filming-issues-hollywood-analogue",
    "topic": "photo",
    "date": "2025-11-14T14:15:00.000Z"
  },
  {
    "title": " This trendy camera backpack is a massive 60 percent off – but that’s not the only deal from one of my all-time favorite camera bag brands ",
    "q": " this trendy camera backpack is a massive 60 percent off – but that’s not the only deal from one of my all-time favorite camera bag brands  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This trendy camera backpack is a massive 60 percent off – but that’s not the only deal from one of my all-time favorite camera bag brands </b><br>Wandrd's camera backpacks are among my favorites, and the brand's Black Friday deals are massive<br><a href=\"https://www.digitalcameraworld.com/cameras/bags-and-backpacks/this-trendy-minimalist-camera-backpack-is-a-massive-60-percent-off-but-thats-not-the-only-deal-from-one-of-my-all-time-favorite-camera-bag-brands\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/bags-and-backpacks/this-trendy-minimalist-camera-backpack-is-a-massive-60-percent-off-but-thats-not-the-only-deal-from-one-of-my-all-time-favorite-camera-bag-brands",
    "topic": "photo",
    "date": "2025-11-18T21:20:00.000Z"
  },
  {
    "title": " This highly giftable Polaroid camera is just US$64 / £61 right now. The catch? It’s made out of Lego ",
    "q": " this highly giftable polaroid camera is just us$64 / £61 right now. the catch? it’s made out of lego  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This highly giftable Polaroid camera is just US$64 / £61 right now. The catch? It’s made out of Lego </b><br>The Lego Polaroid OneStep SX-70 set makes an excellent gift – especially at the sale price<br><a href=\"https://www.digitalcameraworld.com/cameras/instant-cameras/this-highly-giftable-polaroid-camera-is-just-us-usd64-gbp61-right-now-the-catch-its-made-out-of-lego\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/this-highly-giftable-polaroid-camera-is-just-us-usd64-gbp61-right-now-the-catch-its-made-out-of-lego",
    "topic": "photo",
    "date": "2025-11-18T18:54:43.000Z"
  },
  {
    "title": " The Nikon Z50 II is a camera that redefines entry-level – and that’s 100 percent why I love it ",
    "q": " the nikon z50 ii is a camera that redefines entry-level – and that’s 100 percent why i love it  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> The Nikon Z50 II is a camera that redefines entry-level – and that’s 100 percent why I love it </b><br>The Nikon Z50 II is an entry-level camera, but it has unusual autofocus and durability for the price<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-nikon-z50-ii-is-a-camera-that-redefines-entry-level-and-thats-100-percent-why-i-love-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/the-nikon-z50-ii-is-a-camera-that-redefines-entry-level-and-thats-100-percent-why-i-love-it",
    "topic": "photo",
    "date": "2025-11-18T17:35:04.000Z"
  },
  {
    "title": " A photographer can never have too many memory cards – might as well get ‘em while they’re cheap in this B&H Photo sale! ",
    "q": " a photographer can never have too many memory cards – might as well get ‘em while they’re cheap in this b&h photo sale!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> A photographer can never have too many memory cards – might as well get ‘em while they’re cheap in this B&H Photo sale! </b><br>Whether you’re searching for a gift for a photographer loved one or an excuse to stock up during Black Friday, you can’t go wrong with a memory card (or three)<br><a href=\"https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/a-photographer-can-never-have-too-many-memory-cards-might-as-well-get-em-while-theyre-cheap-in-this-b-and-h-photo-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/a-photographer-can-never-have-too-many-memory-cards-might-as-well-get-em-while-theyre-cheap-in-this-b-and-h-photo-sale",
    "topic": "photo",
    "date": "2025-11-18T17:03:06.000Z"
  },
  {
    "title": " I've been on a quest to find the best compact autofocus film camera – these are my top choices for nearly every budget ",
    "q": " i've been on a quest to find the best compact autofocus film camera – these are my top choices for nearly every budget  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I've been on a quest to find the best compact autofocus film camera – these are my top choices for nearly every budget </b><br>Looking for a pocketable film camera that does the hard work of focusing for you? Here are my top picks you can still find second-hand<br><a href=\"https://www.digitalcameraworld.com/cameras/film-cameras/ive-been-on-a-quest-to-find-the-best-compact-autofocus-film-camera-these-are-my-top-choices-for-nearly-every-budget\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/film-cameras/ive-been-on-a-quest-to-find-the-best-compact-autofocus-film-camera-these-are-my-top-choices-for-nearly-every-budget",
    "topic": "photo",
    "date": "2025-11-18T16:20:36.000Z"
  },
  {
    "title": " Thrift store Olympus film camera is finally developed, revealing decades-old photographs  ",
    "q": " thrift store olympus film camera is finally developed, revealing decades-old photographs   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Thrift store Olympus film camera is finally developed, revealing decades-old photographs  </b><br>A woman who purchased an Olympus film camera in a thrift store was surprised to find that it housed a roll of undeveloped film<br><a href=\"https://www.digitalcameraworld.com/cameras/film-cameras/thrift-store-olympus-film-camera-is-finally-developed-revealing-decades-old-photographs\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/film-cameras/thrift-store-olympus-film-camera-is-finally-developed-revealing-decades-old-photographs",
    "topic": "photo",
    "date": "2025-11-18T14:20:35.000Z"
  },
  {
    "title": " Sony unveils new rain covers and soft cases for super-telephoto camera set-ups ",
    "q": " sony unveils new rain covers and soft cases for super-telephoto camera set-ups  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Sony unveils new rain covers and soft cases for super-telephoto camera set-ups </b><br>Specially designed for field photographers with large telephoto lenses, these new accessories arrive in December.<br><a href=\"https://www.digitalcameraworld.com/cameras/camera-accessories/sony-unveils-new-rain-covers-and-soft-cases-for-super-telephoto-camera-set-ups\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/camera-accessories/sony-unveils-new-rain-covers-and-soft-cases-for-super-telephoto-camera-set-ups",
    "topic": "photo",
    "date": "2025-11-18T13:06:18.000Z"
  },
  {
    "title": " New DJI Osmo Action 6 is world's first action camera with adjustable aperture – is it enough? ",
    "q": " new dji osmo action 6 is world's first action camera with adjustable aperture – is it enough?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> New DJI Osmo Action 6 is world's first action camera with adjustable aperture – is it enough? </b><br>DJI shows GoPro the new limits of what is technically possible with the new Osmo Action 6, but will the pro features be enough?<br><a href=\"https://www.digitalcameraworld.com/cameras/action-cameras/new-dji-osmo-action-6-is-worlds-first-action-camera-with-adjustable-aperture-is-it-enough\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/action-cameras/new-dji-osmo-action-6-is-worlds-first-action-camera-with-adjustable-aperture-is-it-enough",
    "topic": "photo",
    "date": "2025-11-18T12:00:00.000Z"
  },
  {
    "title": " DJI Osmo Action 6 review –with adjustable aperture & swappable lenses, is it a tiny \"real camera\"? ",
    "q": " dji osmo action 6 review –with adjustable aperture & swappable lenses, is it a tiny \"real camera\"?  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> DJI Osmo Action 6 review –with adjustable aperture & swappable lenses, is it a tiny \"real camera\"? </b><br>The Osmo Action 6 is the first ever action camera to do \"real camera\" tricks? Could this be the device that finally kills the GoPro, or has the world moved on?<br><a href=\"https://www.digitalcameraworld.com/cameras/action-cameras/dji-osmo-action-6-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/action-cameras/dji-osmo-action-6-review",
    "topic": "photo",
    "date": "2025-11-18T12:00:00.000Z"
  },
  {
    "title": " Sandmarc's dedicated telephoto lens gives more power to the iPhone Pro's periscope camera ",
    "q": " sandmarc's dedicated telephoto lens gives more power to the iphone pro's periscope camera  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Sandmarc's dedicated telephoto lens gives more power to the iPhone Pro's periscope camera </b><br>The new 48mm add-on attachment provides 16x optical zoom by mounting on to the phone's tetraprism telephoto system.<br><a href=\"https://www.digitalcameraworld.com/tech/iphones/sandmarcs-dedicated-telephoto-lens-gives-more-power-to-the-iphone-pros-periscope-camera\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/tech/iphones/sandmarcs-dedicated-telephoto-lens-gives-more-power-to-the-iphone-pros-periscope-camera",
    "topic": "photo",
    "date": "2025-11-18T11:52:18.000Z"
  },
  {
    "title": "5 Thanksgiving Photography Ideas and Tips",
    "q": "5 thanksgiving photography ideas and tips camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>5 Thanksgiving Photography Ideas and Tips</b><br>Like the Thanksgiving holiday itself, photography provides a perfect vehicle for gathering with friends & family and creating memories that will last a lifetime. It makes perfect sense, then, to put the two together. If you already photogr…<br><a href=\"https://www.slrlounge.com/thanksgiving-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/thanksgiving-photography/",
    "topic": "photo",
    "date": "2025-11-18T19:20:32.000Z"
  },
  {
    "title": "New Aiarty Image Enhancer v3.5: Faster Processing and Precision-Controlled AI Upscaling",
    "q": "new aiarty image enhancer v3.5: faster processing and precision-controlled ai upscaling camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>New Aiarty Image Enhancer v3.5: Faster Processing and Precision-Controlled AI Upscaling</b><br>Aiarty has announced version 3.5 of its AI-powered image enhancement tool for Windows and macOS, adding precise control over sharpening, integrated color correction, and native support for NVIDIA’s new RTX 50-series GPUs. The update target…<br><a href=\"https://www.slrlounge.com/new-aiarty-image-enhancer-v3-5-faster-processing-and-precision-controlled-ai-upscaling/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/new-aiarty-image-enhancer-v3-5-faster-processing-and-precision-controlled-ai-upscaling/",
    "topic": "photo",
    "date": "2025-11-18T14:24:00.000Z"
  },
  {
    "title": "DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools",
    "q": "dxo’s black friday deals take up to 50% off flagship photo editing tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DxO’s Black Friday Deals Take Up to 50% Off Flagship Photo Editing Tools</b><br>DxO is rolling out its annual Black Friday sale with significant discounts across its full software lineup, offering up to 50% off both new licenses and upgrades. The promotion runs from November 18 through December 2, 2025. The sale spans…<br><a href=\"https://www.slrlounge.com/dxo-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/dxo-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-18T14:05:00.000Z"
  },
  {
    "title": "Black Friday Deal Tracker",
    "q": "black friday deal tracker camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Black Friday Deal Tracker</b><br>Get ready to save big this holiday season! Our 2025 Black Friday Deal Tracker is officially live—your one-stop guide to the best discounts across the photography industry. From must-have software and AI tools to high-performance cameras, l…<br><a href=\"https://www.slrlounge.com/black-friday-deal-tracker/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/black-friday-deal-tracker/",
    "topic": "photo",
    "date": "2025-11-17T19:00:00.000Z"
  },
  {
    "title": "4 Reasons the 85mm is Perfect for Portraits & How to Use It",
    "q": "4 reasons the 85mm is perfect for portraits & how to use it camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>4 Reasons the 85mm is Perfect for Portraits & How to Use It</b><br>In this video, Pye gives four reasons why the 85mm prime lens has become a staple in a portrait photographer's toolkit and he also shares how to use it.<br><a href=\"https://www.slrlounge.com/85-mm-prime-lens-perfect-portrait-photography-how-to-use-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/85-mm-prime-lens-perfect-portrait-photography-how-to-use-it/",
    "topic": "photo",
    "date": "2025-11-17T18:00:26.000Z"
  },
  {
    "title": "Wedding Photography Questions for Clients | Succeed with Sincerity",
    "q": "wedding photography questions for clients | succeed with sincerity camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Wedding Photography Questions for Clients | Succeed with Sincerity</b><br>Communication makes everything go smoother and the more you communicate with your clients, the better you know how to serve them. These ten things you should ask them before you photograph their wedding<br><a href=\"https://www.slrlounge.com/wedding-photography-questions-for-clients-succeed-with-sincerity/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/wedding-photography-questions-for-clients-succeed-with-sincerity/",
    "topic": "photo",
    "date": "2025-11-16T17:45:26.000Z"
  },
  {
    "title": "How to Choose the Right Backdrop Color in Portrait Photography",
    "q": "how to choose the right backdrop color in portrait photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to Choose the Right Backdrop Color in Portrait Photography</b><br>Despite playing a more supportive role in photos, backdrops significantly impact the final image. The best backdrops work in tandem with the subject, allowing them to pop for bolder occasions or remain subdued when the mood calls for it. T…<br><a href=\"https://www.slrlounge.com/portrait-photography-how-to-choose-the-right-backdrop-color/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/portrait-photography-how-to-choose-the-right-backdrop-color/",
    "topic": "photo",
    "date": "2025-11-15T18:58:57.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "SeeStar S50 captures deep space for Astro photography  newbies",
    "q": "seestar s50 captures deep space for astro photography  newbies camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>SeeStar S50 captures deep space for Astro photography  newbies</b><br>I fought the idea of photographing deep space objects such as Nebulas and Galaxies other than our own Milky Way. My friend, Larry Gunn suggested I dip my toe into the genre with a device called the SeeStar S50. A reasonably priced automate…<br><a href=\"https://photofocus.com/photography/seestar-s50-captures-deep-space-for-astro-photography-newbies/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/seestar-s50-captures-deep-space-for-astro-photography-newbies/",
    "topic": "photo",
    "date": "2025-11-12T20:51:20.000Z"
  },
  {
    "title": "Luminar Neo Fall Upgrade 2025 is here!",
    "q": "luminar neo fall upgrade 2025 is here! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Luminar Neo Fall Upgrade 2025 is here!</b><br>Remember when Sky Replacement first arrived? It changed everything. Skylum didn’t just give photographers a new tool, it gave them freedom. Suddenly, anyone could transform an image without masking, layering, or hours of manual work. That …<br><a href=\"https://photofocus.com/news/luminar-neo-fall-upgrade-2025-is-here/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/luminar-neo-fall-upgrade-2025-is-here/",
    "topic": "photo",
    "date": "2025-11-11T23:27:21.000Z"
  },
  {
    "title": "Luminar Android 2.0 is here : Discover amazing new tools",
    "q": "luminar android 2.0 is here : discover amazing new tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Luminar Android 2.0 is here : Discover amazing new tools</b><br>Skylum, has teamed up with Google to unveil Luminar Photo Editor, now available for Android and ChromeOS. This launch brings Luminar’s powerful, intelligent editing capabilities to mobile and Chromebook users, offering a fresh, intuitive, …<br><a href=\"https://photofocus.com/news/luminar-android-2-0-is-here-discover-amazing-new-tools/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/luminar-android-2-0-is-here-discover-amazing-new-tools/",
    "topic": "photo",
    "date": "2025-11-11T23:14:46.000Z"
  },
  {
    "title": "Godox announces new iFlash iT32 – One System built for all",
    "q": "godox announces new iflash it32 – one system built for all camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox announces new iFlash iT32 – One System built for all</b><br>Meet the iT32 iFlash Camera Flash & X5 TTL Wireless Flash Trigger — a modular lighting system built for ultimate versatility and efficiency. When paired with different X5 versions, one iT32 flash body seamlessly adapts to Canon, Nikon, Son…<br><a href=\"https://photofocus.com/news/godox-announces-new-iflash-it32-one-system-built-for-all/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-announces-new-iflash-it32-one-system-built-for-all/",
    "topic": "photo",
    "date": "2025-11-11T23:01:39.000Z"
  },
  {
    "title": "Save up to 33% off Thypoch Lenses",
    "q": "save up to 33% off thypoch lenses camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Save up to 33% off Thypoch Lenses</b><br>From November 11 to December 3, we offer up to 33% off on Thypoch photo lenses during the Black Friday sale. Please visit their website for more specials<br><a href=\"https://photofocus.com/deals/save-up-to-33-off-thypoch-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/deals/save-up-to-33-off-thypoch-lenses/",
    "topic": "photo",
    "date": "2025-11-10T20:00:00.000Z"
  },
  {
    "title": "Meross’ radar presence sensor ditches the cord and adds Matter-over-Thread support",
    "q": "meross’ radar presence sensor ditches the cord and adds matter-over-thread support windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Meross’ radar presence sensor ditches the cord and adds Matter-over-Thread support</b><br>The MS605 has an articulated installation plate allowing the angle of the sensor to be adjusted. | Image: Meross Meross has announced a new version of its MS600 presence sensor that’s now battery-powered, so installation isn’t limited to p…<br><a href=\"https://www.theverge.com/news/823265/meross-matter-thread-smart-presence-sensor-ms605-radar-mmwave\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/823265/meross-matter-thread-smart-presence-sensor-ms605-radar-mmwave",
    "topic": "it",
    "date": "2025-11-19T06:00:00.000Z"
  },
  {
    "title": "Cloudflare explains Tuesday’s outage that temporarily took down ChatGPT",
    "q": "cloudflare explains tuesday’s outage that temporarily took down chatgpt windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Cloudflare explains Tuesday’s outage that temporarily took down ChatGPT</b><br>A blog post published Tuesday night by Cloudflare co-founder and CEO Matthew Prince has details on what caused its “worst outage since 2019,” pinning the issue to a problem in the Bot Management system that is supposed to control which aut…<br><a href=\"https://www.theverge.com/news/823711/cloudflare-outage-postmortem\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/823711/cloudflare-outage-postmortem",
    "topic": "it",
    "date": "2025-11-19T02:25:59.000Z"
  },
  {
    "title": "The best Android phones",
    "q": "the best android phones windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Android phones</b><br>Editor’s note: Black Friday doesn’t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we’ve rounded up the best early Black Friday deals you can already get. The Android ecosystem is all about c…<br><a href=\"https://www.theverge.com/23674658/best-android-phone\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/23674658/best-android-phone",
    "topic": "it",
    "date": "2025-11-19T00:08:49.000Z"
  },
  {
    "title": "EA will skip next year&#8217;s F1 game and release update DLC instead",
    "q": "ea will skip next year&#8217;s f1 game and release update dlc instead windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>EA will skip next year&#8217;s F1 game and release update DLC instead</b><br>EA has announced some big changes for the future of its F1 racing series. Next year, instead of a new game, the company will opt to release a paid expansion for F1 25 as part of “a strategic reset for the F1 Franchise,” EA says. The next f…<br><a href=\"https://www.theverge.com/news/823675/ea-f1-25-2026-2027-dlc-expansion-update-game\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/823675/ea-f1-25-2026-2027-dlc-expansion-update-game",
    "topic": "it",
    "date": "2025-11-19T00:04:33.000Z"
  },
  {
    "title": "The Apple deals worth shopping before Black Friday (and the discounts to expect)",
    "q": "the apple deals worth shopping before black friday (and the discounts to expect) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Apple deals worth shopping before Black Friday (and the discounts to expect)</b><br>Apple’s handy location trackers are cheaper than ever right now. Black Friday often brings the best Apple deals of the year, but not everyone wants to spend their Thanksgiving weekend shopping online (or in person). Thankfully, if you want…<br><a href=\"https://www.theverge.com/tech/821484/black-friday-best-early-apple-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/821484/black-friday-best-early-apple-deals-2025",
    "topic": "it",
    "date": "2025-11-18T23:49:39.000Z"
  },
  {
    "title": "The best Xbox controller to buy right now",
    "q": "the best xbox controller to buy right now windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Xbox controller to buy right now</b><br>Editor’s note: Black Friday doesn’t officially take place until Friday, November 28th; however, if you want to shop ahead of time, we’ve rounded up the best early Black Friday deals you can already get. We live in a golden age of controlle…<br><a href=\"https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/23025443/best-xbox-controllers-one-series-x-s",
    "topic": "it",
    "date": "2025-11-18T22:30:00.000Z"
  },
  {
    "title": "The best early Black Friday deals we’ve found so far on laptops, TVs, and more",
    "q": "the best early black friday deals we’ve found so far on laptops, tvs, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best early Black Friday deals we’ve found so far on laptops, TVs, and more</b><br>Black Friday is the most anticipated day of the year for bargain hunters. While there’s still some time to go before November 28th, we’re already starting to see a healthy selection of early discounts, allowing you to get a jump on your ho…<br><a href=\"https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025",
    "topic": "it",
    "date": "2025-11-18T20:22:53.000Z"
  },
  {
    "title": " The Ninja Café Luxe espresso machine drops to an all time Aussie low for Black Friday – grab one now from AU$629 ",
    "q": " the ninja café luxe espresso machine drops to an all time aussie low for black friday – grab one now from au$629  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The Ninja Café Luxe espresso machine drops to an all time Aussie low for Black Friday – grab one now from AU$629 </b><br>The Ninja Luxe Café Premier espresso machine caused quite the stir when it launched in Australia – it's now available for its lowest price yet in the Black Friday sales.<br><a href=\"https://www.techradar.com/home/coffee-machines/the-ninja-cafe-luxe-espresso-machine-drops-to-an-all-time-aussie-low-for-black-friday-grab-one-now-from-aud629\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/home/coffee-machines/the-ninja-cafe-luxe-espresso-machine-drops-to-an-all-time-aussie-low-for-black-friday-grab-one-now-from-aud629",
    "topic": "it",
    "date": "2025-11-19T04:27:20.000Z"
  },
  {
    "title": " This is one benchmark you won't want to top - devious ransomware will test your system to see how easy it is to hack ",
    "q": " this is one benchmark you won't want to top - devious ransomware will test your system to see how easy it is to hack  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> This is one benchmark you won't want to top - devious ransomware will test your system to see how easy it is to hack </b><br>Kraken ransomware benchmarks infected systems before choosing full or partial encryption, targeting virtual machines, databases, and network shares globally.<br><a href=\"https://www.techradar.com/pro/security/this-devious-ransomware-will-benchmark-your-system-to-see-how-easy-it-is-to-hack\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/this-devious-ransomware-will-benchmark-your-system-to-see-how-easy-it-is-to-hack",
    "topic": "it",
    "date": "2025-11-19T00:28:00.000Z"
  },
  {
    "title": " It’s official – the iPhone 17 gets a big Wi-Fi boost from Apple’s new chip, but the Pixel 10 Pro still beats it ",
    "q": " it’s official – the iphone 17 gets a big wi-fi boost from apple’s new chip, but the pixel 10 pro still beats it  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> It’s official – the iPhone 17 gets a big Wi-Fi boost from Apple’s new chip, but the Pixel 10 Pro still beats it </b><br>The iPhone 17 range’s N1 chip has brought fantastic Wi-Fi speed improvements to the device, a new report claims.<br><a href=\"https://www.techradar.com/phones/its-official-the-iphone-17-gets-a-big-wi-fi-boost-from-apples-new-chip-but-the-pixel-10-pro-still-beats-it\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/phones/its-official-the-iphone-17-gets-a-big-wi-fi-boost-from-apples-new-chip-but-the-pixel-10-pro-still-beats-it",
    "topic": "it",
    "date": "2025-11-19T00:00:00.000Z"
  },
  {
    "title": " Even your smart photo frames aren't safe from hackers now - experts flag popular Android product is at risk, so here's how to stay safe ",
    "q": " even your smart photo frames aren't safe from hackers now - experts flag popular android product is at risk, so here's how to stay safe  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Even your smart photo frames aren't safe from hackers now - experts flag popular Android product is at risk, so here's how to stay safe </b><br>Security researchers warn Uhale digital frames download malware at boot, exposing users to botnets, rooted vulnerabilities, and the theft of personal data.<br><a href=\"https://www.techradar.com/pro/even-your-smart-photo-frames-arent-safe-from-hackers-now-experts-flag-popular-android-product-is-at-risk-so-heres-how-to-stay-safe\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/even-your-smart-photo-frames-arent-safe-from-hackers-now-experts-flag-popular-android-product-is-at-risk-so-heres-how-to-stay-safe",
    "topic": "it",
    "date": "2025-11-18T23:09:00.000Z"
  },
  {
    "title": "'The Mighty Nein': How to Watch the Latest Quest From Critical Role",
    "q": "'the mighty nein': how to watch the latest quest from critical role windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>'The Mighty Nein': How to Watch the Latest Quest From Critical Role</b><br>The new adult animated fantasy series is set decades after Vox Machina.<br><a href=\"https://www.cnet.com/tech/services-and-software/the-mighty-nein-how-to-watch-the-latest-quest-from-critical-role/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/the-mighty-nein-how-to-watch-the-latest-quest-from-critical-role/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-18T23:00:41.000Z"
  },
  {
    "title": " Cloudflare's CTO apologizes after error takes huge chunk of the internet offline — 'we failed our customers and the broader internet' ",
    "q": " cloudflare's cto apologizes after error takes huge chunk of the internet offline — 'we failed our customers and the broader internet'  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Cloudflare's CTO apologizes after error takes huge chunk of the internet offline — 'we failed our customers and the broader internet' </b><br>Cloudflare has confirmed that a bug in one of its core services caused a major outage on Tuesday, taking large portions of the internet offline.<br><a href=\"https://www.tomshardware.com/service-providers/cloudflare-apologizes-after-outage-takes-major-websites-offline\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/service-providers/cloudflare-apologizes-after-outage-takes-major-websites-offline",
    "topic": "it",
    "date": "2025-11-18T17:31:04.000Z"
  },
  {
    "title": " Apple and Broadcom job listings suggest potential Intel Foundry collaborations — requirements highlight expertise in Intel's EMIB and 2.5D memory packaging tech ",
    "q": " apple and broadcom job listings suggest potential intel foundry collaborations — requirements highlight expertise in intel's emib and 2.5d memory packaging tech  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Apple and Broadcom job listings suggest potential Intel Foundry collaborations — requirements highlight expertise in Intel's EMIB and 2.5D memory packaging tech </b><br>A new job posting at Apple exposes clues that the company could be looking at Intel as a packaging partner for future SoCs. Future M-series chips could leverage EMIB and/or Foveros.<br><a href=\"https://www.tomshardware.com/tech-industry/big-tech/apple-and-broadcom-job-listings-suggest-potential-intel-foundry-collaborations-requirements-highlight-expertise-in-intels-emib-and-2-5d-memory-packaging-tech\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/big-tech/apple-and-broadcom-job-listings-suggest-potential-intel-foundry-collaborations-requirements-highlight-expertise-in-intels-emib-and-2-5d-memory-packaging-tech",
    "topic": "it",
    "date": "2025-11-18T15:47:30.000Z"
  },
  {
    "title": " DOOM: The Dark Ages's take on Horde mode just got a huge update — and players can now share favorite encounters with friends ",
    "q": " doom: the dark ages's take on horde mode just got a huge update — and players can now share favorite encounters with friends  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> DOOM: The Dark Ages's take on Horde mode just got a huge update — and players can now share favorite encounters with friends </b><br>DOOM: The Dark Ages' Horde-like Ripatorium mode gets expanded heavily with Update 3, letting players share their favorite encounters with each other.<br><a href=\"https://www.windowscentral.com/gaming/xbox/doom-the-dark-ages-update-3-ripatorium-sharing\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/doom-the-dark-ages-update-3-ripatorium-sharing",
    "topic": "it",
    "date": "2025-11-18T22:40:18.000Z"
  },
  {
    "title": " Hold up, Battlefield 6's new Eastwood map in California Resistance is actually awesome — but it shares one big issue with all the rest ",
    "q": " hold up, battlefield 6's new eastwood map in california resistance is actually awesome — but it shares one big issue with all the rest  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Hold up, Battlefield 6's new Eastwood map in California Resistance is actually awesome — but it shares one big issue with all the rest </b><br>Battlefield 6's California Resistance update added the Eastwood map, and after playing it, it's quickly become one of my favorites in the entire game.<br><a href=\"https://www.windowscentral.com/gaming/hold-up-battlefield-6s-new-eastwood-map-in-california-resistance-is-actually-awesome-but-it-shares-one-big-issue-with-all-the-rest\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/hold-up-battlefield-6s-new-eastwood-map-in-california-resistance-is-actually-awesome-but-it-shares-one-big-issue-with-all-the-rest",
    "topic": "it",
    "date": "2025-11-18T22:07:38.000Z"
  },
  {
    "title": " Unlock the full power of your Xbox Ally — this system update unlocks more performance ",
    "q": " unlock the full power of your xbox ally — this system update unlocks more performance  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Unlock the full power of your Xbox Ally — this system update unlocks more performance </b><br>Armoury Crate SE update version 2.1.15.0 is rolling out to ROG handheld gaming PCs, and it's bringing some excellent performance improvements.<br><a href=\"https://www.windowscentral.com/hardware/handheld-gaming-pc/rog-ally-xbox-ally-update-version-21150\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/handheld-gaming-pc/rog-ally-xbox-ally-update-version-21150",
    "topic": "it",
    "date": "2025-11-18T21:39:23.000Z"
  },
  {
    "title": " Microsoft doubles down on agentic AI — Agent 365 prepares for a future with over 1 billion agents ",
    "q": " microsoft doubles down on agentic ai — agent 365 prepares for a future with over 1 billion agents  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft doubles down on agentic AI — Agent 365 prepares for a future with over 1 billion agents </b><br>Microsoft revealed Agent 365 during Ignite, launching a central hub that was designed for creating, deploying, and securing AI agents across Microsoft 365.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-doubles-down-on-agentic-ai-agent-365-prepares-for-a-future-with-over-1-billion-agents\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-doubles-down-on-agentic-ai-agent-365-prepares-for-a-future-with-over-1-billion-agents",
    "topic": "it",
    "date": "2025-11-18T21:15:39.000Z"
  },
  {
    "title": " Windows 11 is getting a new point-in-time restore feature and other advanced recovery tools ",
    "q": " windows 11 is getting a new point-in-time restore feature and other advanced recovery tools  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 is getting a new point-in-time restore feature and other advanced recovery tools </b><br>Microsoft has unveiled new recovery methods for Windows 11 PCs in the event where a PC is no longer able to boot, or data has become corrupted.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-11-is-gaining-a-new-point-in-time-restore-feature-and-other-advanced-recovery-tools\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/windows-11-is-gaining-a-new-point-in-time-restore-feature-and-other-advanced-recovery-tools",
    "topic": "it",
    "date": "2025-11-18T16:00:00.000Z"
  },
  {
    "title": " Microsoft is \"raising the bar\" and making major changes to how drivers are built and verified on Windows 11 — here are the important details ",
    "q": " microsoft is \"raising the bar\" and making major changes to how drivers are built and verified on windows 11 — here are the important details  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft is \"raising the bar\" and making major changes to how drivers are built and verified on Windows 11 — here are the important details </b><br>Windows 11 is raising the security and resiliency bar when it comes to driver signing, and is trying to move peripheral drivers out of the kernel.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/microsoft-is-raising-the-bar-and-making-major-changes-to-how-drivers-are-built-and-verified-on-windows-11-heres-the-important-details\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/microsoft-is-raising-the-bar-and-making-major-changes-to-how-drivers-are-built-and-verified-on-windows-11-heres-the-important-details",
    "topic": "it",
    "date": "2025-11-18T16:00:00.000Z"
  },
  {
    "title": " Windows 11 is gaining a powerful set of new AI productivity features in 2026 — here's what to expect ",
    "q": " windows 11 is gaining a powerful set of new ai productivity features in 2026 — here's what to expect  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Windows 11 is gaining a powerful set of new AI productivity features in 2026 — here's what to expect </b><br>Microsoft is adding the ability to generate text in ant text box, dictate and transcribe speech using natural language, and summarize emails using AI to Windows 11.<br><a href=\"https://www.windowscentral.com/microsoft/windows-11/windows-11-is-gaining-a-powerful-set-of-new-ai-productivity-features-in-2026-heres-what-to-expect\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/windows-11/windows-11-is-gaining-a-powerful-set-of-new-ai-productivity-features-in-2026-heres-what-to-expect",
    "topic": "it",
    "date": "2025-11-18T16:00:00.000Z"
  },
  {
    "title": "Thunderbird adds native support for Microsoft Exchange accounts",
    "q": "thunderbird adds native support for microsoft exchange accounts windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Thunderbird adds native support for Microsoft Exchange accounts</b><br>Thunderbird 145 has been released with full native support for Microsoft Exchange email via the Exchange Web Services (EWS) protocol. [...]<br><a href=\"https://www.bleepingcomputer.com/news/software/thunderbird-adds-native-support-for-microsoft-exchange-accounts/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/software/thunderbird-adds-native-support-for-microsoft-exchange-accounts/",
    "topic": "it",
    "date": "2025-11-18T22:09:32.000Z"
  },
  {
    "title": "Windows 11 gets new Cloud Rebuild, Point-in-Time Restore tools",
    "q": "windows 11 gets new cloud rebuild, point-in-time restore tools windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Windows 11 gets new Cloud Rebuild, Point-in-Time Restore tools</b><br>Microsoft announced two new Windows 11 recovery features today at the Ignite developer conference, called Cloud Rebuild and Point-in-Time Restore (PITR), that aim to reduce downtime and make it easier to recover from system failures or fau…<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/windows-11-gets-new-cloud-rebuild-point-in-time-restore-tools/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/windows-11-gets-new-cloud-rebuild-point-in-time-restore-tools/",
    "topic": "it",
    "date": "2025-11-18T19:29:52.000Z"
  },
  {
    "title": "Fortinet warns of new FortiWeb zero-day exploited in attacks",
    "q": "fortinet warns of new fortiweb zero-day exploited in attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Fortinet warns of new FortiWeb zero-day exploited in attacks</b><br>Today, Fortinet released security updates to patch a new FortiWeb zero-day vulnerability that threat actors are actively exploiting in attacks. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/fortinet-warns-of-new-fortiweb-zero-day-exploited-in-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/fortinet-warns-of-new-fortiweb-zero-day-exploited-in-attacks/",
    "topic": "it",
    "date": "2025-11-18T19:01:39.000Z"
  },
  {
    "title": "Microsoft to integrate Sysmon directly into Windows 11, Server 2025",
    "q": "microsoft to integrate sysmon directly into windows 11, server 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft to integrate Sysmon directly into Windows 11, Server 2025</b><br>Microsoft announced today that it will integrate Sysmon natively into Windows 11 and Windows Server 2025 next year, making it unnecessary to deploy the standalone Sysinternals tools. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-to-integrate-sysmon-directly-into-windows-11-server-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-integrate-sysmon-directly-into-windows-11-server-2025/",
    "topic": "it",
    "date": "2025-11-18T17:25:18.000Z"
  },
  {
    "title": "Microsoft Teams to let users report messages wrongly flagged as threats",
    "q": "microsoft teams to let users report messages wrongly flagged as threats windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft Teams to let users report messages wrongly flagged as threats</b><br>Microsoft says that Teams users will be able to report false-positive threat alerts triggered by messages incorrectly flagged as malicious. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-to-let-users-report-messages-wrongly-flagged-as-threats/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-to-let-users-report-messages-wrongly-flagged-as-threats/",
    "topic": "it",
    "date": "2025-11-18T17:14:34.000Z"
  },
  {
    "title": "French agency Pajemploi reports data breach affecting 1.2M people",
    "q": "french agency pajemploi reports data breach affecting 1.2m people windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>French agency Pajemploi reports data breach affecting 1.2M people</b><br>Pajemploi, the French social security service for parents and home-based childcare providers, has suffered a data breach that may have exposed personal information of 1.2 million individuals. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/french-agency-pajemploi-reports-data-breach-affecting-12m-people/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/french-agency-pajemploi-reports-data-breach-affecting-12m-people/",
    "topic": "it",
    "date": "2025-11-18T16:59:27.000Z"
  },
  {
    "title": "Google fixes new Chrome zero-day flaw exploited in attacks",
    "q": "google fixes new chrome zero-day flaw exploited in attacks windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Google fixes new Chrome zero-day flaw exploited in attacks</b><br>Google has released an emergency security update to fix the seventh Chrome zero-day vulnerability exploited in attacks this year. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/google-fixes-new-chrome-zero-day-flaw-exploited-in-attacks/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/google-fixes-new-chrome-zero-day-flaw-exploited-in-attacks/",
    "topic": "it",
    "date": "2025-11-18T10:13:17.000Z"
  },
  {
    "title": "Linux is getting this popular game library manager next year",
    "q": "linux is getting this popular game library manager next year windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Linux is getting this popular game library manager next year</b><br>The developer has decided to make the switch to Linux themselves.<br><a href=\"https://www.howtogeek.com/linux-is-getting-playnite-game-library-manager/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/linux-is-getting-playnite-game-library-manager/",
    "topic": "it",
    "date": "2025-11-18T19:10:14.000Z"
  },
  {
    "title": "Q4OS Linux brought my old laptop back to life and you mustn't ignore it",
    "q": "q4os linux brought my old laptop back to life and you mustn't ignore it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Q4OS Linux brought my old laptop back to life and you mustn't ignore it</b><br>A balanced distro to keep your old laptop alive for a few more years with a good desktop environment.<br><a href=\"https://www.xda-developers.com/q4os-linux-resurrected-my-old-laptop/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/q4os-linux-resurrected-my-old-laptop/",
    "topic": "it",
    "date": "2025-11-18T21:00:18.000Z"
  }
]