[
  {
    "title": "Photographer Adds Wheels to a Probe Lens to Make ‘Weirdest Lens Even Weirder’",
    "q": "photographer adds wheels to a probe lens to make ‘weirdest lens even weirder’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Adds Wheels to a Probe Lens to Make ‘Weirdest Lens Even Weirder’</b><br>Paris-based photographer and filmmaker Mathieu Stern, known for his experimental photography and creative YouTube tutorials, has once again pushed the limits of lens experimentation. This time, Stern put wheels on a probe lens to create un…<br><a href=\"https://petapixel.com/2025/11/14/photographer-adds-wheels-to-a-probe-lens-to-make-weirdest-lens-even-weirder/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/photographer-adds-wheels-to-a-probe-lens-to-make-weirdest-lens-even-weirder/",
    "topic": "photo",
    "date": "2025-11-14T22:44:39.000Z"
  },
  {
    "title": "This Adapter Turns an L-Mount Camera Into a Sliding 4×5 Digital Back",
    "q": "this adapter turns an l-mount camera into a sliding 4×5 digital back camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This Adapter Turns an L-Mount Camera Into a Sliding 4×5 Digital Back</b><br>Fotodiox, makers of some of the more niche adapters on the market, just announced another unusual option: an adapter that lets photographers mount a full-frame L-Mount camera to any 4x5 large-format camera with a supported Graflok back, op…<br><a href=\"https://petapixel.com/2025/11/14/this-adapter-turns-an-l-mount-camera-into-a-sliding-4x5-digital-back/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/this-adapter-turns-an-l-mount-camera-into-a-sliding-4x5-digital-back/",
    "topic": "photo",
    "date": "2025-11-14T22:33:06.000Z"
  },
  {
    "title": "There Are Some Screaming Deals on Camera Memory Cards Right Now",
    "q": "there are some screaming deals on camera memory cards right now camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>There Are Some Screaming Deals on Camera Memory Cards Right Now</b><br>With holiday sales starting early, photographers have a rare chance to stock up on fast, reliable memory cards from top brands, many at the lowest prices of the year. [Read More]<br><a href=\"https://petapixel.com/2025/11/14/there-are-some-screaming-deals-on-camera-memory-cards-right-now/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/there-are-some-screaming-deals-on-camera-memory-cards-right-now/",
    "topic": "photo",
    "date": "2025-11-14T21:40:41.000Z"
  },
  {
    "title": "How Two Photographers Transformed RAW Photo Support on Mac",
    "q": "how two photographers transformed raw photo support on mac camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How Two Photographers Transformed RAW Photo Support on Mac</b><br>As photographers using macOS know all too well, native macOS-level support for RAW image formats can be hit-or-miss, and new support can take months or years to arrive, sometimes never arriving at all. This means that photographers must re…<br><a href=\"https://petapixel.com/2025/11/14/how-two-photographers-transformed-raw-photo-support-on-mac/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/how-two-photographers-transformed-raw-photo-support-on-mac/",
    "topic": "photo",
    "date": "2025-11-14T19:53:22.000Z"
  },
  {
    "title": "These Photos of ‘Power’ Won This Year’s Prestigious $1 Million HIPA Contest",
    "q": "these photos of ‘power’ won this year’s prestigious $1 million hipa contest camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>These Photos of ‘Power’ Won This Year’s Prestigious $1 Million HIPA Contest</b><br>The world's most profitable photography contest, HIPA, announced its 14th annual awards themed 'Power' on 11th November 2025, where 87,000 images from 50,000 photographers vied for the top honors. This year's awards ceremony was held at th…<br><a href=\"https://petapixel.com/2025/11/14/these-photos-of-power-won-this-years-prestigious-1-million-hipa-contest/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/these-photos-of-power-won-this-years-prestigious-1-million-hipa-contest/",
    "topic": "photo",
    "date": "2025-11-14T19:23:45.000Z"
  },
  {
    "title": "Artist Considers Lawsuit Over Border Agents’ Group Photo in Front of His Chicago Sculpture",
    "q": "artist considers lawsuit over border agents’ group photo in front of his chicago sculpture camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Artist Considers Lawsuit Over Border Agents’ Group Photo in Front of His Chicago Sculpture</b><br>The acclaimed artist Anish Kapoor is considering taking legal action after being left \"horrified\" by a group photo taken by border patrol agents posed in front of his Cloud Gate sculpture in Chicago. [Read More]<br><a href=\"https://petapixel.com/2025/11/14/artist-considers-lawsuit-over-border-agents-group-photo-in-front-of-his-chicago-sculpture/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/artist-considers-lawsuit-over-border-agents-group-photo-in-front-of-his-chicago-sculpture/",
    "topic": "photo",
    "date": "2025-11-14T17:52:55.000Z"
  },
  {
    "title": "Filmmakers Can Use 10 Times As Many Lenses on Super 16mm Thanks to OFG’s New Adapter",
    "q": "filmmakers can use 10 times as many lenses on super 16mm thanks to ofg’s new adapter camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Filmmakers Can Use 10 Times As Many Lenses on Super 16mm Thanks to OFG’s New Adapter</b><br>Old Fast Glass (OFG), a specialty cinema camera lens maker and rental house, unveiled the OFG Customs Long Shot. It is a new optical adapter designed to enable cinematographers to use full-frame and larger cinema lenses on Super 16mm camer…<br><a href=\"https://petapixel.com/2025/11/14/filmmakers-can-use-10-times-as-many-lenses-on-super-16mm-thanks-to-ofgs-new-adapter/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/filmmakers-can-use-10-times-as-many-lenses-on-super-16mm-thanks-to-ofgs-new-adapter/",
    "topic": "photo",
    "date": "2025-11-14T16:57:26.000Z"
  },
  {
    "title": "Photographer Claims Drake Copied His ‘Ameriguns’ Series in Music Video",
    "q": "photographer claims drake copied his ‘ameriguns’ series in music video camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographer Claims Drake Copied His ‘Ameriguns’ Series in Music Video</b><br>The photographer involved in a heavily scrutinized Balenciaga campaign three years ago has filed a lawsuit against Drake, alleging that the rapper’s music video copied his work and attempted to connect his feud with Kendrick Lamar to the p…<br><a href=\"https://petapixel.com/2025/11/14/photographer-claims-drake-copied-his-ameriguns-series-in-music-video/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/photographer-claims-drake-copied-his-ameriguns-series-in-music-video/",
    "topic": "photo",
    "date": "2025-11-14T15:42:45.000Z"
  },
  {
    "title": "Basketball Player Runs Back onto the Court with Camera Strapped to His Leg",
    "q": "basketball player runs back onto the court with camera strapped to his leg camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Basketball Player Runs Back onto the Court with Camera Strapped to His Leg</b><br>A sports photographer had a disaster while sitting courtside at a college basketball game when a player fell into the crowd and came running back with a camera strapped to his leg. [Read More]<br><a href=\"https://petapixel.com/2025/11/14/basketball-player-runs-back-onto-the-court-with-camera-strapped-to-his-leg/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/14/basketball-player-runs-back-onto-the-court-with-camera-strapped-to-his-leg/",
    "topic": "photo",
    "date": "2025-11-14T15:25:29.000Z"
  },
  {
    "title": "Insta360 is turning the Ace Pro 2 into an instant camera",
    "q": "insta360 is turning the ace pro 2 into an instant camera camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Insta360 is turning the Ace Pro 2 into an instant camera</b><br>The new Pocket Printer in the Flash Print Bundle turns the Ace Pro 2 into an instant camera. Image: Insta360 Insta360 has unveiled four more accessory bundles for its Leica co-branded Ace Pro 2 action camera, along with updated firmware. T…<br><a href=\"https://www.dpreview.com/news/5157611970/insta360-ace-pro-2-accessory-bundle-updates\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/5157611970/insta360-ace-pro-2-accessory-bundle-updates",
    "topic": "photo",
    "date": "2025-11-14T20:20:00.000Z"
  },
  {
    "title": "This just in: filming with antique cameras is hard",
    "q": "this just in: filming with antique cameras is hard camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This just in: filming with antique cameras is hard</b><br>A VistaVision camera on the set of Bugonia. Image: Variety / Focus Features What are you willing to put up with to get the exact aesthetic you're looking for? For some Hollywood directors like Yorgos Lanthimos or Paul Thomas Anderson, the …<br><a href=\"https://www.dpreview.com/opinion/7849094139/vistavison-filming-issues-hollywood-analogue\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/opinion/7849094139/vistavison-filming-issues-hollywood-analogue",
    "topic": "photo",
    "date": "2025-11-14T14:15:00.000Z"
  },
  {
    "title": "DJI's Neo 2 makes it even easier for the drone-curious to get great footage",
    "q": "dji's neo 2 makes it even easier for the drone-curious to get great footage camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>DJI's Neo 2 makes it even easier for the drone-curious to get great footage</b><br>Image: DJI DJI has announced a new iteration of its tiny, beginner-friendly camera drone. The DJI Neo 2 introduces several changes designed to make the drone easier and safer to fly, such as obstacle sensing, a new display, and better wind…<br><a href=\"https://www.dpreview.com/news/4344636762/dji-neo-2-drone-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/4344636762/dji-neo-2-drone-announcement",
    "topic": "photo",
    "date": "2025-11-13T12:00:00.000Z"
  },
  {
    "title": "What makes a moment memorable? DPReview readers share their unforgettable shots",
    "q": "what makes a moment memorable? dpreview readers share their unforgettable shots camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What makes a moment memorable? DPReview readers share their unforgettable shots</b><br>What's the most memorable photograph you've taken? Last week, we asked you to look beyond specs and sensors and dig into the true heart of photography: the images that etch themselves into your memory. It wasn’t about the sharpest lens or …<br><a href=\"https://www.dpreview.com/articles/1259446496/what-makes-a-moment-memorable-dpreview-readers-share-their-unforgettable-shots\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1259446496/what-makes-a-moment-memorable-dpreview-readers-share-their-unforgettable-shots",
    "topic": "photo",
    "date": "2025-11-13T00:21:00.000Z"
  },
  {
    "title": "The Meike 85mm F1.8 SE Mark II promises improved optics and closer focusing",
    "q": "the meike 85mm f1.8 se mark ii promises improved optics and closer focusing camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Meike 85mm F1.8 SE Mark II promises improved optics and closer focusing</b><br>Photo: Meike Meike has announced the SE Series 85mm F1.8 Mark II lens for full-frame L mount, Z mount and E mount cameras. The third-party lens manufacturer promises improvements across the board with the updated model, while maintaining i…<br><a href=\"https://www.dpreview.com/news/7258149821/meike-85mm-f1p8-se-mark-ii-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7258149821/meike-85mm-f1p8-se-mark-ii-announcement",
    "topic": "photo",
    "date": "2025-11-12T18:40:00.000Z"
  },
  {
    "title": "How to photograph the northern lights",
    "q": "how to photograph the northern lights camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How to photograph the northern lights</b><br>Editor's note: This article was originally published in 2017. We’re republishing it now as a resource for photographers looking for insight into capturing the Aurora during the current auroral event. After publishing my recent 2017 Gear of…<br><a href=\"https://www.dpreview.com/articles/9262664983/how-to-photograph-the-northern-lights\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/9262664983/how-to-photograph-the-northern-lights",
    "topic": "photo",
    "date": "2025-11-12T17:47:00.000Z"
  },
  {
    "title": "What the FE? A plain English guide to Sony's lens alphabet, from FE to ZA",
    "q": "what the fe? a plain english guide to sony's lens alphabet, from fe to za camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>What the FE? A plain English guide to Sony's lens alphabet, from FE to ZA</b><br>Photo: Sony Lens names can be quite complicated, with some brands including every detail about the lens in their name. Thankfully, Sony takes a more simplistic approach. Its lens names are generally concise and straightforward, without an …<br><a href=\"https://www.dpreview.com/articles/1043316425/what-the-fe-a-plain-english-guide-to-sonys-lens-alphabet-from-fe-to-za\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/1043316425/what-the-fe-a-plain-english-guide-to-sonys-lens-alphabet-from-fe-to-za",
    "topic": "photo",
    "date": "2025-11-12T14:24:00.000Z"
  },
  {
    "title": "High precision to mass production: Inside Canon's Utsunomiya lens factory",
    "q": "high precision to mass production: inside canon's utsunomiya lens factory camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>High precision to mass production: Inside Canon's Utsunomiya lens factory</b><br>A cut-in half Canon EF 400mm F2.8L IS II lens from 2010, shown surrounded by all the components from which it's made, in the foyer of Canon's Utsunomiya factory. Photo: Richard Butler \"RF lenses are better,\" said Go Tokura, head of Canon's…<br><a href=\"https://www.dpreview.com/articles/6451344671/canon-factory-visit\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/6451344671/canon-factory-visit",
    "topic": "photo",
    "date": "2025-11-11T15:00:00.000Z"
  },
  {
    "title": "Panasonic axes Lumix Pro Services in Europe and the UK, US program unaffected",
    "q": "panasonic axes lumix pro services in europe and the uk, us program unaffected camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic axes Lumix Pro Services in Europe and the UK, US program unaffected</b><br>Image: Panasonic Panasonic Lumix Pro Services will be ending in eight European countries and the United Kingdom as of November 30, 2025. The company shared the news on the Lumix Pro support websites for each respective country, as reported…<br><a href=\"https://www.dpreview.com/news/7418938725/panasonic-axes-lumix-pro-services-in-europe-and-the-uk-us-program-unaffected\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7418938725/panasonic-axes-lumix-pro-services-in-europe-and-the-uk-us-program-unaffected",
    "topic": "photo",
    "date": "2025-11-10T18:59:00.000Z"
  },
  {
    "title": "Canon RF45 F1.2 STM sample gallery",
    "q": "canon rf45 f1.2 stm sample gallery camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon RF45 F1.2 STM sample gallery</b><br>When you use DPReview links to buy products, the site may earn a commission. Canon RF45 F.2 STM | F1.2 | 1/320 sec | ISO 100 Processed with Adobe Camera Raw, distortion profile applied, vignetting correction off Photo: Richard Butler The C…<br><a href=\"https://www.dpreview.com/samples/0202405840/canon-rf45-f1-2-stm-sample-gallery\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/samples/0202405840/canon-rf45-f1-2-stm-sample-gallery",
    "topic": "photo",
    "date": "2025-11-10T18:15:00.000Z"
  },
  {
    "title": " This gadget turns your smartphone photos into real instant film, and at $80, the price has never been lower ",
    "q": " this gadget turns your smartphone photos into real instant film, and at $80, the price has never been lower  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This gadget turns your smartphone photos into real instant film, and at $80, the price has never been lower </b><br>The Fujifilm Instax Mini Link 2 is one of my favorite photo accessories, and the price just dropped to an all-time low<br><a href=\"https://www.digitalcameraworld.com/cameras/instant-cameras/this-gadget-turns-your-smartphone-photos-into-real-instant-film-and-at-usd80-the-price-has-never-been-lower\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/instant-cameras/this-gadget-turns-your-smartphone-photos-into-real-instant-film-and-at-usd80-the-price-has-never-been-lower",
    "topic": "photo",
    "date": "2025-11-14T19:19:15.000Z"
  },
  {
    "title": " Trust me, these retro rolls of 35mm film are the gift every photographer would love to get this Christmas! ",
    "q": " trust me, these retro rolls of 35mm film are the gift every photographer would love to get this christmas!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Trust me, these retro rolls of 35mm film are the gift every photographer would love to get this Christmas! </b><br>Film is much more expensive than when I used to use it all the time –but getting a roll or two makes an affordable treat to indulge in analog photography<br><a href=\"https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/trust-me-these-retro-rolls-of-35mm-film-are-the-gift-every-photographer-would-love-to-get-this-christmas\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/gift-guides-and-seasonal-sales/trust-me-these-retro-rolls-of-35mm-film-are-the-gift-every-photographer-would-love-to-get-this-christmas",
    "topic": "photo",
    "date": "2025-11-14T19:16:39.000Z"
  },
  {
    "title": " Two companies just filed a patent infringement against Canon, alleging the camera maker’s WiFi tech originated from BlackBerry ",
    "q": " two companies just filed a patent infringement against canon, alleging the camera maker’s wifi tech originated from blackberry  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Two companies just filed a patent infringement against Canon, alleging the camera maker’s WiFi tech originated from BlackBerry </b><br>The lawsuit alleges that Canon's cameras and printers use wireless tech originally designed by BlackBerry<br><a href=\"https://www.digitalcameraworld.com/cameras/two-companies-just-filed-a-patent-infringement-against-canon-alleging-the-camera-makers-wifi-tech-originated-from-blackberry\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/two-companies-just-filed-a-patent-infringement-against-canon-alleging-the-camera-makers-wifi-tech-originated-from-blackberry",
    "topic": "photo",
    "date": "2025-11-14T17:46:42.000Z"
  },
  {
    "title": " This little all-rounder camera gets you everything you need to shoot straight away - and is now just $798 ",
    "q": " this little all-rounder camera gets you everything you need to shoot straight away - and is now just $798  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This little all-rounder camera gets you everything you need to shoot straight away - and is now just $798 </b><br>With this limited-time deal, you save $150 on the Sony A6100 with a versatile zoom lens – on top, you get a 64GB memory card and bag for FREE<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/this-little-all-rounder-camera-gets-you-everything-you-need-to-shoot-straight-away-and-is-now-just-usd798\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/this-little-all-rounder-camera-gets-you-everything-you-need-to-shoot-straight-away-and-is-now-just-usd798",
    "topic": "photo",
    "date": "2025-11-14T14:11:00.000Z"
  },
  {
    "title": " Should you bother with firmware? How good is Sigma's \"dream lens\"? How do you cure camera shake? Find out in Episode 4 of our Bokeh Face podcast! ",
    "q": " should you bother with firmware? how good is sigma's \"dream lens\"? how do you cure camera shake? find out in episode 4 of our bokeh face podcast!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Should you bother with firmware? How good is Sigma's \"dream lens\"? How do you cure camera shake? Find out in Episode 4 of our Bokeh Face podcast! </b><br>In the latest DCW podcast, James and Mike chat the pros and cons of firmware, Sigma's 300-600mm f/4 lens, and how to beat the blur!<br><a href=\"https://www.digitalcameraworld.com/cameras/dcw-podcast-bokeh-face-4-should-you-bother-with-camera-firmware-sigmas-super-telephoto-how-to-keep-your-shots-sharp\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/dcw-podcast-bokeh-face-4-should-you-bother-with-camera-firmware-sigmas-super-telephoto-how-to-keep-your-shots-sharp",
    "topic": "photo",
    "date": "2025-11-14T12:05:12.000Z"
  },
  {
    "title": " I used Nikon’s Focus Shift Shooting for the first time –here’s why I’ll think twice before focus stacking manually again  ",
    "q": " i used nikon’s focus shift shooting for the first time –here’s why i’ll think twice before focus stacking manually again   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I used Nikon’s Focus Shift Shooting for the first time –here’s why I’ll think twice before focus stacking manually again  </b><br>You can make focus stacking a breeze by automating the process using your Nikon camera’s Focus Shift Shooting function<br><a href=\"https://www.digitalcameraworld.com/photography/photo-technique/i-used-nikons-focus-shift-shooting-for-the-first-time-heres-why-ill-think-twice-before-focus-stacking-manually-again\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photo-technique/i-used-nikons-focus-shift-shooting-for-the-first-time-heres-why-ill-think-twice-before-focus-stacking-manually-again",
    "topic": "photo",
    "date": "2025-11-14T11:48:44.000Z"
  },
  {
    "title": " Despite heavy light pollution, this Nikon D780 and Tamron 24-70mm photo captures the Milky Way in astonishing detail ",
    "q": " despite heavy light pollution, this nikon d780 and tamron 24-70mm photo captures the milky way in astonishing detail  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Despite heavy light pollution, this Nikon D780 and Tamron 24-70mm photo captures the Milky Way in astonishing detail </b><br>Michael Steven Harris earned People's Choice at the British Photography Awards for this stacked, long-exposure image<br><a href=\"https://www.digitalcameraworld.com/photography/astrophotography/despite-heavy-light-pollution-this-nikon-d780-and-tamron-24-70mm-photo-captures-the-milky-way-in-astonishing-detail\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/astrophotography/despite-heavy-light-pollution-this-nikon-d780-and-tamron-24-70mm-photo-captures-the-milky-way-in-astonishing-detail",
    "topic": "photo",
    "date": "2025-11-14T11:07:18.000Z"
  },
  {
    "title": " This 61MP full-frame camera rivals medium-format resolution. Get the Sony A7R IVA, save $700 with FREE accessories in this limited-time offer ",
    "q": " this 61mp full-frame camera rivals medium-format resolution. get the sony a7r iva, save $700 with free accessories in this limited-time offer  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This 61MP full-frame camera rivals medium-format resolution. Get the Sony A7R IVA, save $700 with FREE accessories in this limited-time offer </b><br>The Sony A7R IVA has one of the highest resolutions you can get on a camera – now available for only $2,998, including 128GB SD card, extra battery and bag<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/save-usd700-on-this-61mp-full-frame-camera-get-the-sony-a7r-iva-and-free-accessories-with-this-limited-time-offer\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/save-usd700-on-this-61mp-full-frame-camera-get-the-sony-a7r-iva-and-free-accessories-with-this-limited-time-offer",
    "topic": "photo",
    "date": "2025-11-14T10:19:52.000Z"
  },
  {
    "title": "8-Bit vs 16-bit Images | A Visual Demonstration",
    "q": "8-bit vs 16-bit images | a visual demonstration camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>8-Bit vs 16-bit Images | A Visual Demonstration</b><br>Most photographrs have probably heard about 8-bit vs 16-bit images, yet not thought about it very much. Those are two very small numbers, and they’re not very far apart either! However, the truth involves some staggering numbers, that are …<br><a href=\"https://www.slrlounge.com/8-bit-vs-16-bit-images-a-visual-demonstration/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/8-bit-vs-16-bit-images-a-visual-demonstration/",
    "topic": "photo",
    "date": "2025-11-12T18:47:27.000Z"
  },
  {
    "title": "Catching The Surf | Movement & Serenity With John Lucarelli",
    "q": "catching the surf | movement & serenity with john lucarelli camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Catching The Surf | Movement & Serenity With John Lucarelli</b><br>Whichever side of whichever fence you’re on these days, it’s probably a fair assessment that peeking through the window of your living room, or a window on your computer, provides a view that’s a bit tumultuous. A bit dreary. A bit depress…<br><a href=\"https://www.slrlounge.com/catching-the-surf-movement-serenity-with-john-lucarelli/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/catching-the-surf-movement-serenity-with-john-lucarelli/",
    "topic": "photo",
    "date": "2025-11-11T18:36:26.000Z"
  },
  {
    "title": "Best Snipping Tool for Mac and PC",
    "q": "best snipping tool for mac and pc camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Snipping Tool for Mac and PC</b><br>As photographers, we constantly hone our skills to capture and edit epic portraits and landscapes, but we shouldn’t overlook another powerful genre: screenshots. It may sound silly, but it’s true. Whether we’re writing an email, designing …<br><a href=\"https://www.slrlounge.com/best-snipping-tools-for-mac-and-pc/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-snipping-tools-for-mac-and-pc/",
    "topic": "photo",
    "date": "2025-11-10T18:35:28.000Z"
  },
  {
    "title": "Best Tripod For Landscape Photography",
    "q": "best tripod for landscape photography camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Tripod For Landscape Photography</b><br>Is it possible to find a good tripod for landscape photography, without breaking the bank? Yes, it is.<br><a href=\"https://www.slrlounge.com/best-tripod-for-landscape-photography/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-tripod-for-landscape-photography/",
    "topic": "photo",
    "date": "2025-11-10T17:35:03.000Z"
  },
  {
    "title": "Where to Develop Film | The Best Labs for Film Photographers",
    "q": "where to develop film | the best labs for film photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Where to Develop Film | The Best Labs for Film Photographers</b><br>Here's to saving ourselves some time from running around town trying to look for a decent film lab. Throw those keys on the table, and grab your comfy office chair because all you have to do is put those rolls of film inside a mailer.<br><a href=\"https://www.slrlounge.com/where-to-develop-film/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/where-to-develop-film/",
    "topic": "photo",
    "date": "2025-11-09T18:25:26.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "SeeStar S50 captures deep space for Astro photography  newbies",
    "q": "seestar s50 captures deep space for astro photography  newbies camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>SeeStar S50 captures deep space for Astro photography  newbies</b><br>I fought the idea of photographing deep space objects such as Nebulas and Galaxies other than our own Milky Way. My friend, Larry Gunn suggested I dip my toe into the genre with a device called the SeeStar S50. A reasonably priced automate…<br><a href=\"https://photofocus.com/photography/seestar-s50-captures-deep-space-for-astro-photography-newbies/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/seestar-s50-captures-deep-space-for-astro-photography-newbies/",
    "topic": "photo",
    "date": "2025-11-12T20:51:20.000Z"
  },
  {
    "title": "Luminar Neo Fall Upgrade 2025 is here!",
    "q": "luminar neo fall upgrade 2025 is here! camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Luminar Neo Fall Upgrade 2025 is here!</b><br>Remember when Sky Replacement first arrived? It changed everything. Skylum didn’t just give photographers a new tool, it gave them freedom. Suddenly, anyone could transform an image without masking, layering, or hours of manual work. That …<br><a href=\"https://photofocus.com/news/luminar-neo-fall-upgrade-2025-is-here/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/luminar-neo-fall-upgrade-2025-is-here/",
    "topic": "photo",
    "date": "2025-11-11T23:27:21.000Z"
  },
  {
    "title": "Luminar Android 2.0 is here : Discover amazing new tools",
    "q": "luminar android 2.0 is here : discover amazing new tools camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Luminar Android 2.0 is here : Discover amazing new tools</b><br>Skylum, has teamed up with Google to unveil Luminar Photo Editor, now available for Android and ChromeOS. This launch brings Luminar’s powerful, intelligent editing capabilities to mobile and Chromebook users, offering a fresh, intuitive, …<br><a href=\"https://photofocus.com/news/luminar-android-2-0-is-here-discover-amazing-new-tools/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/luminar-android-2-0-is-here-discover-amazing-new-tools/",
    "topic": "photo",
    "date": "2025-11-11T23:14:46.000Z"
  },
  {
    "title": "Godox announces new iFlash iT32 – One System built for all",
    "q": "godox announces new iflash it32 – one system built for all camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Godox announces new iFlash iT32 – One System built for all</b><br>Meet the iT32 iFlash Camera Flash & X5 TTL Wireless Flash Trigger — a modular lighting system built for ultimate versatility and efficiency. When paired with different X5 versions, one iT32 flash body seamlessly adapts to Canon, Nikon, Son…<br><a href=\"https://photofocus.com/news/godox-announces-new-iflash-it32-one-system-built-for-all/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/godox-announces-new-iflash-it32-one-system-built-for-all/",
    "topic": "photo",
    "date": "2025-11-11T23:01:39.000Z"
  },
  {
    "title": "Save up to 33% off Thypoch Lenses",
    "q": "save up to 33% off thypoch lenses camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Save up to 33% off Thypoch Lenses</b><br>From November 11 to December 3, we offer up to 33% off on Thypoch photo lenses during the Black Friday sale. Please visit their website for more specials<br><a href=\"https://photofocus.com/deals/save-up-to-33-off-thypoch-lenses/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/deals/save-up-to-33-off-thypoch-lenses/",
    "topic": "photo",
    "date": "2025-11-10T20:00:00.000Z"
  },
  {
    "title": "Peak Design Every Day Case for Samsung S25+ and Creator Kit",
    "q": "peak design every day case for samsung s25+ and creator kit camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Every Day Case for Samsung S25+ and Creator Kit</b><br>When it comes to mobile photography, Peak Design continues to blur the lines between convenience, durability, and professional functionality. Their Everyday Case for the Samsung Galaxy S25+ and Creator Kit are designed for those of us who …<br><a href=\"https://photofocus.com/reviews/peak-design-every-day-case-for-samsung-s25-and-creator-kit/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/peak-design-every-day-case-for-samsung-s25-and-creator-kit/",
    "topic": "photo",
    "date": "2025-11-10T14:00:00.000Z"
  },
  {
    "title": "K&F CONCEPT RGB Portable LED Video Light – Compact Creative Power",
    "q": "k&f concept rgb portable led video light – compact creative power camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>K&F CONCEPT RGB Portable LED Video Light – Compact Creative Power</b><br>K&F CONCEPT has earned a strong reputation for creating high-quality yet affordable photography gear — from filters and tripods to lighting solutions. Their RGB Portable LED Video Light continues that trend, packing impressive performance …<br><a href=\"https://photofocus.com/reviews/kf-concept-rgb-portable-led-video-light-compact-creative-power/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/kf-concept-rgb-portable-led-video-light-compact-creative-power/",
    "topic": "photo",
    "date": "2025-11-09T14:00:00.000Z"
  },
  {
    "title": "Telesin Mini Fogger Review – Small but Mighty Magic",
    "q": "telesin mini fogger review – small but mighty magic camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Telesin Mini Fogger Review – Small but Mighty Magic</b><br>Every now and then, I stumble across a piece of gear I buy on a whim… and then wonder how I ever lived without it. The Telesin Mini Fogger (C40 Portable Fog Machine) is exactly that. I picked one up out of curiosity, and since then, I’ve p…<br><a href=\"https://photofocus.com/reviews/telesin-mini-fogger-review-small-but-mighty-magic/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/telesin-mini-fogger-review-small-but-mighty-magic/",
    "topic": "photo",
    "date": "2025-11-08T14:00:00.000Z"
  },
  {
    "title": "YouTube TV, ESPN, and Disney: the latest on the blackout that’s now over",
    "q": "youtube tv, espn, and disney: the latest on the blackout that’s now over windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>YouTube TV, ESPN, and Disney: the latest on the blackout that’s now over</b><br>Disney and YouTube have reached an agreement to bring back ESPN and more than 20 other Disney-owned channels two weeks after they went dark on YouTube TV. During the dispute, Google has accused Disney of trying to raise prices for its cust…<br><a href=\"https://www.theverge.com/news/817403/youtube-tv-disney-espn-blackout-updates\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/817403/youtube-tv-disney-espn-blackout-updates",
    "topic": "it",
    "date": "2025-11-15T01:19:23.000Z"
  },
  {
    "title": "Disney and ESPN are back on YouTube TV",
    "q": "disney and espn are back on youtube tv windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Disney and ESPN are back on YouTube TV</b><br>ESPN and other Disney-owned channels will be returning to YouTube TV following a new agreement announced Friday. More than 20 channels went dark on YouTube TV on October 30th, but two weeks later — and after CEOs Bob Iger and Sundar Pichai…<br><a href=\"https://www.theverge.com/news/821581/disney-youtube-tv-deal-agreement-espn\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/821581/disney-youtube-tv-deal-agreement-espn",
    "topic": "it",
    "date": "2025-11-15T01:10:19.000Z"
  },
  {
    "title": "The best early Black Friday deals we’ve found so far on laptops, TVs, and more",
    "q": "the best early black friday deals we’ve found so far on laptops, tvs, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best early Black Friday deals we’ve found so far on laptops, TVs, and more</b><br>The Amazon TV Stick 4K is down to $34.99 — its lowest price to date — for a limited time. | Photo: Antonio G. Di Benedetto / The Verge Black Friday is the most anticipated day of the year for bargain hunters. While there’s still some time …<br><a href=\"https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025",
    "topic": "it",
    "date": "2025-11-14T22:02:20.000Z"
  },
  {
    "title": "A recent Switch 2 update blocks some third-party docks, but Nintendo isn’t saying why",
    "q": "a recent switch 2 update blocks some third-party docks, but nintendo isn’t saying why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>A recent Switch 2 update blocks some third-party docks, but Nintendo isn’t saying why</b><br>Nintendo recently issued an update (21.0.0) for its Switch 2 console that, in addition to some small changes, has caused some third-party docks to stop working as intended. In the early weeks and months of the console’s availability this s…<br><a href=\"https://www.theverge.com/news/821250/switch-2-update-third-party-dock-update-blocked\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/821250/switch-2-update-third-party-dock-update-blocked",
    "topic": "it",
    "date": "2025-11-14T20:00:27.000Z"
  },
  {
    "title": "Fortnite is coming to the Xbox PC store",
    "q": "fortnite is coming to the xbox pc store windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Fortnite is coming to the Xbox PC store</b><br>Fortnite is going to be available on the Xbox on PC app beginning November 18th. Right now on PC, you have to launch the game from the Epic Games Launcher, but if you prefer the Xbox on PC app, that’s going to be an option. The game is als…<br><a href=\"https://www.theverge.com/news/821177/fortnite-xbox-on-pc-app-store-epic-games-play-anywhere-crew-game-pass\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/821177/fortnite-xbox-on-pc-app-store-epic-games-play-anywhere-crew-game-pass",
    "topic": "it",
    "date": "2025-11-14T18:37:18.000Z"
  },
  {
    "title": "Apple’s last-gen AirPods Pro 2 are down to their lowest price to date",
    "q": "apple’s last-gen airpods pro 2 are down to their lowest price to date windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Apple’s last-gen AirPods Pro 2 are down to their lowest price to date</b><br>Walmart on Friday officially kicked off its early Black Friday deals, with the first wave of discounts lasting from November 14th to November 16th. One of the best deals we’ve spotted is on the last-gen AirPods Pro 2 with USB-C charging ca…<br><a href=\"https://www.theverge.com/gadgets/821049/apple-airpods-pro-2-walmart-black-friday-deal-sale\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/821049/apple-airpods-pro-2-walmart-black-friday-deal-sale",
    "topic": "it",
    "date": "2025-11-14T16:42:27.000Z"
  },
  {
    "title": "Why we&#8217;re going to keep talking about the Trump phone",
    "q": "why we&#8217;re going to keep talking about the trump phone windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Why we&#8217;re going to keep talking about the Trump phone</b><br>For the past couple of weeks, I’ve been asking — repeatedly — where the promised Trump phone is, whether it exists, and what happened to all the money people have already paid for deposits. And I’m going to keep doing that every week for t…<br><a href=\"https://www.theverge.com/news/820887/why-we-keep-writing-about-trump-phone-t1\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/news/820887/why-we-keep-writing-about-trump-phone-t1",
    "topic": "it",
    "date": "2025-11-14T16:34:19.000Z"
  },
  {
    "title": " This is the only $1 VPN you should consider – and it just added free antivirus for Black Friday! ",
    "q": " this is the only $1 vpn you should consider – and it just added free antivirus for black friday!  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> This is the only $1 VPN you should consider – and it just added free antivirus for Black Friday! </b><br>There are few things better value than ultimate security for a dollar, right?<br><a href=\"https://www.techradar.com/vpn/vpn-services/this-is-the-only-usd1-vpn-you-should-consider-and-it-just-added-free-antivirus-for-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/vpn/vpn-services/this-is-the-only-usd1-vpn-you-should-consider-and-it-just-added-free-antivirus-for-black-friday",
    "topic": "it",
    "date": "2025-11-14T22:31:17.000Z"
  },
  {
    "title": " Apple AirPods 4 are down to their lowest-ever price in this early Black Friday deal ",
    "q": " apple airpods 4 are down to their lowest-ever price in this early black friday deal  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Apple AirPods 4 are down to their lowest-ever price in this early Black Friday deal </b><br>This is the cheapest these AirPods 4 have ever been on Amazon<br><a href=\"https://www.techradar.com/audio/earbuds-airpods/apple-airpods-4-are-down-to-their-lowest-ever-price-in-this-early-black-friday-deal\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/audio/earbuds-airpods/apple-airpods-4-are-down-to-their-lowest-ever-price-in-this-early-black-friday-deal",
    "topic": "it",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": " Microsoft to appeal ruling in favor of reselling perpetual Windows licenses — UK Competition Court says fineprint holds no ground as judges throw out company's 'creative work' argument ",
    "q": " microsoft to appeal ruling in favor of reselling perpetual windows licenses — uk competition court says fineprint holds no ground as judges throw out company's 'creative work' argument  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft to appeal ruling in favor of reselling perpetual Windows licenses — UK Competition Court says fineprint holds no ground as judges throw out company's 'creative work' argument </b><br>Microsoft has just been dealt a major legal blow as the UK Competition Appeal Tribunal has essentially declared that reselling perpetual licenses is perfectly fine. Microsoft's most recent claim argued that its products qualify for copyrig…<br><a href=\"https://www.tomshardware.com/tech-industry/big-tech/microsoft-to-appeal-ruling-in-favor-of-reselling-perpetual-windows-licenses-uk-competition-court-says-fineprint-holds-no-ground-as-judges-throw-out-companys-creative-work-argument\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/big-tech/microsoft-to-appeal-ruling-in-favor-of-reselling-perpetual-windows-licenses-uk-competition-court-says-fineprint-holds-no-ground-as-judges-throw-out-companys-creative-work-argument",
    "topic": "it",
    "date": "2025-11-14T15:52:32.000Z"
  },
  {
    "title": "I put AirTags on everything and this $18 deal makes them too good to pass up",
    "q": "i put airtags on everything and this $18 deal makes them too good to pass up windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I put AirTags on everything and this $18 deal makes them too good to pass up</b><br>The Apple AirTag just hit an all-time low price, making the perfect accessory to track your keys, wallets, and luggage during the holiday travel season even better.<br><a href=\"https://www.zdnet.com/article/i-put-airtags-on-everything-and-this-18-deal-makes-them-too-good-to-pass-up/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/i-put-airtags-on-everything-and-this-18-deal-makes-them-too-good-to-pass-up/",
    "topic": "it",
    "date": "2025-11-14T22:09:04.000Z"
  },
  {
    "title": "One of the best Apple Watches you can buy isn't Apple's newest (but it's 50% off)",
    "q": "one of the best apple watches you can buy isn't apple's newest (but it's 50% off) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>One of the best Apple Watches you can buy isn't Apple's newest (but it's 50% off)</b><br>The Apple Watch Series 10 might be last year's model, but its specs prove it's basically as capable as the Series 11. The main difference? It's $250 off.<br><a href=\"https://www.zdnet.com/article/one-of-the-best-apple-watches-you-can-buy-isnt-apples-newest-but-its-50-off/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/one-of-the-best-apple-watches-you-can-buy-isnt-apples-newest-but-its-50-off/",
    "topic": "it",
    "date": "2025-11-14T21:27:57.000Z"
  },
  {
    "title": "Best Black Friday smartwatch and fitness tracker deals 2025: Top sales out early",
    "q": "best black friday smartwatch and fitness tracker deals 2025: top sales out early windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Best Black Friday smartwatch and fitness tracker deals 2025: Top sales out early</b><br>Shop these top deals on fitness trackers, smartwatches, and more. Deals up to $250 off on new Apple Watches are already live.<br><a href=\"https://www.zdnet.com/article/best-black-friday-smartwatch-deals-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/best-black-friday-smartwatch-deals-2025/",
    "topic": "it",
    "date": "2025-11-14T21:24:50.000Z"
  },
  {
    "title": "Shop the best early Apple Watch deals for Black Friday 2025",
    "q": "shop the best early apple watch deals for black friday 2025 windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Shop the best early Apple Watch deals for Black Friday 2025</b><br>Shop these early Black Friday deals on last year's Apple Watch models and new models, including the $250 off Series 10 and $100 off Ultra 3.<br><a href=\"https://www.zdnet.com/article/best-early-black-friday-apple-watch-deals-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/best-early-black-friday-apple-watch-deals-2025/",
    "topic": "it",
    "date": "2025-11-14T21:17:47.000Z"
  },
  {
    "title": " Microsoft's biggest mobile regret: stunning Windows Astria concept shows how Windows Phone could have won with Fluent Design and Android apps ",
    "q": " microsoft's biggest mobile regret: stunning windows astria concept shows how windows phone could have won with fluent design and android apps  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft's biggest mobile regret: stunning Windows Astria concept shows how Windows Phone could have won with Fluent Design and Android apps </b><br>A visionary designer recently shared a stunning concept inspired by Microsoft's Windows Phone dubbed Windows Astria, which ships with Microsoft's modern Windows 11 Fluent Design language, Live Tiles, and future-proof UX.<br><a href=\"https://www.windowscentral.com/hardware/windows-phone/a-fan-project-called-windows-astria-resurrects-windows-phone-from-microsofts-graveyard-showing-off-what-the-os-could-have-been-while-reminding-us-why-it-still-inspires-tech-nostalgia-today\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/hardware/windows-phone/a-fan-project-called-windows-astria-resurrects-windows-phone-from-microsofts-graveyard-showing-off-what-the-os-could-have-been-while-reminding-us-why-it-still-inspires-tech-nostalgia-today",
    "topic": "it",
    "date": "2025-11-14T15:25:01.000Z"
  },
  {
    "title": " Don't pay full price again: Stack up to 5 years of Microsoft 365 access at a steep pre-Black Friday discount—up to 30% off Personal ",
    "q": " don't pay full price again: stack up to 5 years of microsoft 365 access at a steep pre-black friday discount—up to 30% off personal  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Don't pay full price again: Stack up to 5 years of Microsoft 365 access at a steep pre-Black Friday discount—up to 30% off Personal </b><br>Before Black Friday arrives, Microsoft 365. If you rely on Word, Excel, and OneDrive, now’s the time to lock in lower prices.<br><a href=\"https://www.windowscentral.com/microsoft/microsoft-office/before-buying-any-gadgets-this-black-friday-grab-this-microsoft-365-deal\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/microsoft/microsoft-office/before-buying-any-gadgets-this-black-friday-grab-this-microsoft-365-deal",
    "topic": "it",
    "date": "2025-11-14T13:11:01.000Z"
  },
  {
    "title": " Microsoft CEO Satya Nadella explains the AGI \"Winner's Curse\" and why the value in AI will ultimately be captured by the platform—not the frontier model ",
    "q": " microsoft ceo satya nadella explains the agi \"winner's curse\" and why the value in ai will ultimately be captured by the platform—not the frontier model  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft CEO Satya Nadella explains the AGI \"Winner's Curse\" and why the value in AI will ultimately be captured by the platform—not the frontier model </b><br>Microsoft's CEO, Satya Nadella, recently shared some interesting insights on AGI, but also claimed that the technology is still in its early innings.<br><a href=\"https://www.windowscentral.com/artificial-intelligence/microsoft-ceo-satya-nadella-thoughts-on-agi-winners-curse\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/artificial-intelligence/microsoft-ceo-satya-nadella-thoughts-on-agi-winners-curse",
    "topic": "it",
    "date": "2025-11-14T12:20:00.000Z"
  },
  {
    "title": " Microsoft drops NDAs and publishes Xbox Game Publishing Guide: a massive step toward a more open, Steam-like ecosystem for game developers ",
    "q": " microsoft drops ndas and publishes xbox game publishing guide: a massive step toward a more open, steam-like ecosystem for game developers  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Microsoft drops NDAs and publishes Xbox Game Publishing Guide: a massive step toward a more open, Steam-like ecosystem for game developers </b><br>Microsoft is taking a page from Steam! the Xbox Game Publishing Guide is now public, NDA-free, and accessible to everyone. this makes planning and launching games on Xbox consoles and PC easier than ever for indie developers.<br><a href=\"https://www.windowscentral.com/gaming/xbox/microsoft-just-took-a-big-step-towards-making-xbox-publishing-more-open-and-steam-like-heres-whats-new\" target=\"_blank\">Read more</a>",
    "link": "https://www.windowscentral.com/gaming/xbox/microsoft-just-took-a-big-step-towards-making-xbox-publishing-more-open-and-steam-like-heres-whats-new",
    "topic": "it",
    "date": "2025-11-14T04:23:58.000Z"
  },
  {
    "title": "ASUS warns of critical auth bypass flaw in DSL series routers",
    "q": "asus warns of critical auth bypass flaw in dsl series routers windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>ASUS warns of critical auth bypass flaw in DSL series routers</b><br>ASUS has released new firmware to patch a critical authentication bypass security flaw impacting several DSL series router models. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/asus-warns-of-critical-auth-bypass-flaw-in-dsl-series-routers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/asus-warns-of-critical-auth-bypass-flaw-in-dsl-series-routers/",
    "topic": "it",
    "date": "2025-11-14T09:52:37.000Z"
  },
  {
    "title": "DoorDash hit by new data breach in October exposing user information",
    "q": "doordash hit by new data breach in october exposing user information windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>DoorDash hit by new data breach in October exposing user information</b><br>DoorDash has disclosed a data breach that hit the food delivery platform this October. Beginning yesterday evening, DoorDash, which serves millions of customers across the U.S., Canada, Australia, and New Zealand, started emailing those im…<br><a href=\"https://www.bleepingcomputer.com/news/security/doordash-hit-by-new-data-breach-in-october-exposing-user-information/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/doordash-hit-by-new-data-breach-in-october-exposing-user-information/",
    "topic": "it",
    "date": "2025-11-14T04:38:44.000Z"
  },
  {
    "title": "3 obscure Windows programming apps to try this weekend",
    "q": "3 obscure windows programming apps to try this weekend windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>3 obscure Windows programming apps to try this weekend</b><br>Upgrade from Notepad and swap out your IDE.<br><a href=\"https://www.howtogeek.com/obscure-windows-programming-apps-to-try-this-weekend/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/obscure-windows-programming-apps-to-try-this-weekend/",
    "topic": "it",
    "date": "2025-11-14T23:58:27.000Z"
  },
  {
    "title": "Why I'm buying the Apple Magic Trackpad",
    "q": "why i'm buying the apple magic trackpad windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Why I'm buying the Apple Magic Trackpad</b><br>I'm starting to believe trackpads are better than mice.<br><a href=\"https://www.howtogeek.com/please-someone-stop-me-before-i-buy-this-150-trackpad/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/please-someone-stop-me-before-i-buy-this-150-trackpad/",
    "topic": "it",
    "date": "2025-11-14T19:30:22.000Z"
  },
  {
    "title": "Thunderbird 145 Mail arrives with long-awaited Exchange support",
    "q": "thunderbird 145 mail arrives with long-awaited exchange support windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Thunderbird 145 Mail arrives with long-awaited Exchange support</b><br>The open-source client finally plays nice with Microsoft.<br><a href=\"https://www.howtogeek.com/thunderbird-145-mail-arrives-with-long-awaited-exchange-support/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/thunderbird-145-mail-arrives-with-long-awaited-exchange-support/",
    "topic": "it",
    "date": "2025-11-14T18:42:32.000Z"
  },
  {
    "title": "Don’t buy the Steam Machine, here's how to build a better one",
    "q": "don’t buy the steam machine, here's how to build a better one windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Don’t buy the Steam Machine, here's how to build a better one</b><br>The best part is, you can get it into your hands right away.<br><a href=\"https://www.howtogeek.com/dont-buy-the-steam-machine-build-a-pc-clone-instead/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/dont-buy-the-steam-machine-build-a-pc-clone-instead/",
    "topic": "it",
    "date": "2025-11-14T18:30:22.000Z"
  },
  {
    "title": "Microsoft lost a court case after claiming that reselling its licenses \"infringed copyright\"",
    "q": "microsoft lost a court case after claiming that reselling its licenses \"infringed copyright\" windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft lost a court case after claiming that reselling its licenses \"infringed copyright\"</b><br><br><a href=\"https://www.xda-developers.com/microsoft-lost-a-court-case-after-claiming-that-reselling-its-licenses-infringed-copyright/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/microsoft-lost-a-court-case-after-claiming-that-reselling-its-licenses-infringed-copyright/",
    "topic": "it",
    "date": "2025-11-15T06:07:13.000Z"
  },
  {
    "title": "I'm finally switching to Windows 11, but not for the reason you think",
    "q": "i'm finally switching to windows 11, but not for the reason you think windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I'm finally switching to Windows 11, but not for the reason you think</b><br>Windows 10 has reached end of life, but that's not why I'm switching<br><a href=\"https://www.xda-developers.com/switching-to-windows-11-but-not-why-you-think/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/switching-to-windows-11-but-not-why-you-think/",
    "topic": "it",
    "date": "2025-11-15T01:00:17.000Z"
  }
]