[
  {
    "title": "How a 150MP Medium-Format Camera Preserves Japan’s Historic Manga",
    "q": "how a 150mp medium-format camera preserves japan’s historic manga camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>How a 150MP Medium-Format Camera Preserves Japan’s Historic Manga</b><br>For many, digital cameras are tools for creating art. However, in some very specialized applications, high-resolution digital cameras are used to preserve it. In Japan, Shueisha Manga-Art Heritage is using 150-megapixel Phase One medium-fo…<br><a href=\"https://petapixel.com/2025/11/30/how-a-150mp-medium-format-camera-preserves-japans-historic-manga/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/how-a-150mp-medium-format-camera-preserves-japans-historic-manga/",
    "topic": "photo",
    "date": "2025-11-30T19:00:51.000Z"
  },
  {
    "title": "First-of-Its-Kind Exhibition Explores Photography’s Role in the Black Arts Movement",
    "q": "first-of-its-kind exhibition explores photography’s role in the black arts movement camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>First-of-Its-Kind Exhibition Explores Photography’s Role in the Black Arts Movement</b><br>The National Gallery of Art in Washington, D.C., is presenting the first exhibition to explore photography’s impact on a cultural and aesthetic movement that celebrated Black history, identity, and beauty. [Read More]<br><a href=\"https://petapixel.com/2025/11/30/first-of-its-kind-exhibition-explores-photographys-role-in-the-black-arts-movement/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/first-of-its-kind-exhibition-explores-photographys-role-in-the-black-arts-movement/",
    "topic": "photo",
    "date": "2025-11-30T19:00:23.000Z"
  },
  {
    "title": "Only Known Photos of Hamburg’s Jewish Deportation Discovered in Secret Album",
    "q": "only known photos of hamburg’s jewish deportation discovered in secret album camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Only Known Photos of Hamburg’s Jewish Deportation Discovered in Secret Album</b><br>The only known photographs of the deportation of the Jewish population in the German city of Hamburg have been discovered in a German police officer's secret photo album. [Read More]<br><a href=\"https://petapixel.com/2025/11/30/only-known-photos-of-hamburgs-jewish-deportation-discovered-in-secret-album/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/30/only-known-photos-of-hamburgs-jewish-deportation-discovered-in-secret-album/",
    "topic": "photo",
    "date": "2025-11-30T14:00:48.000Z"
  },
  {
    "title": "Legendary War Photographer Says His Negatives Have Been Taken From Him",
    "q": "legendary war photographer says his negatives have been taken from him camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Legendary War Photographer Says His Negatives Have Been Taken From Him</b><br>Legendary war photographer Al Rockoff -- who was immortalized in the classic movie The Killing Fields -- has claimed that his historic negatives were taken from him against his will in a bitter dispute. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/legendary-war-photographer-says-his-negatives-have-been-taken-from-him/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/legendary-war-photographer-says-his-negatives-have-been-taken-from-him/",
    "topic": "photo",
    "date": "2025-11-29T19:00:03.000Z"
  },
  {
    "title": "18 Gift Ideas for Photographers for All Budgets",
    "q": "18 gift ideas for photographers for all budgets camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>18 Gift Ideas for Photographers for All Budgets</b><br>The holiday season is not far off, and photographers may be thinking about what they want as a gift. Here are some gift ideas for photographers of all levels of experience and budgets. [Read More]<br><a href=\"https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/18-gift-ideas-for-photographers-for-all-budgets/",
    "topic": "photo",
    "date": "2025-11-29T18:00:37.000Z"
  },
  {
    "title": "Camp Snap 8 (CS-8) Review: Pretty But Preposterous",
    "q": "camp snap 8 (cs-8) review: pretty but preposterous camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Camp Snap 8 (CS-8) Review: Pretty But Preposterous</b><br>The original Camp Snap camera was released a while back and became an unexpected hit. This digital camera was extremely limited and lacked an LCD screen in an attempt to bring the fun back to photography. Now Camp Snap is bringing this phi…<br><a href=\"https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/camp-snap-8-cs-8-review-pretty-but-preposterous/",
    "topic": "photo",
    "date": "2025-11-29T15:01:05.000Z"
  },
  {
    "title": "113 Years Ago, the US Tried to Outlaw Fake Photographs",
    "q": "113 years ago, the us tried to outlaw fake photographs camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>113 Years Ago, the US Tried to Outlaw Fake Photographs</b><br>It’s easy to imagine that anxiety over manipulated images began with Photoshop or AI, but photographers have been wrestling with the problem almost since the birth of the medium. More than a century ago (113 years back to be exact), the U.…<br><a href=\"https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/29/113-years-ago-the-us-tried-to-outlaw-fake-photographs/",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "This New Astrophotography Camera Has a 44MP Full-Frame Sensor",
    "q": "this new astrophotography camera has a 44mp full-frame sensor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>This New Astrophotography Camera Has a 44MP Full-Frame Sensor</b><br>ZWO has announced a new 44-megapixel full-frame camera designed specifically for astrophotography, and its specs are impressive. [Read More]<br><a href=\"https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/this-new-astrophotography-camera-has-a-44mp-full-frame-sensor/",
    "topic": "photo",
    "date": "2025-11-28T22:03:46.000Z"
  },
  {
    "title": "The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’",
    "q": "the five most shocking claims made by netflix’s ‘the stringer’ camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Five Most Shocking Claims Made by Netflix’s ‘The Stringer’</b><br>Finally the day has come: The Stringer: The Man Who Took the Photo, a film about who really took the famous Napalm Girl photo during the Vietnam War, has dropped on Netflix meaning anyone with a subscription can now see what the fuss is al…<br><a href=\"https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/\" target=\"_blank\">Read more</a>",
    "link": "https://petapixel.com/2025/11/28/the-five-most-shocking-claims-made-by-netflixs-the-stringer/",
    "topic": "photo",
    "date": "2025-11-28T22:00:20.000Z"
  },
  {
    "title": "Compact camera bonanza: 20 standout shots from our November Editors' photo challenge",
    "q": "compact camera bonanza: 20 standout shots from our november editors' photo challenge camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Compact camera bonanza: 20 standout shots from our November Editors' photo challenge</b><br>The October Editors' photo challenge The theme for our November Editor's photo challenge was \"Compact Camera Bonanza.\" For this challenge, we asked you to share photos taken with compact, or fixed-lens, cameras, and wow, did you deliver! W…<br><a href=\"https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/5126443926/20-standout-shots-from-november--editors-challenge",
    "topic": "photo",
    "date": "2025-11-30T14:00:00.000Z"
  },
  {
    "title": "Do you need to learn Manual mode right away?",
    "q": "do you need to learn manual mode right away? camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Do you need to learn Manual mode right away?</b><br>Photo: Abby Ferguson If you're a beginner photographer who spends any time on the internet, chances are you've been bombarded with content saying that you need to learn Manual mode immediately. It's a frequent refrain that \"real\" photograp…<br><a href=\"https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/7404509305/do-you-need-to-learn-manual-mode-right-away",
    "topic": "photo",
    "date": "2025-11-29T14:00:00.000Z"
  },
  {
    "title": "Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)",
    "q": "nikon 24-70mm f2.8 s ii samples and impressions: z-mount's new standard (zoom) camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Nikon 24-70mm F2.8 S II samples and impressions: Z-mount's new standard (zoom)</b><br>When you use DPReview links to buy products, the site may earn a commission. Product photos: Mitchell Clark We've had the chance to spend some time with Nikon's updated 24-70mm F2.8 S II, which was announced earlier this year. It's an upda…<br><a href=\"https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8068855135/nikon-nikkor-z-24-70-f2p8-s-ii-samples-impressions-quality",
    "topic": "photo",
    "date": "2025-11-28T14:00:00.000Z"
  },
  {
    "title": "Holy cow, there are actually good deals this Black Friday",
    "q": "holy cow, there are actually good deals this black friday camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Holy cow, there are actually good deals this Black Friday</b><br>Images: Nikon, Viltrox and Peak Design The start of the holiday shopping season is upon us, with Black Friday and Cyber Monday deals kicking off. In years past, deals on photography-related equipment, especially cameras and lenses, were ra…<br><a href=\"https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/0474781396/2025-black-friday-cyber-monday-deals",
    "topic": "photo",
    "date": "2025-11-27T14:00:00.000Z"
  },
  {
    "title": "Panasonic S1II review: improved AF completes breakthrough hybrid",
    "q": "panasonic s1ii review: improved af completes breakthrough hybrid camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic S1II review: improved AF completes breakthrough hybrid</b><br>When you use DPReview links to buy products, the site may earn a commission. Editor's note: This review is based on Panasonic's November 2025 v1.2 firmware update for the S1II, which was provided to DPReview ahead of its public release. 91…<br><a href=\"https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/reviews/panasonic-lumix-dc-s1ii-review",
    "topic": "photo",
    "date": "2025-11-26T16:10:00.000Z"
  },
  {
    "title": "The best (and worst) photo gifts DPReview readers have ever received",
    "q": "the best (and worst) photo gifts dpreview readers have ever received camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The best (and worst) photo gifts DPReview readers have ever received</b><br>Photo: DuckShots We are officially entering the season of gift-giving, so it's only fitting that our most recent community-based Question of the Week was focused on presents. Last week, we asked you all what the best and worst photograph-r…<br><a href=\"https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/8757603261/qotw-the-best-and-worst-photo-gifts-dpreview-readers-have-ever-received",
    "topic": "photo",
    "date": "2025-11-26T14:00:00.000Z"
  },
  {
    "title": "Venus Optics brings tilt-shift movements to close-up and product shooters",
    "q": "venus optics brings tilt-shift movements to close-up and product shooters camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Venus Optics brings tilt-shift movements to close-up and product shooters</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Laowa Venus Optics is expanding its tilt-shift lens lineup with the 35mm F2.8 Zero-D Tilt-Shift 0.5x Macro lens. The new manual focus offering is designed …<br><a href=\"https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/9255458376/laowa-35mm-f2p8-tilt-shift-macro-lens-announcement",
    "topic": "photo",
    "date": "2025-11-25T15:38:00.000Z"
  },
  {
    "title": "Canon EOS R6 III: plenty of detail and no nasty surprises",
    "q": "canon eos r6 iii: plenty of detail and no nasty surprises camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Canon EOS R6 III: plenty of detail and no nasty surprises</b><br>When you use DPReview links to buy products, the site may earn a commission. The Canon EOS R6 III promises 33MP resolution and decently fast readout speeds from an FSI CMOS sensor. Photo: Mitchell Clark We've received a production standard…<br><a href=\"https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/articles/3976049315/canon-eos-r6-iii-studio-scene-published",
    "topic": "photo",
    "date": "2025-11-25T15:00:00.000Z"
  },
  {
    "title": "Panasonic's Lumix S-series gets focused: new firmware promises better tracking",
    "q": "panasonic's lumix s-series gets focused: new firmware promises better tracking camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Panasonic's Lumix S-series gets focused: new firmware promises better tracking</b><br>When you use DPReview links to buy products, the site may earn a commission. Image: Panasonic Panasonic has announced new firmware for its Lumix S1RII (Ver. 1.3), S1II (Ver. 1.2 ) and S1IIE (Ver. 1.2) cameras. The updated firmware promises…<br><a href=\"https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/7913556475/panasonic-s-lumix-s-series-gets-focused-new-firmware-promises-better-subject-tracking",
    "topic": "photo",
    "date": "2025-11-25T14:00:00.000Z"
  },
  {
    "title": "Update: New film compact features a glass lens and Kodak-branding for $99",
    "q": "update: new film compact features a glass lens and kodak-branding for $99 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Update: New film compact features a glass lens and Kodak-branding for $99</b><br>Image: Reto Productions *This story has been updated with pricing, availability and additional details. The Kodak name has been in the news a fair amount lately, and now a new film camera featuring the brand has been released. Kodak brand …<br><a href=\"https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser\" target=\"_blank\">Read more</a>",
    "link": "https://www.dpreview.com/news/6205201912/kodak-branded-reto-snapic-a1-film-camera-teaser",
    "topic": "photo",
    "date": "2025-11-24T18:26:00.000Z"
  },
  {
    "title": " This super-quick editing hack transforms my travel photos into magical movie moments ",
    "q": " this super-quick editing hack transforms my travel photos into magical movie moments  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This super-quick editing hack transforms my travel photos into magical movie moments </b><br>Canon pro Peter Travers shares his secret to creating more atmospheric scenic photos with cinematic widescreen cropping<br><a href=\"https://www.digitalcameraworld.com/photography/composition/this-super-quick-editing-hack-transforms-my-travel-photos-into-magical-movie-moments\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/composition/this-super-quick-editing-hack-transforms-my-travel-photos-into-magical-movie-moments",
    "topic": "photo",
    "date": "2025-11-30T22:18:00.000Z"
  },
  {
    "title": " This autofocus feature on my mirrorless camera has been a game changer – now I rarely miss the moment! ",
    "q": " this autofocus feature on my mirrorless camera has been a game changer – now i rarely miss the moment!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This autofocus feature on my mirrorless camera has been a game changer – now I rarely miss the moment! </b><br>Heard pros talk about back-button autofocus? Here's how you can push it even further with modern mirrorless cameras<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/this-autofocus-feature-on-my-mirrorless-camera-has-been-a-game-changer-now-i-rarely-miss-the-moment\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/this-autofocus-feature-on-my-mirrorless-camera-has-been-a-game-changer-now-i-rarely-miss-the-moment",
    "topic": "photo",
    "date": "2025-11-30T19:17:00.000Z"
  },
  {
    "title": " Blue skies aren’t always good news for landscape photographers –but I’ve got this classic quick fix ",
    "q": " blue skies aren’t always good news for landscape photographers –but i’ve got this classic quick fix  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Blue skies aren’t always good news for landscape photographers –but I’ve got this classic quick fix </b><br>I created timeless travel photos by transforming iconic American destinations with black-and-white conversions<br><a href=\"https://www.digitalcameraworld.com/photography/photo-technique/blue-skies-arent-always-good-news-for-landscape-photographers-but-ive-got-this-classic-quick-fix\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/photo-technique/blue-skies-arent-always-good-news-for-landscape-photographers-but-ive-got-this-classic-quick-fix",
    "topic": "photo",
    "date": "2025-11-30T16:21:00.000Z"
  },
  {
    "title": " OMG! I wish the Canon EOS R5 had been this cheap when I bought it - it's now dropped to just £2,529  ",
    "q": " omg! i wish the canon eos r5 had been this cheap when i bought it - it's now dropped to just £2,529   camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> OMG! I wish the Canon EOS R5 had been this cheap when I bought it - it's now dropped to just £2,529  </b><br>£2,769 for the Canon EOS R5! I wish this full-frame mirrorless camera had been so cheap when I bought it!<br><a href=\"https://www.digitalcameraworld.com/cameras/mirrorless-cameras/omg-i-wish-the-canon-eos-r5-had-been-this-cheap-when-i-bought-it-its-now-dropped-to-just-gbp2-529\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/mirrorless-cameras/omg-i-wish-the-canon-eos-r5-had-been-this-cheap-when-i-bought-it-its-now-dropped-to-just-gbp2-529",
    "topic": "photo",
    "date": "2025-11-30T14:58:20.000Z"
  },
  {
    "title": " It doesn't bother me that Canon's RF 45mm f/1.2 lens doesn't have a red ring –this is why it's no problem ",
    "q": " it doesn't bother me that canon's rf 45mm f/1.2 lens doesn't have a red ring –this is why it's no problem  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> It doesn't bother me that Canon's RF 45mm f/1.2 lens doesn't have a red ring –this is why it's no problem </b><br>Have I pined for L-series quality from my RF 35mm f/1.8? Absolutely not! Here's why you shouldn't worry about the Canon RF 45mm f/1.2<br><a href=\"https://www.digitalcameraworld.com/cameras/lenses/i-own-canons-rf-35mm-f-1-8-and-it-doesnt-bother-me-that-the-new-45mm-f-1-2-doesnt-have-a-red-ring\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/lenses/i-own-canons-rf-35mm-f-1-8-and-it-doesnt-bother-me-that-the-new-45mm-f-1-2-doesnt-have-a-red-ring",
    "topic": "photo",
    "date": "2025-11-30T13:22:00.000Z"
  },
  {
    "title": " This ‘Rising Star’ award might change your photographic career (or at least your relationship with broccoli) ",
    "q": " this ‘rising star’ award might change your photographic career (or at least your relationship with broccoli)  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> This ‘Rising Star’ award might change your photographic career (or at least your relationship with broccoli) </b><br>If you've ever spent half an afternoon coaxing a sprig of coriander to flutter just so, there’s a new award with your name all over it.<br><a href=\"https://www.digitalcameraworld.com/photography/food-photography/this-rising-star-award-might-change-your-photographic-career-or-at-least-your-relationship-with-broccoli\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/food-photography/this-rising-star-award-might-change-your-photographic-career-or-at-least-your-relationship-with-broccoli",
    "topic": "photo",
    "date": "2025-11-30T12:00:00.000Z"
  },
  {
    "title": " Find Your Frame: A Street Photography Masterclass by Craig Whitehead review ",
    "q": " find your frame: a street photography masterclass by craig whitehead review  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Find Your Frame: A Street Photography Masterclass by Craig Whitehead review </b><br>A concise, well-structured book packed with practical advice and clear examples; an ideal starting point for anyone wanting to improve their street photography.<br><a href=\"https://www.digitalcameraworld.com/photography/books/find-your-frame-a-street-photography-masterclass-by-craig-whitehead-review\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/photography/books/find-your-frame-a-street-photography-masterclass-by-craig-whitehead-review",
    "topic": "photo",
    "date": "2025-11-30T10:00:00.000Z"
  },
  {
    "title": " Kodak didn’t want you to see this and kept this revolutionary camera secret for 25 years ",
    "q": " kodak didn’t want you to see this and kept this revolutionary camera secret for 25 years  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> Kodak didn’t want you to see this and kept this revolutionary camera secret for 25 years </b><br>Classic Cameras #13: The 24-year-old engineer who built the first digital camera that weighed eight pounds and ran on 16x AA batteries:<br><a href=\"https://www.digitalcameraworld.com/cameras/digital-cameras/kodak-didnt-want-you-to-see-this-and-kept-this-revolutionary-camera-secret-for-25-years\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/digital-cameras/kodak-didnt-want-you-to-see-this-and-kept-this-revolutionary-camera-secret-for-25-years",
    "topic": "photo",
    "date": "2025-11-30T09:56:22.000Z"
  },
  {
    "title": " I will NEVER sell these 10 cameras from my collection! ",
    "q": " i will never sell these 10 cameras from my collection!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> I will NEVER sell these 10 cameras from my collection! </b><br>I just sold $3,000 worth of cameras to free up some space –but these 10 cameras are going to stay on my shelf forever<br><a href=\"https://www.digitalcameraworld.com/cameras/digital-cameras/i-will-never-sell-these-10-cameras-from-my-collection\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/digital-cameras/i-will-never-sell-these-10-cameras-from-my-collection",
    "topic": "photo",
    "date": "2025-11-30T07:18:00.000Z"
  },
  {
    "title": " We love this viral retro compact camera so much, we featured it on our podcast –and now it's cheaper than ever! ",
    "q": " we love this viral retro compact camera so much, we featured it on our podcast –and now it's cheaper than ever!  camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b> We love this viral retro compact camera so much, we featured it on our podcast –and now it's cheaper than ever! </b><br>The Chuzhao TLR retro compact camera has been a hot seller since it came out –and not only is it back in stock, it's at a bargain price<br><a href=\"https://www.digitalcameraworld.com/cameras/compact-cameras/we-love-this-viral-retro-compact-camera-so-much-we-featured-it-on-our-podcast-and-now-its-cheaper-than-ever\" target=\"_blank\">Read more</a>",
    "link": "https://www.digitalcameraworld.com/cameras/compact-cameras/we-love-this-viral-retro-compact-camera-so-much-we-featured-it-on-our-podcast-and-now-its-cheaper-than-ever",
    "topic": "photo",
    "date": "2025-11-30T06:15:44.000Z"
  },
  {
    "title": "Fall Children’s Portrait Photography Tutorial",
    "q": "fall children’s portrait photography tutorial camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Fall Children’s Portrait Photography Tutorial</b><br>We're going to create a rich, Autumn-toned portrait, from start to finish.<br><a href=\"https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/how-to-create-rich-moody-autumn-portraits/",
    "topic": "photo",
    "date": "2025-11-30T06:06:28.000Z"
  },
  {
    "title": "Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users",
    "q": "aftershoot launches black friday promotion with 20% off annual plans and free ai retouching for pro users camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Aftershoot Launches Black Friday Promotion With 20% Off Annual Plans and Free AI Retouching for Pro Users</b><br>Aftershoot has announced its biggest promotion of the year just in time for Black Friday, offering photographers a streamlined way to cut down their post-processing time. The limited-time deal includes 20% off all annual plans, plus six mo…<br><a href=\"https://www.slrlounge.com/aftershoot-black-friday-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/aftershoot-black-friday-2025/",
    "topic": "photo",
    "date": "2025-11-28T13:00:28.000Z"
  },
  {
    "title": "Profoto Announces Black Friday Savings on Lighting Gear and Accessories",
    "q": "profoto announces black friday savings on lighting gear and accessories camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Profoto Announces Black Friday Savings on Lighting Gear and Accessories</b><br>Profoto has kicked off its Black Friday season with a lineup of discounts on some of its most popular portable flashes, location lights, and light-shaping tools. The offers span the A-Series, B-Series, and the company’s full umbrella lineu…<br><a href=\"https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/profoto-announces-black-friday-savings-on-lighting-gear-and-accessories/",
    "topic": "photo",
    "date": "2025-11-28T13:00:26.000Z"
  },
  {
    "title": "Best Memory Cards for Photographers",
    "q": "best memory cards for photographers camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Best Memory Cards for Photographers</b><br>People tend to focus more on cameras and lenses when discussing camera gear. Those are exciting, fun purchases! However, once a new photographer find themselves out taking photos, the next piece of gear takes center stage, and becomes infi…<br><a href=\"https://www.slrlounge.com/best-memory-cards-for-photographers/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/best-memory-cards-for-photographers/",
    "topic": "photo",
    "date": "2025-11-26T23:41:26.000Z"
  },
  {
    "title": "TourBox Elite Plus Review | A Versatile New Creative Controller",
    "q": "tourbox elite plus review | a versatile new creative controller camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>TourBox Elite Plus Review | A Versatile New Creative Controller</b><br>Over the last few years, we’ve seen an explosion of various innovations that streamline creative workflows. From photographers and illustrators to video editors and animators, everyone is looking for this combination: speed and precision. …<br><a href=\"https://www.slrlounge.com/tourbox-elite-plus-review/\" target=\"_blank\">Read more</a>",
    "link": "https://www.slrlounge.com/tourbox-elite-plus-review/",
    "topic": "photo",
    "date": "2025-11-26T16:00:00.000Z"
  },
  {
    "title": "Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod",
    "q": "review: neewer litetrip lt38 carbon fiber travel tripod camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Review: Neewer LiteTrip LT38 Carbon Fiber Travel Tripod</b><br>The Neewer LiteTrip LT38 Carbon Fiber Travel Tripod is a lightweight travel tripod that has a small diameter when folded up. We tested it in the field to determine its sturdiness and ease of use. Note: NEEWER sent us the LT38 Carbon Fiber …<br><a href=\"https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/review-neewer-litetrip-lt38-carbon-fiber-travel-tripod/",
    "topic": "photo",
    "date": "2025-11-27T17:00:00.000Z"
  },
  {
    "title": "Huion Kamvas Slate 11 Review – Creativity Unplugged",
    "q": "huion kamvas slate 11 review – creativity unplugged camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Huion Kamvas Slate 11 Review – Creativity Unplugged</b><br>Looking for a powerful, portable way to create on the go? The Huion Kamvas Slate 11 might just be your new best friend. This sleek, standalone Android 14 tablet is designed for artists who want the freedom to sketch, paint, edit, read, and…<br><a href=\"https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/huion-kamvas-slate-11-review-creativity-unplugged/",
    "topic": "photo",
    "date": "2025-11-24T20:00:00.000Z"
  },
  {
    "title": "Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger",
    "q": "mastering two-light setups with the neewer q6 strobes and qz trigger camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Mastering Two-Light Setups with the Neewer Q6 Strobes and QZ Trigger</b><br>Lighting is the backbone of portrait photography. While you can create beautiful images with just one strobe, adding a second light opens up a world of creative control and polish. With my Neewer Q6 strobes paired with the QZ trigger, I ca…<br><a href=\"https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/mastering-two-light-setups-with-the-neewer-q6-strobes-and-qz-trigger/",
    "topic": "photo",
    "date": "2025-11-22T20:00:00.000Z"
  },
  {
    "title": "The Art of SEEING Light",
    "q": "the art of seeing light camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>The Art of SEEING Light</b><br>Lighting can be one of the most confusing parts of photography, but once you learn to see the light, everything changes. In this video, I’ll show you how to understand and recognise what your light is doing so you can take control instead …<br><a href=\"https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/lighting-photography/the-art-of-seeing-light/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Neewer CB300C COB Light: Set your lighting free",
    "q": "neewer cb300c cob light: set your lighting free camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Neewer CB300C COB Light: Set your lighting free</b><br>Looking for some powerful lighting for photography and video in the studio? Then look no further than the new Neewer CB300C COB Light. Constant lighting has really jumped forwards in leaps and bounds of late, to the point I rarely use my s…<br><a href=\"https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/neewer-cb300c-cob-light-set-your-lighting-free/",
    "topic": "photo",
    "date": "2025-11-22T14:00:00.000Z"
  },
  {
    "title": "Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods",
    "q": "peak design teams up with jimmy chin to launch a new standard in tripods camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Peak Design Teams Up With Jimmy Chin to Launch a New Standard in Tripods</b><br>Peak Design has unveiled the Pro Tripod, a completely reengineered system created with input from adventure photographer and filmmaker Jimmy Chin. The goal was simple: build a tripod that can keep up with demanding shooters while staying e…<br><a href=\"https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/peak-design-teams-up-with-jimmy-chin-to-launch-a-new-standard-in-tripods/",
    "topic": "photo",
    "date": "2025-11-20T20:00:00.000Z"
  },
  {
    "title": "iSteady V3 Ultra: Tiny gimbal with giant features",
    "q": "isteady v3 ultra: tiny gimbal with giant features camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>iSteady V3 Ultra: Tiny gimbal with giant features</b><br>Camera phones are all the rage for creating short-form videos, making a compact gimbal a must-have. The Hohem iSteady V3 Ultra is that must-have. Smartphone gimbals have been around quite a while. I’ve never seen one with so many features …<br><a href=\"https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/reviews/isteady-v3-ultra-tiny-gimbal-with-giant-features/",
    "topic": "photo",
    "date": "2025-11-18T20:00:00.000Z"
  },
  {
    "title": "Adobe MAX Sneaks 2025",
    "q": "adobe max sneaks 2025 camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Adobe MAX Sneaks 2025</b><br>At every MAX event, Adobe has a sneak peek session. It is the standing-room-only show that everyone loves. Here is what might be coming to a future version of Photoshop… Project Surface Swap Project Surface Swap utilizes AI-powered texture…<br><a href=\"https://photofocus.com/news/adobe-max-sneaks-2025/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/news/adobe-max-sneaks-2025/",
    "topic": "photo",
    "date": "2025-11-17T22:35:54.000Z"
  },
  {
    "title": "Work the Subject – A Leaf",
    "q": "work the subject – a leaf camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Work the Subject – A Leaf</b><br>It’s fall and that makes for many and varied targets for your photography. When you are out and about it’s a good idea to keep a sharp eye out. Sometimes the simplest thing can lead to a lovely image. Or, at least I think so! The Leaf Look…<br><a href=\"https://photofocus.com/photography/work-the-subject-a-leaf/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/work-the-subject-a-leaf/",
    "topic": "photo",
    "date": "2025-11-15T14:00:00.000Z"
  },
  {
    "title": "Photographing Art on the Floor",
    "q": "photographing art on the floor camera cameras lens lenses mirrorless dslr sensor megapixel iso shutter aperture bokeh photo photography light lighting flash studio portrait landscape review specs price release firmware raw",
    "a": "<b>Photographing Art on the Floor</b><br>Especially for photographers that have small spaces here’s an idea for being able to photograph art for reproduction. Here’s a technique I use for smaller pieces and for art that has no hangers. Set up First thing that is needed for this s…<br><a href=\"https://photofocus.com/photography/photographing-art-on-the-floor/\" target=\"_blank\">Read more</a>",
    "link": "https://photofocus.com/photography/photographing-art-on-the-floor/",
    "topic": "photo",
    "date": "2025-11-14T20:00:00.000Z"
  },
  {
    "title": "Anker’s Laptop Power Bank is  $32 off for Cyber Monday, its biggest discount yet",
    "q": "anker’s laptop power bank is  $32 off for cyber monday, its biggest discount yet windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Anker’s Laptop Power Bank is  $32 off for Cyber Monday, its biggest discount yet</b><br>Anker’s portable charger is about the size of a soda can and can charge multiple devices for less than $90. If you’re planning to head out of town for the holidays, now is a good time to stock up on chargers so that your devices don’t die …<br><a href=\"https://www.theverge.com/gadgets/834269/anker-laptop-power-bank-cyber-monday-deal-sale-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834269/anker-laptop-power-bank-cyber-monday-deal-sale-2025",
    "topic": "it",
    "date": "2025-12-01T00:53:23.000Z"
  },
  {
    "title": "The absolute best Cyber Monday deals you can already shop",
    "q": "the absolute best cyber monday deals you can already shop windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The absolute best Cyber Monday deals you can already shop</b><br>Black Friday is over, but the deals haven’t simply evaporated. As we turn our attention to Cyber Monday, many of our favorite deals are still holding strong. That means you have another chance to save if you’ve been too preoccupied with ho…<br><a href=\"https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025",
    "topic": "it",
    "date": "2025-12-01T00:05:43.000Z"
  },
  {
    "title": "Our favorite laptops from Apple, Razer, HP, and others are over $500 for Cyber Monday",
    "q": "our favorite laptops from apple, razer, hp, and others are over $500 for cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Our favorite laptops from Apple, Razer, HP, and others are over $500 for Cyber Monday</b><br>The M5-powered MacBook Pro is slightly cheaper than it was on Black Friday. Cyber Monday might be a great opportunity to pick up a new TV, but it’s also one of the best chances you’ll have all year to save on one of the biggest tech purcha…<br><a href=\"https://www.theverge.com/gadgets/828617/best-black-friday-laptop-deals-macbook-surface-gaming-notebooks-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/828617/best-black-friday-laptop-deals-macbook-surface-gaming-notebooks-2025",
    "topic": "it",
    "date": "2025-11-30T23:43:02.000Z"
  },
  {
    "title": "My favorite Cyber Monday TV deals from Samsung, Sony, and others are up to 50% off",
    "q": "my favorite cyber monday tv deals from samsung, sony, and others are up to 50% off windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>My favorite Cyber Monday TV deals from Samsung, Sony, and others are up to 50% off</b><br>Black Friday might have passed, but that doesn’t mean the holiday deals are gone. You can still find low prices on excellent TVs, streaming devices, and soundbars through Cyber Monday. I’ve found the best of these deals to level up your ho…<br><a href=\"https://www.theverge.com/tech/829579/best-4k-tv-streaming-soundbar-blu-ray-player-deal-sale-black-friday\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/tech/829579/best-4k-tv-streaming-soundbar-blu-ray-player-deal-sale-black-friday",
    "topic": "it",
    "date": "2025-11-30T22:23:06.000Z"
  },
  {
    "title": "Disney Plus, Hulu, and HBO Max are all over 60 percent off for Cyber Monday",
    "q": "disney plus, hulu, and hbo max are all over 60 percent off for cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Disney Plus, Hulu, and HBO Max are all over 60 percent off for Cyber Monday</b><br>You can stream Pluribus, Severance, and other terrific Apple TV shows starting at just $5.99 a month for a limited time. The holidays are a great time to see family, exchange gifts, and enjoy a good meal. It’s also the perfect time to gath…<br><a href=\"https://www.theverge.com/gadgets/829306/best-black-friday-streaming-deals-hulu-disney-plus-paramount-hbo-max-2025\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/829306/best-black-friday-streaming-deals-hulu-disney-plus-paramount-hbo-max-2025",
    "topic": "it",
    "date": "2025-11-30T21:54:59.000Z"
  },
  {
    "title": "This Cyber Monday deal on smart glasses was too good for my husband to pass up",
    "q": "this cyber monday deal on smart glasses was too good for my husband to pass up windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This Cyber Monday deal on smart glasses was too good for my husband to pass up</b><br>You can snag a pair of Amazon’s Alexa-enabled smart glasses for an all-time low price this Cyber Monday. The last thing I need is a new Amazon Echo smart speaker. As The Verge’s smart home reviewer, I currently have a dozen scattered aroun…<br><a href=\"https://www.theverge.com/gadgets/834064/echo-frames-cyber-monday-deal-echo-spot\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/834064/echo-frames-cyber-monday-deal-echo-spot",
    "topic": "it",
    "date": "2025-11-30T20:00:00.000Z"
  },
  {
    "title": "The best Cyber Monday deals on some of my favorite smart home gear",
    "q": "the best cyber monday deals on some of my favorite smart home gear windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The best Cyber Monday deals on some of my favorite smart home gear</b><br>Apple’s HomePod is $30 off, and you can also grab a deal on the excellent Eve Energy smart plug that works with it. ‘Tis the season to score some serious bargains on smart home gear. While Black Friday is behind us, Cyber Monday is coming …<br><a href=\"https://www.theverge.com/gadgets/831719/best-black-friday-cyber-monday-smart-home-deals\" target=\"_blank\">Read more</a>",
    "link": "https://www.theverge.com/gadgets/831719/best-black-friday-cyber-monday-smart-home-deals",
    "topic": "it",
    "date": "2025-11-30T16:42:09.000Z"
  },
  {
    "title": " Walmart's 2025 Cyber Monday sale is live - Apple, Dyson, Ninja and Lego from $8 ",
    "q": " walmart's 2025 cyber monday sale is live - apple, dyson, ninja and lego from $8  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Walmart's 2025 Cyber Monday sale is live - Apple, Dyson, Ninja and Lego from $8 </b><br>Walmart's Cyber Monday sale is officially live for Walmart Plus members, and I'm rounding up tonight's best deals from Apple, Ninja, Dyson, Lego, and more.<br><a href=\"https://www.techradar.com/seasonal-sales/walmarts-2025-cyber-monday-sale-is-live-apple-dyson-ninja-and-lego-from-usd8\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/seasonal-sales/walmarts-2025-cyber-monday-sale-is-live-apple-dyson-ninja-and-lego-from-usd8",
    "topic": "it",
    "date": "2025-12-01T00:59:12.000Z"
  },
  {
    "title": " The 4 best Breville Black Friday coffee machine deals you can still nab on Cyber Monday – prices from AU$578 ",
    "q": " the 4 best breville black friday coffee machine deals you can still nab on cyber monday – prices from au$578  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> The 4 best Breville Black Friday coffee machine deals you can still nab on Cyber Monday – prices from AU$578 </b><br>Black Friday may be over, but there are still worthwhile Australian deals on Breville coffee machines to be had, and we've got some specific recommendations.<br><a href=\"https://www.techradar.com/home/coffee-machines/the-4-best-breville-black-friday-coffee-machine-deals-you-can-still-nab-on-cyber-monday-prices-from-aud578\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/home/coffee-machines/the-4-best-breville-black-friday-coffee-machine-deals-you-can-still-nab-on-cyber-monday-prices-from-aud578",
    "topic": "it",
    "date": "2025-12-01T00:56:07.000Z"
  },
  {
    "title": " This Cyber Monday Dell laptop deal is an absolute monster machine for the money but you'll need to act fast as I don't expect it to last long ",
    "q": " this cyber monday dell laptop deal is an absolute monster machine for the money but you'll need to act fast as i don't expect it to last long  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> This Cyber Monday Dell laptop deal is an absolute monster machine for the money but you'll need to act fast as I don't expect it to last long </b><br>The Dell 16 Laptop has got an eye-catching discount in Dell's Cyber Monday sale, and at this price I can't believe it's rocking an AMD Ryzen 7 250 and 16GB high-speed RAM.<br><a href=\"https://www.techradar.com/pro/this-cyber-monday-dell-laptop-deal-is-an-absolute-monster-machine-for-the-money-but-youll-need-to-act-fast-as-i-dont-expect-it-to-last-long\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/this-cyber-monday-dell-laptop-deal-is-an-absolute-monster-machine-for-the-money-but-youll-need-to-act-fast-as-i-dont-expect-it-to-last-long",
    "topic": "it",
    "date": "2025-11-30T23:55:00.000Z"
  },
  {
    "title": " Tor adds another layer to the onion with a new relay encryption algorithm - boosting resilience and security across the board ",
    "q": " tor adds another layer to the onion with a new relay encryption algorithm - boosting resilience and security across the board  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Tor adds another layer to the onion with a new relay encryption algorithm - boosting resilience and security across the board </b><br>Tor replaces its older tor1 relay encryption with CGO to strengthen privacy, block tagging attacks, and modernize authentication across circuits.<br><a href=\"https://www.techradar.com/pro/security/tor-adds-another-layer-to-the-onion-with-a-new-relay-encryption-algorithm-boosting-resilience-and-security-across-the-board\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/tor-adds-another-layer-to-the-onion-with-a-new-relay-encryption-algorithm-boosting-resilience-and-security-across-the-board",
    "topic": "it",
    "date": "2025-11-30T21:35:00.000Z"
  },
  {
    "title": " Dell says businesses still aren't moving to Windows 11 fast enough - PC maker says sales will be flat as many stick with Windows 10 ",
    "q": " dell says businesses still aren't moving to windows 11 fast enough - pc maker says sales will be flat as many stick with windows 10  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Dell says businesses still aren't moving to Windows 11 fast enough - PC maker says sales will be flat as many stick with Windows 10 </b><br>Dell reports slow Windows 11 adoption and continued hardware shortages as companies delay PC upgrades across global markets.<br><a href=\"https://www.techradar.com/pro/security/dell-says-businesses-still-arent-moving-to-windows-11-fast-enough-pc-maker-says-sales-will-be-flat-as-many-stick-with-windows-10\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/pro/security/dell-says-businesses-still-arent-moving-to-windows-11-fast-enough-pc-maker-says-sales-will-be-flat-as-many-stick-with-windows-10",
    "topic": "it",
    "date": "2025-11-30T20:27:00.000Z"
  },
  {
    "title": " Save big on the latest MacBook Air when you buy at Amazon - 26% off for Cyber Monday ",
    "q": " save big on the latest macbook air when you buy at amazon - 26% off for cyber monday  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Save big on the latest MacBook Air when you buy at Amazon - 26% off for Cyber Monday </b><br>Want a MacBook but missed Black Friday? My favorite model is 26% off in Amazon's Cyber Monday event<br><a href=\"https://www.techradar.com/computing/macbooks/save-big-on-the-latest-macbook-air-when-you-buy-at-amazon-26-percent-off-for-cyber-monday\" target=\"_blank\">Read more</a>",
    "link": "https://www.techradar.com/computing/macbooks/save-big-on-the-latest-macbook-air-when-you-buy-at-amazon-26-percent-off-for-cyber-monday",
    "topic": "it",
    "date": "2025-11-30T20:12:07.000Z"
  },
  {
    "title": "Prime Video Subscribers: Grab 6 Months of Apple TV Plus for $36 This Cyber Monday",
    "q": "prime video subscribers: grab 6 months of apple tv plus for $36 this cyber monday windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Prime Video Subscribers: Grab 6 Months of Apple TV Plus for $36 This Cyber Monday</b><br>Binge watch top-notch shows like Ted Lasso and Shrinking TV from Apple for as little as $6 per month. The best part? It's not the only deal available.<br><a href=\"https://www.cnet.com/deals/prime-video-subscribers-grab-6-months-of-apple-tv-plus-for-36-this-cyber-monday/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/deals/prime-video-subscribers-grab-6-months-of-apple-tv-plus-for-36-this-cyber-monday/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-30T17:51:00.000Z"
  },
  {
    "title": "300,000 AI-Animated Poses in an Instant: My Visit to Disney and the New Reality for Cartoons",
    "q": "300,000 ai-animated poses in an instant: my visit to disney and the new reality for cartoons windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>300,000 AI-Animated Poses in an Instant: My Visit to Disney and the New Reality for Cartoons</b><br>Disney checked out \"thousands of AI companies\" before backing one that keeps animators in the driver's seat.<br><a href=\"https://www.cnet.com/tech/services-and-software/300000-ai-animated-poses-in-an-instant-my-visit-to-disney-and-the-new-reality-for-cartoons/#ftag=CAD590a51e\" target=\"_blank\">Read more</a>",
    "link": "https://www.cnet.com/tech/services-and-software/300000-ai-animated-poses-in-an-instant-my-visit-to-disney-and-the-new-reality-for-cartoons/#ftag=CAD590a51e",
    "topic": "it",
    "date": "2025-11-30T13:17:42.000Z"
  },
  {
    "title": " Intel moves closer to building Apple’s entry-level M-series chips on 18A from 2027 — insider claims chipmaking deal could be close at hand ",
    "q": " intel moves closer to building apple’s entry-level m-series chips on 18a from 2027 — insider claims chipmaking deal could be close at hand  windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b> Intel moves closer to building Apple’s entry-level M-series chips on 18A from 2027 — insider claims chipmaking deal could be close at hand </b><br>Apple is preparing to qualify Intel’s 18A process for its lowest-end M-series processor, according to a post on X from analyst Ming-Chi Kuo.<br><a href=\"https://www.tomshardware.com/tech-industry/semiconductors/intel-moves-closer-to-building-apples-entry-level-m-series-chips-on-18a\" target=\"_blank\">Read more</a>",
    "link": "https://www.tomshardware.com/tech-industry/semiconductors/intel-moves-closer-to-building-apples-entry-level-m-series-chips-on-18a",
    "topic": "it",
    "date": "2025-11-30T15:30:00.000Z"
  },
  {
    "title": "How much RAM does your PC actually need in 2025? A Windows and Mac expert weighs in",
    "q": "how much ram does your pc actually need in 2025? a windows and mac expert weighs in windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How much RAM does your PC actually need in 2025? A Windows and Mac expert weighs in</b><br>Thinking about upgrading your slow PC? Are you unsure how much RAM you actually need? Here's what this tech reviewer thinks.<br><a href=\"https://www.zdnet.com/article/how-much-ram-does-your-pc-actually-need-in-2025-a-windows-and-mac-expert-weighs-in/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/how-much-ram-does-your-pc-actually-need-in-2025-a-windows-and-mac-expert-weighs-in/",
    "topic": "it",
    "date": "2025-12-01T10:00:00.000Z"
  },
  {
    "title": "The Windows laptop I recommend to business travelers is nearly 50% off for a limited time",
    "q": "the windows laptop i recommend to business travelers is nearly 50% off for a limited time windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>The Windows laptop I recommend to business travelers is nearly 50% off for a limited time</b><br>HP's Omnibook Ultra Flip 14 meets all the needs of professional users, offering strong performance and a lightweight design. Multiple models are on sale.<br><a href=\"https://www.zdnet.com/article/the-windows-laptop-i-recommend-to-business-travelers-is-nearly-50-off-for-a-limited-time/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/the-windows-laptop-i-recommend-to-business-travelers-is-nearly-50-off-for-a-limited-time/",
    "topic": "it",
    "date": "2025-12-01T01:25:08.000Z"
  },
  {
    "title": "Best Cyber Monday 2025 deals: These are our favorites at Amazon, Best Buy, and more",
    "q": "best cyber monday 2025 deals: these are our favorites at amazon, best buy, and more windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Best Cyber Monday 2025 deals: These are our favorites at Amazon, Best Buy, and more</b><br>Black Friday is over, and Cyber Monday is coming up tomorrow. Every major retailer is offering attractive sales on items from Apple, Samsung, LG, Roku, and more.<br><a href=\"https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-11-30/\" target=\"_blank\">Read more</a>",
    "link": "https://www.zdnet.com/article/cyber-monday-deals-2025-amazon-best-buy-hulu-11-30/",
    "topic": "it",
    "date": "2025-12-01T01:17:00.000Z"
  },
  {
    "title": "Microsoft: Windows updates make password login option invisible",
    "q": "microsoft: windows updates make password login option invisible windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Microsoft: Windows updates make password login option invisible</b><br>Microsoft warned users that Windows 11 updates released since August may cause the password sign-in option to disappear from the lock screen options, even though the button remains functional. [...]<br><a href=\"https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/microsoft/microsoft-windows-updates-hide-password-icon-on-lock-screen/",
    "topic": "it",
    "date": "2025-11-28T18:07:17.000Z"
  },
  {
    "title": "Public GitLab repositories exposed more than 17,000 secrets",
    "q": "public gitlab repositories exposed more than 17,000 secrets windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Public GitLab repositories exposed more than 17,000 secrets</b><br>After scanning all 5.6 million public repositories on GitLab Cloud, a security engineer discovered more than 17,000 exposed secrets across over 2,800 unique domains. [...]<br><a href=\"https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/\" target=\"_blank\">Read more</a>",
    "link": "https://www.bleepingcomputer.com/news/security/public-gitlab-repositories-exposed-more-than-17-000-secrets/",
    "topic": "it",
    "date": "2025-11-28T17:43:02.000Z"
  },
  {
    "title": "This is the only Linux distro I recommend for self-hosting",
    "q": "this is the only linux distro i recommend for self-hosting windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>This is the only Linux distro I recommend for self-hosting</b><br>Proxmox makes self-hosting less risky and more approachable.<br><a href=\"https://www.howtogeek.com/only-linux-distro-recommend-elf-hosting/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/only-linux-distro-recommend-elf-hosting/",
    "topic": "it",
    "date": "2025-11-30T22:15:14.000Z"
  },
  {
    "title": "These hidden Windows repair tricks fix corrupted files—and Microsoft won't tell you about it",
    "q": "these hidden windows repair tricks fix corrupted files—and microsoft won't tell you about it windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>These hidden Windows repair tricks fix corrupted files—and Microsoft won't tell you about it</b><br>Your PC is acting strange, and Microsoft isn't telling you why. Discover the hidden repair tricks to fix corrupted files before it's too late.<br><a href=\"https://www.howtogeek.com/these-hidden-windows-repair-tricks-fixe-corrupted-filesand-microsoft-wont-tell-you-about-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/these-hidden-windows-repair-tricks-fixe-corrupted-filesand-microsoft-wont-tell-you-about-it/",
    "topic": "it",
    "date": "2025-11-30T22:00:13.000Z"
  },
  {
    "title": "6 Linux apps I always run at startup (and why they’re worth it)",
    "q": "6 linux apps i always run at startup (and why they’re worth it) windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>6 Linux apps I always run at startup (and why they’re worth it)</b><br>Sometimes you just need your apps from the get-go.<br><a href=\"https://www.howtogeek.com/linux-apps-i-always-run-at-startup-and-why-theyre-worth-it/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/linux-apps-i-always-run-at-startup-and-why-theyre-worth-it/",
    "topic": "it",
    "date": "2025-11-30T21:00:14.000Z"
  },
  {
    "title": "How Phone Link and KDE Connect can connect your Android devices and Windows PC",
    "q": "how phone link and kde connect can connect your android devices and windows pc windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How Phone Link and KDE Connect can connect your Android devices and Windows PC</b><br>How to link your phone to your PC to share files, answer texts, and cut distractions while you work.<br><a href=\"https://www.howtogeek.com/how-to-sync-your-android-and-windows-devices-seamlessly/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/how-to-sync-your-android-and-windows-devices-seamlessly/",
    "topic": "it",
    "date": "2025-11-30T20:30:13.000Z"
  },
  {
    "title": "I don't use Linux for free anymore, and you shouldn't either—here's why",
    "q": "i don't use linux for free anymore, and you shouldn't either—here's why windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>I don't use Linux for free anymore, and you shouldn't either—here's why</b><br>What is the price of freedom?<br><a href=\"https://www.howtogeek.com/i-dont-use-linux-for-free-anymore-and-you-shouldnt-eitherheres-why/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/i-dont-use-linux-for-free-anymore-and-you-shouldnt-eitherheres-why/",
    "topic": "it",
    "date": "2025-11-30T19:00:14.000Z"
  },
  {
    "title": "How to clean up old Windows drivers and hidden files",
    "q": "how to clean up old windows drivers and hidden files windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>How to clean up old Windows drivers and hidden files</b><br>Speed up your computer and free up space at the same time!<br><a href=\"https://www.howtogeek.com/how-to-clean-up-old-drivers-and-hidden-files-the-smart-way/\" target=\"_blank\">Read more</a>",
    "link": "https://www.howtogeek.com/how-to-clean-up-old-drivers-and-hidden-files-the-smart-way/",
    "topic": "it",
    "date": "2025-11-30T17:30:14.000Z"
  },
  {
    "title": "One of the best gaming Linux OSes just shifted 1,000,000 GB of ISOs in a single month",
    "q": "one of the best gaming linux oses just shifted 1,000,000 gb of isos in a single month windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>One of the best gaming Linux OSes just shifted 1,000,000 GB of ISOs in a single month</b><br>That's a lot of downloading.<br><a href=\"https://www.xda-developers.com/this-gaming-linux-os-just-shifted-1000000-gb-of-iso-downloads-in-a-single-month/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/this-gaming-linux-os-just-shifted-1000000-gb-of-iso-downloads-in-a-single-month/",
    "topic": "it",
    "date": "2025-11-30T23:16:09.000Z"
  },
  {
    "title": "7 shell aliases that save me more time than any GUI utility",
    "q": "7 shell aliases that save me more time than any gui utility windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>7 shell aliases that save me more time than any GUI utility</b><br>Using shell aliases on Linux can save you a ton of time using common commands. Here are some examples of how you can use them.<br><a href=\"https://www.xda-developers.com/shell-aliases-save-more-time-than-any-gui-utility/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/shell-aliases-save-more-time-than-any-gui-utility/",
    "topic": "it",
    "date": "2025-11-30T21:00:17.000Z"
  },
  {
    "title": "Your Windows power plan is probably wrong, and fixing it makes a real difference",
    "q": "your windows power plan is probably wrong, and fixing it makes a real difference windows linux mac osx macos apple microsoft update driver bug fix troubleshoot how to tutorial command terminal powershell network wifi gpu cpu security performance tips tricks",
    "a": "<b>Your Windows power plan is probably wrong, and fixing it makes a real difference</b><br>Changing your power plan can completely change your PC's behavior<br><a href=\"https://www.xda-developers.com/your-windows-power-plan-is-probably-wrong/\" target=\"_blank\">Read more</a>",
    "link": "https://www.xda-developers.com/your-windows-power-plan-is-probably-wrong/",
    "topic": "it",
    "date": "2025-11-30T20:00:16.000Z"
  }
]